unhuman-io/obot-controller/obot2/src/STM32G474.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     STM32G474.h
 * @brief    CMSIS HeaderFile
 * @version  2.9
 * @date     Tue Oct 21 12:53:58 2025
 * @note     Generated by SVDConv V3.3.48
 *           from File '/home/lee/obot/obot-controller/obot2/STM32G474.svd',
 *           last modified on Tue Oct 21 12:53:46 2025
 */


/** @addtogroup 
  * @{
  */


/** @addtogroup STM32G474
  * @{
  */


#ifndef STM32G474_H
#define STM32G474_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M4 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  STM32G474 Specific Interrupt Numbers  ========================================== */
  WWDG_IRQn                 =   0,              /*!< 0  Window Watchdog interrupt                                              */
  PVD_PVM_IRQn              =   1,              /*!< 1  PVD through EXTI line detection                                        */
  RTC_TAMP_CSS_LSE_IRQn     =   2,              /*!< 2  RTC_TAMP_CSS_LSE                                                       */
  RTC_WKUP_IRQn             =   3,              /*!< 3  RTC Wakeup timer                                                       */
  FLASH_IRQn                =   4,              /*!< 4  FLASH                                                                  */
  RCC_IRQn                  =   5,              /*!< 5  RCC global interrupt                                                   */
  EXTI0_IRQn                =   6,              /*!< 6  EXTI Line0 interrupt                                                   */
  EXTI1_IRQn                =   7,              /*!< 7  EXTI Line1 interrupt                                                   */
  EXTI2_IRQn                =   8,              /*!< 8  EXTI Line2 interrupt                                                   */
  EXTI3_IRQn                =   9,              /*!< 9  EXTI Line3 interrupt                                                   */
  EXTI4_IRQn                =  10,              /*!< 10 EXTI Line4 interrupt                                                   */
  DMA1_CH1_IRQn             =  11,              /*!< 11 DMA1 channel 1 interrupt                                               */
  DMA1_CH2_IRQn             =  12,              /*!< 12 DMA1 channel 2 interrupt                                               */
  DMA1_CH3_IRQn             =  13,              /*!< 13 DMA1 channel 3 interrupt                                               */
  DMA1_CH4_IRQn             =  14,              /*!< 14 DMA1 channel 4 interrupt                                               */
  DMA1_CH5_IRQn             =  15,              /*!< 15 DMA1 channel 5 interrupt                                               */
  DMA1_CH6_IRQn             =  16,              /*!< 16 DMA1 channel 6 interrupt                                               */
  DMA1_CH7_IRQn             =  17,              /*!< 17 DMA1 channel 7 interrupt                                               */
  ADC1_2_IRQn               =  18,              /*!< 18 ADC1 and ADC2 global interrupt                                         */
  USB_HP_IRQn               =  19,              /*!< 19 USB_HP                                                                 */
  USB_LP_IRQn               =  20,              /*!< 20 USB_LP                                                                 */
  FDCAN1_IT0_IRQn           =  21,              /*!< 21 FDCAN1 interrupt 0                                                     */
  FDCAN1_IT1_IRQn           =  22,              /*!< 22 FDCAN1 interrupt 1                                                     */
  EXTI9_5_IRQn              =  23,              /*!< 23 EXTI9_5                                                                */
  TIM1_BRK_TIM15_IRQn       =  24,              /*!< 24 TIM1_BRK_TIM15                                                         */
  TIM1_UP_TIM16_IRQn        =  25,              /*!< 25 TIM1_UP_TIM16                                                          */
  TIM1_TRG_COM_IRQn         =  26,              /*!< 26 TIM1_TRG_COM/                                                          */
  TIM1_CC_IRQn              =  27,              /*!< 27 TIM1 capture compare interrupt                                         */
  TIM2_IRQn                 =  28,              /*!< 28 TIM2                                                                   */
  TIM3_IRQn                 =  29,              /*!< 29 TIM3                                                                   */
  TIM4_IRQn                 =  30,              /*!< 30 TIM4                                                                   */
  I2C1_EV_IRQn              =  31,              /*!< 31 I2C1_EV                                                                */
  I2C1_ER_IRQn              =  32,              /*!< 32 I2C1_ER                                                                */
  I2C2_EV_IRQn              =  33,              /*!< 33 I2C2_EV                                                                */
  I2C2_ER_IRQn              =  34,              /*!< 34 I2C2_ER                                                                */
  SPI1_IRQn                 =  35,              /*!< 35 SPI1                                                                   */
  SPI2_IRQn                 =  36,              /*!< 36 SPI2                                                                   */
  USART1_IRQn               =  37,              /*!< 37 USART1                                                                 */
  USART2_IRQn               =  38,              /*!< 38 USART2                                                                 */
  USART3_IRQn               =  39,              /*!< 39 USART3                                                                 */
  EXTI15_10_IRQn            =  40,              /*!< 40 EXTI15_10                                                              */
  RTC_ALARM_IRQn            =  41,              /*!< 41 RTC_ALARM                                                              */
  USBWakeUP_IRQn            =  42,              /*!< 42 USBWakeUP                                                              */
  TIM8_BRK_IRQn             =  43,              /*!< 43 TIM8_BRK                                                               */
  TIM8_UP_IRQn              =  44,              /*!< 44 TIM8_UP                                                                */
  TIM8_TRG_COM_IRQn         =  45,              /*!< 45 TIM8_TRG_COM                                                           */
  TIM8_CC_IRQn              =  46,              /*!< 46 TIM8_CC                                                                */
  ADC3_IRQn                 =  47,              /*!< 47 ADC3                                                                   */
  FMC_IRQn                  =  48,              /*!< 48 FMC                                                                    */
  LPTIM1_IRQn               =  49,              /*!< 49 LPTIM1                                                                 */
  TIM5_IRQn                 =  50,              /*!< 50 TIM5                                                                   */
  SPI3_IRQn                 =  51,              /*!< 51 SPI3                                                                   */
  UART4_IRQn                =  52,              /*!< 52 UART4                                                                  */
  UART5_IRQn                =  53,              /*!< 53 UART5                                                                  */
  TIM6_DACUNDER_IRQn        =  54,              /*!< 54 TIM6_DACUNDER                                                          */
  TIM7_IRQn                 =  55,              /*!< 55 TIM7                                                                   */
  DMA2_CH1_IRQn             =  56,              /*!< 56 DMA2_CH1                                                               */
  DMA2_CH2_IRQn             =  57,              /*!< 57 DMA2_CH2                                                               */
  DMA2_CH3_IRQn             =  58,              /*!< 58 DMA2_CH3                                                               */
  DMA2_CH4_IRQn             =  59,              /*!< 59 DMA2_CH4                                                               */
  DMA2_CH5_IRQn             =  60,              /*!< 60 DMA2_CH5                                                               */
  ADC4_IRQn                 =  61,              /*!< 61 ADC4                                                                   */
  ADC5_IRQn                 =  62,              /*!< 62 ADC5                                                                   */
  UCPD1_IRQn                =  63,              /*!< 63 UCPD1                                                                  */
  COMP1_2_3_IRQn            =  64,              /*!< 64 COMP1_2_3                                                              */
  COMP4_5_6_IRQn            =  65,              /*!< 65 COMP4_5_6                                                              */
  COMP7_IRQn                =  66,              /*!< 66 COMP7                                                                  */
  HRTIM_Master_IRQn_IRQn    =  67,              /*!< 67 HRTIM_Master_IRQn                                                      */
  HRTIM_TIMA_IRQn_IRQn      =  68,              /*!< 68 HRTIM_TIMA_IRQn                                                        */
  HRTIM_TIMB_IRQn_IRQn      =  69,              /*!< 69 HRTIM_TIMB_IRQn                                                        */
  HRTIM_TIMC_IRQn_IRQn      =  70,              /*!< 70 HRTIM_TIMC_IRQn                                                        */
  HRTIM_TIMD_IRQn_IRQn      =  71,              /*!< 71 HRTIM_TIMD_IRQn                                                        */
  HRTIM_TIME_IRQn_IRQn      =  72,              /*!< 72 HRTIM_TIME_IRQn                                                        */
  HRTIM_TIM_FLT_IRQn_IRQn   =  73,              /*!< 73 HRTIM_TIM_FLT_IRQn                                                     */
  HRTIM_TIMF_IRQn_IRQn      =  74,              /*!< 74 HRTIM_TIMF_IRQn                                                        */
  CRS_IRQn                  =  75,              /*!< 75 CRS                                                                    */
  SAI_IRQn                  =  76,              /*!< 76 SAI                                                                    */
  TIM20_BRK_IRQn            =  77,              /*!< 77 TIM20_BRK                                                              */
  TIM20_UP_IRQn             =  78,              /*!< 78 TIM20_UP                                                               */
  TIM20_TRG_COM_IRQn        =  79,              /*!< 79 TIM20_TRG_COM                                                          */
  TIM20_CC_IRQn             =  80,              /*!< 80 TIM20_CC                                                               */
  FPU_IRQn                  =  81,              /*!< 81 Floating point interrupt                                               */
  I2C4_EV_IRQn              =  82,              /*!< 82 I2C4_EV                                                                */
  I2C4_ER_IRQn              =  83,              /*!< 83 I2C4_ER                                                                */
  SPI4_IRQn                 =  84,              /*!< 84 SPI4                                                                   */
  FDCAN2_IT0_IRQn           =  86,              /*!< 86 FDCAN2 interrupt 0                                                     */
  FDCAN2_IT1_IRQn           =  87,              /*!< 87 FDCAN2 interrupt 1                                                     */
  FDCAN3_IT0_IRQn           =  88,              /*!< 88 FDCAN3 interrupt 0                                                     */
  FDCAN3_IT1_IRQn           =  89,              /*!< 89 FDCAN3 interrupt 1                                                     */
  RNG_IRQn                  =  90,              /*!< 90 RNG                                                                    */
  LPUART_IRQn               =  91,              /*!< 91 LPUART                                                                 */
  I2C3_EV_IRQn              =  92,              /*!< 92 I2C3_EV                                                                */
  I2C3_ER_IRQn              =  93,              /*!< 93 I2C3_ER                                                                */
  DMAMUX_OVR_IRQn           =  94,              /*!< 94 DMAMUX_OVR                                                             */
  QUADSPI_IRQn              =  95,              /*!< 95 QUADSPI                                                                */
  DMA1_CH8_IRQn             =  96,              /*!< 96 DMA1_CH8                                                               */
  DMA2_CH6_IRQn             =  97,              /*!< 97 DMA2_CH6                                                               */
  DMA2_CH7_IRQn             =  98,              /*!< 98 DMA2_CH7                                                               */
  DMA2_CH8_IRQn             =  99,              /*!< 99 DMA2_CH8                                                               */
  Cordic_IRQn               = 100,              /*!< 100  Cordic                                                               */
  FMAC_IRQn                 = 101               /*!< 101  FMAC                                                                 */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M4 Processor and Core Peripherals  =========================== */
#define __CM4_REV                 0x0001U       /*!< CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                           /*!< ARM Cortex-M4 processor and core peripherals                              */
#include "system_STM32G474.h"                   /*!< STM32G474 System                                                          */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic redundancy check calculation unit (CRC)
  */

