unhuman-io/obot-controller/obot2/src/STM32G474.h
typedef struct {                                /*!< CRC Structure                                                             */
  
  union {
    __IOM uint32_t DR;                          /*!< Data register                                                             */
    
    struct {
      __IOM uint32_t DR         : 32;           /*!< Data register bits                                                        */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t IDR;                         /*!< Independent data register                                                 */
    
    struct {
      __IOM uint32_t IDR        : 32;           /*!< General-purpose 8-bit data register bits                                  */
    } IDR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< Control register                                                          */
    
    struct {
      __OM  uint32_t RESET      : 1;            /*!< RESET bit                                                                 */
            uint32_t            : 2;
      __IOM uint32_t POLYSIZE   : 2;            /*!< Polynomial size                                                           */
      __IOM uint32_t REV_IN     : 2;            /*!< Reverse input data                                                        */
      __IOM uint32_t REV_OUT    : 1;            /*!< Reverse output data                                                       */
            uint32_t            : 24;
    } CR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t INIT;                        /*!< Initial CRC value                                                         */
    
    struct {
      __IOM uint32_t CRC_INIT   : 32;           /*!< Programmable initial CRC value                                            */
    } INIT_b;
  } ;
  
  union {
    __IOM uint32_t POL;                         /*!< polynomial                                                                */
    
    struct {
      __IOM uint32_t POL        : 32;           /*!< Programmable polynomial                                                   */
    } POL_b;
  } ;
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief WinWATCHDOG (IWDG)
  */

typedef struct {                                /*!< IWDG Structure                                                            */
  
  union {
    __OM  uint32_t KR;                          /*!< Key register                                                              */
    
    struct {
      __OM  uint32_t KEY        : 16;           /*!< Key value (write only, read 0x0000)                                       */
            uint32_t            : 16;
    } KR_b;
  } ;
  
  union {
    __IOM uint32_t PR;                          /*!< Prescaler register                                                        */
    
    struct {
      __IOM uint32_t PR         : 3;            /*!< Prescaler divider                                                         */
            uint32_t            : 29;
    } PR_b;
  } ;
  
  union {
    __IOM uint32_t RLR;                         /*!< Reload register                                                           */
    
    struct {
      __IOM uint32_t RL         : 12;           /*!< Watchdog counter reload value                                             */
            uint32_t            : 20;
    } RLR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< Status register                                                           */
    
    struct {
      __IM  uint32_t PVU        : 1;            /*!< Watchdog prescaler value update                                           */
      __IM  uint32_t RVU        : 1;            /*!< Watchdog counter reload value update                                      */
      __IM  uint32_t WVU        : 1;            /*!< Watchdog counter window value update                                      */
            uint32_t            : 29;
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t WINR;                        /*!< Window register                                                           */
    
    struct {
      __IOM uint32_t WIN        : 12;           /*!< Watchdog counter window value                                             */
            uint32_t            : 20;
    } WINR_b;
  } ;
} IWDG_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System window watchdog (WWDG)
  */

typedef struct {                                /*!< WWDG Structure                                                            */
  
  union {
    __IOM uint32_t CR;                          /*!< Control register                                                          */
    
    struct {
      __IOM uint32_t T          : 7;            /*!< 7-bit counter (MSB to LSB)                                                */
      __IOM uint32_t WDGA       : 1;            /*!< Activation bit                                                            */
            uint32_t            : 24;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFR;                         /*!< Configuration register                                                    */
    
