unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t W          : 7;            /*!< 7-bit window value                                                        */
            uint32_t            : 2;
      __IOM uint32_t EWI        : 1;            /*!< Early wakeup interrupt                                                    */
            uint32_t            : 1;
      __IOM uint32_t WDGTB      : 3;            /*!< Timer base                                                                */
            uint32_t            : 18;
    } CFR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< Status register                                                           */
    
    struct {
      __IOM uint32_t EWIF       : 1;            /*!< Early wakeup interrupt flag                                               */
            uint32_t            : 31;
    } SR_b;
  } ;
} WWDG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

typedef struct {                                /*!< I2C1 Structure                                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< Control register 1                                                        */
    
    struct {
      __IOM uint32_t PE         : 1;            /*!< Peripheral enable                                                         */
      __IOM uint32_t TXIE       : 1;            /*!< TX Interrupt enable                                                       */
      __IOM uint32_t RXIE       : 1;            /*!< RX Interrupt enable                                                       */
      __IOM uint32_t ADDRIE     : 1;            /*!< Address match interrupt enable (slave only)                               */
      __IOM uint32_t NACKIE     : 1;            /*!< Not acknowledge received interrupt enable                                 */
      __IOM uint32_t STOPIE     : 1;            /*!< STOP detection Interrupt enable                                           */
      __IOM uint32_t TCIE       : 1;            /*!< Transfer Complete interrupt enable                                        */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupts enable                                                   */
      __IOM uint32_t DNF        : 4;            /*!< Digital noise filter                                                      */
      __IOM uint32_t ANFOFF     : 1;            /*!< Analog noise filter OFF                                                   */
            uint32_t            : 1;
      __IOM uint32_t TXDMAEN    : 1;            /*!< DMA transmission requests enable                                          */
      __IOM uint32_t RXDMAEN    : 1;            /*!< DMA reception requests enable                                             */
      __IOM uint32_t SBC        : 1;            /*!< Slave byte control                                                        */
      __IOM uint32_t NOSTRETCH  : 1;            /*!< Clock stretching disable                                                  */
      __IOM uint32_t WUPEN      : 1;            /*!< Wakeup from STOP enable                                                   */
      __IOM uint32_t GCEN       : 1;            /*!< General call enable                                                       */
      __IOM uint32_t SMBHEN     : 1;            /*!< SMBus Host address enable                                                 */
      __IOM uint32_t SMBDEN     : 1;            /*!< SMBus Device Default address enable                                       */
      __IOM uint32_t ALERTEN    : 1;            /*!< SMBUS alert enable                                                        */
      __IOM uint32_t PECEN      : 1;            /*!< PEC enable                                                                */
            uint32_t            : 8;
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< Control register 2                                                        */
    
    struct {
      __IOM uint32_t SADD       : 10;           /*!< Slave address bit (master mode)                                           */
      __IOM uint32_t RD_WRN     : 1;            /*!< Transfer direction (master mode)                                          */
      __IOM uint32_t ADD10      : 1;            /*!< 10-bit addressing mode (master mode)                                      */
      __IOM uint32_t HEAD10R    : 1;            /*!< 10-bit address header only read direction (master receiver mode)          */
      __IOM uint32_t START      : 1;            /*!< Start generation                                                          */
      __IOM uint32_t STOP       : 1;            /*!< Stop generation (master mode)                                             */
      __IOM uint32_t NACK       : 1;            /*!< NACK generation (slave mode)                                              */
      __IOM uint32_t NBYTES     : 8;            /*!< Number of bytes                                                           */
      __IOM uint32_t RELOAD     : 1;            /*!< NBYTES reload mode                                                        */
      __IOM uint32_t AUTOEND    : 1;            /*!< Automatic end mode (master mode)                                          */
      __IOM uint32_t PECBYTE    : 1;            /*!< Packet error checking byte                                                */
            uint32_t            : 5;
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t OAR1;                        /*!< Own address register 1                                                    */
    
