unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t OA1        : 10;           /*!< Interface address                                                         */
      __IOM uint32_t OA1MODE    : 1;            /*!< Own Address 1 10-bit mode                                                 */
            uint32_t            : 4;
      __IOM uint32_t OA1EN      : 1;            /*!< Own Address 1 enable                                                      */
            uint32_t            : 16;
    } OAR1_b;
  } ;
  
  union {
    __IOM uint32_t OAR2;                        /*!< Own address register 2                                                    */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t OA2        : 7;            /*!< Interface address                                                         */
      __IOM uint32_t OA2MSK     : 3;            /*!< Own Address 2 masks                                                       */
            uint32_t            : 4;
      __IOM uint32_t OA2EN      : 1;            /*!< Own Address 2 enable                                                      */
            uint32_t            : 16;
    } OAR2_b;
  } ;
  
  union {
    __IOM uint32_t TIMINGR;                     /*!< Timing register                                                           */
    
    struct {
      __IOM uint32_t SCLL       : 8;            /*!< SCL low period (master mode)                                              */
      __IOM uint32_t SCLH       : 8;            /*!< SCL high period (master mode)                                             */
      __IOM uint32_t SDADEL     : 4;            /*!< Data hold time                                                            */
      __IOM uint32_t SCLDEL     : 4;            /*!< Data setup time                                                           */
            uint32_t            : 4;
      __IOM uint32_t PRESC      : 4;            /*!< Timing prescaler                                                          */
    } TIMINGR_b;
  } ;
  
  union {
    __IOM uint32_t TIMEOUTR;                    /*!< Status register 1                                                         */
    
    struct {
      __IOM uint32_t TIMEOUTA   : 12;           /*!< Bus timeout A                                                             */
      __IOM uint32_t TIDLE      : 1;            /*!< Idle clock timeout detection                                              */
            uint32_t            : 2;
      __IOM uint32_t TIMOUTEN   : 1;            /*!< Clock timeout enable                                                      */
      __IOM uint32_t TIMEOUTB   : 12;           /*!< Bus timeout B                                                             */
            uint32_t            : 3;
      __IOM uint32_t TEXTEN     : 1;            /*!< Extended clock timeout enable                                             */
    } TIMEOUTR_b;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< Interrupt and Status register                                             */
    
    struct {
      __IOM uint32_t TXE        : 1;            /*!< Transmit data register empty (transmitters)                               */
      __IOM uint32_t TXIS       : 1;            /*!< Transmit interrupt status (transmitters)                                  */
      __IM  uint32_t RXNE       : 1;            /*!< Receive data register not empty (receivers)                               */
      __IM  uint32_t ADDR       : 1;            /*!< Address matched (slave mode)                                              */
      __IM  uint32_t NACKF      : 1;            /*!< Not acknowledge received flag                                             */
      __IM  uint32_t STOPF      : 1;            /*!< Stop detection flag                                                       */
      __IM  uint32_t TC         : 1;            /*!< Transfer Complete (master mode)                                           */
      __IM  uint32_t TCR        : 1;            /*!< Transfer Complete Reload                                                  */
      __IM  uint32_t BERR       : 1;            /*!< Bus error                                                                 */
      __IM  uint32_t ARLO       : 1;            /*!< Arbitration lost                                                          */
      __IM  uint32_t OVR        : 1;            /*!< Overrun/Underrun (slave mode)                                             */
      __IM  uint32_t PECERR     : 1;            /*!< PEC Error in reception                                                    */
      __IM  uint32_t TIMEOUT    : 1;            /*!< Timeout or t_low detection flag                                           */
      __IM  uint32_t ALERT      : 1;            /*!< SMBus alert                                                               */
            uint32_t            : 1;
      __IM  uint32_t BUSY       : 1;            /*!< Bus busy                                                                  */
      __IM  uint32_t DIR        : 1;            /*!< Transfer direction (Slave mode)                                           */
      __IM  uint32_t ADDCODE    : 7;            /*!< Address match code (Slave mode)                                           */
            uint32_t            : 8;
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< Interrupt clear register                                                  */
    
    struct {
            uint32_t            : 3;
      __OM  uint32_t ADDRCF     : 1;            /*!< Address Matched flag clear                                                */
      __OM  uint32_t NACKCF     : 1;            /*!< Not Acknowledge flag clear                                                */
      __OM  uint32_t STOPCF     : 1;            /*!< Stop detection flag clear                                                 */
            uint32_t            : 2;
      __OM  uint32_t BERRCF     : 1;            /*!< Bus error flag clear                                                      */
      __OM  uint32_t ARLOCF     : 1;            /*!< Arbitration lost flag clear                                               */
      __OM  uint32_t OVRCF      : 1;            /*!< Overrun/Underrun flag clear                                               */
      __OM  uint32_t PECCF      : 1;            /*!< PEC Error flag clear                                                      */
      __OM  uint32_t TIMOUTCF   : 1;            /*!< Timeout detection flag clear                                              */
      __OM  uint32_t ALERTCF    : 1;            /*!< Alert flag clear                                                          */
            uint32_t            : 18;
    } ICR_b;
  } ;
  
  union {
    __IM  uint32_t PECR;                        /*!< PEC register                                                              */
    
