unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t PEC        : 8;            /*!< Packet error checking register                                            */
            uint32_t            : 24;
    } PECR_b;
  } ;
  
  union {
    __IM  uint32_t RXDR;                        /*!< Receive data register                                                     */
    
    struct {
      __IM  uint32_t RXDATA     : 8;            /*!< 8-bit receive data                                                        */
            uint32_t            : 24;
    } RXDR_b;
  } ;
  
  union {
    __IOM uint32_t TXDR;                        /*!< Transmit data register                                                    */
    
    struct {
      __IOM uint32_t TXDATA     : 8;            /*!< 8-bit transmit data                                                       */
            uint32_t            : 24;
    } TXDR_b;
  } ;
} I2C1_Type;                                    /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash (FLASH)
  */

typedef struct {                                /*!< FLASH Structure                                                           */
  
  union {
    __IOM uint32_t FLASH_ACR;                   /*!< Flash access control register                                             */
    
    struct {
      __IOM uint32_t LATENCY    : 4;            /*!< Latency                                                                   */
            uint32_t            : 4;
      __IOM uint32_t PRFTEN     : 1;            /*!< Prefetch enable                                                           */
      __IOM uint32_t ICEN       : 1;            /*!< Instruction cache enable                                                  */
      __IOM uint32_t DCEN       : 1;            /*!< Data cache enable                                                         */
      __IOM uint32_t ICRST      : 1;            /*!< Instruction cache reset                                                   */
      __IOM uint32_t DCRST      : 1;            /*!< Data cache reset                                                          */
      __IOM uint32_t RUN_PD     : 1;            /*!< Flash Power-down mode during Run or Low-power run mode                    */
      __IOM uint32_t SLEEP_PD   : 1;            /*!< Flash Power-down mode during Sleep or Low-power sleep mode                */
            uint32_t            : 3;
      __IOM uint32_t DBG_SWEN   : 1;            /*!< Debug software enable                                                     */
            uint32_t            : 13;
    } FLASH_ACR_b;
  } ;
  
  union {
    __OM  uint32_t FLASH_PDKEYR;                /*!< Flash Power-down key register                                             */
    
    struct {
      __OM  uint32_t PDKEYR     : 32;           /*!< Power-down in Run mode Flash key                                          */
    } FLASH_PDKEYR_b;
  } ;
  
  union {
    __OM  uint32_t FLASH_KEYR;                  /*!< Flash key register                                                        */
    
    struct {
      __OM  uint32_t KEYR       : 32;           /*!< Flash key                                                                 */
    } FLASH_KEYR_b;
  } ;
  
  union {
    __OM  uint32_t FLASH_OPTKEYR;               /*!< Flash option key register                                                 */
    
    struct {
      __OM  uint32_t OPTKEYR    : 32;           /*!< Option byte key                                                           */
    } FLASH_OPTKEYR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_SR;                    /*!< Flash status register                                                     */
    
    struct {
      __IOM uint32_t EOP        : 1;            /*!< End of operation                                                          */
      __IOM uint32_t OPERR      : 1;            /*!< Operation error                                                           */
            uint32_t            : 1;
      __IOM uint32_t PROGERR    : 1;            /*!< Programming error                                                         */
      __IOM uint32_t WRPERR     : 1;            /*!< Write protection error                                                    */
      __IOM uint32_t PGAERR     : 1;            /*!< Programming alignment error                                               */
      __IOM uint32_t SIZERR     : 1;            /*!< Size error                                                                */
      __IOM uint32_t PGSERR     : 1;            /*!< Programming sequence error                                                */
      __IOM uint32_t MISSERR    : 1;            /*!< Fast programming data miss error                                          */
      __IOM uint32_t FASTERR    : 1;            /*!< Fast programming error                                                    */
            uint32_t            : 4;
      __IOM uint32_t RDERR      : 1;            /*!< PCROP read error                                                          */
      __IOM uint32_t OPTVERR    : 1;            /*!< Option validity error                                                     */
      __IM  uint32_t BSY        : 1;            /*!< Busy                                                                      */
            uint32_t            : 15;
    } FLASH_SR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_CR;                    /*!< Flash control register                                                    */
    
