unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PG         : 1;            /*!< Programming                                                               */
      __IOM uint32_t PER        : 1;            /*!< Page erase                                                                */
      __IOM uint32_t MER1       : 1;            /*!< Bank 1 Mass erase                                                         */
      __IOM uint32_t PNB        : 7;            /*!< Page number selection                                                     */
            uint32_t            : 1;
      __IOM uint32_t BKER       : 1;            /*!< Bank erase                                                                */
            uint32_t            : 3;
      __IOM uint32_t MER2       : 1;            /*!< Bank 2 Mass erase                                                         */
      __IOM uint32_t START      : 1;            /*!< Start                                                                     */
      __IOM uint32_t OPTSTRT    : 1;            /*!< Options modification start                                                */
      __IOM uint32_t FSTPG      : 1;            /*!< Fast programming                                                          */
            uint32_t            : 5;
      __IOM uint32_t EOPIE      : 1;            /*!< End of operation interrupt enable                                         */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RDERRIE    : 1;            /*!< PCROP read error interrupt enable                                         */
      __IOM uint32_t OBL_LAUNCH : 1;            /*!< Force the option byte loading                                             */
      __IOM uint32_t SEC_PROT1  : 1;            /*!< Securable memory area protection bit for bank 1.                          */
      __IOM uint32_t SEC_PROT2  : 1;            /*!< Securable memory area protection bit for bank 2.                          */
      __IOM uint32_t OPTLOCK    : 1;            /*!< Options Lock                                                              */
      __IOM uint32_t LOCK       : 1;            /*!< FLASH_CR Lock                                                             */
    } FLASH_CR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_ECCR;                  /*!< Flash ECC register                                                        */
    
    struct {
      __IM  uint32_t ADDR_ECC   : 19;           /*!< ECC fail address                                                          */
            uint32_t            : 2;
      __IM  uint32_t BK_ECC     : 1;            /*!< ECC fail bank                                                             */
      __IM  uint32_t SYSF_ECC   : 1;            /*!< System Flash ECC fail                                                     */
            uint32_t            : 1;
      __IOM uint32_t ECCCIE     : 1;            /*!< ECC correction interrupt enable                                           */
            uint32_t            : 3;
      __IOM uint32_t ECCC2      : 1;            /*!< ECC correction                                                            */
      __IOM uint32_t ECCD2      : 1;            /*!< ECC2 detection                                                            */
      __IOM uint32_t ECCC       : 1;            /*!< ECC correction                                                            */
      __IOM uint32_t ECCD       : 1;            /*!< ECC detection                                                             */
    } FLASH_ECCR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t FLASH_OPTR;                  /*!< FLASH_OPTR                                                                */
    
    struct {
      __IOM uint32_t RDP        : 8;            /*!< Read protection level                                                     */
      __IOM uint32_t BOR_LEV    : 3;            /*!< BOR reset Level                                                           */
            uint32_t            : 1;
      __IOM uint32_t nRST_STOP  : 1;            /*!< None                                                                      */
      __IOM uint32_t nRST_STDBY : 1;            /*!< None                                                                      */
      __IOM uint32_t nRST_SHDW  : 1;            /*!< None                                                                      */
            uint32_t            : 1;
      __IOM uint32_t IWDG_SW    : 1;            /*!< Independent watchdog selection                                            */
      __IOM uint32_t IWDG_STOP  : 1;            /*!< None                                                                      */
      __IOM uint32_t IWGD_STDBY : 1;            /*!< None                                                                      */
      __IOM uint32_t WWDG_SW    : 1;            /*!< Window watchdog selection                                                 */
      __IOM uint32_t BFB2       : 1;            /*!< Dual-bank boot                                                            */
            uint32_t            : 1;
      __IOM uint32_t DBANK      : 1;            /*!< This bit can only be written when PCROPA/B is disabled.                   */
      __IOM uint32_t nBOOT1     : 1;            /*!< Boot configuration                                                        */
      __IOM uint32_t SRAM_PE    : 1;            /*!< SRAM1 and CCM SRAM parity check enable                                    */
      __IOM uint32_t CCMSRAM_RST : 1;           /*!< None                                                                      */
      __IOM uint32_t nSWBOOT0   : 1;            /*!< Software BOOT0                                                            */
      __IOM uint32_t nBOOT0     : 1;            /*!< nBOOT0 option bit                                                         */
      __IOM uint32_t NRST_MODE  : 2;            /*!< None                                                                      */
      __IOM uint32_t IRHEN      : 1;            /*!< Internal reset holder enable bit                                          */
            uint32_t            : 1;
    } FLASH_OPTR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_PCROP1SR;              /*!< Flash PCROP1 Start address register                                       */
    
