unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PCROP1_STRT : 15;          /*!< PCROP area start offset                                                   */
            uint32_t            : 17;
    } FLASH_PCROP1SR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_PCROP1ER;              /*!< Flash PCROP1 End address register                                         */
    
    struct {
      __IOM uint32_t PCROP1_END : 15;           /*!< Bank 1 PCROP area end offset                                              */
            uint32_t            : 16;
      __IOM uint32_t PCROP_RDP  : 1;            /*!< PCROP area preserved when RDP level decreased                             */
    } FLASH_PCROP1ER_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_WRP1AR;                /*!< Flash Bank 1 WRP area A address register                                  */
    
    struct {
      __IOM uint32_t WRP1A_STRT : 7;            /*!< WRP first area A start offset                                             */
            uint32_t            : 9;
      __IOM uint32_t WRP1A_END  : 7;            /*!< WRP first area A end offset                                               */
            uint32_t            : 9;
    } FLASH_WRP1AR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_WRP1BR;                /*!< Flash Bank 1 WRP area B address register                                  */
    
    struct {
      __IOM uint32_t WRP1B_STRT : 7;            /*!< WRP second area B start offset                                            */
            uint32_t            : 9;
      __IOM uint32_t WRP1B_END  : 7;            /*!< WRP second area B end offset                                              */
            uint32_t            : 9;
    } FLASH_WRP1BR_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t FLASH_PCROP2SR;              /*!< Flash PCROP2 Start address register                                       */
    
    struct {
      __IOM uint32_t PCROP2_STRT : 15;          /*!< PCROP area start offset                                                   */
            uint32_t            : 17;
    } FLASH_PCROP2SR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_PCROP2ER;              /*!< Flash PCROP2 End address register                                         */
    
    struct {
      __IOM uint32_t PCROP2_END : 15;           /*!< PCROP area end offset                                                     */
            uint32_t            : 17;
    } FLASH_PCROP2ER_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_WRP2AR;                /*!< Flash Bank 2 WRP area A address register                                  */
    
    struct {
      __IOM uint32_t WRP2A_STRT : 7;            /*!< WRP first area A start offset                                             */
            uint32_t            : 9;
      __IOM uint32_t WRP2A_END  : 7;            /*!< WRP first area A end offset                                               */
            uint32_t            : 9;
    } FLASH_WRP2AR_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_WRP2BR;                /*!< Flash Bank 2 WRP area B address register                                  */
    
    struct {
      __IOM uint32_t WRP2B_STRT : 7;            /*!< WRP second area B start offset                                            */
            uint32_t            : 9;
      __IOM uint32_t WRP2B_END  : 7;            /*!< WRP second area B end offset                                              */
            uint32_t            : 9;
    } FLASH_WRP2BR_b;
  } ;
  __IM  uint32_t  RESERVED2[7];
  
  union {
    __IOM uint32_t FLASH_SEC1R;                 /*!< Flash Securable area bank1 register                                       */
    
    struct {
      __IOM uint32_t SEC_SIZE1  : 8;            /*!< sets the number of pages used in the bank 1 Securable memory
                                                     area.                                                                     */
            uint32_t            : 8;
      __IOM uint32_t BOOT_LOCK  : 1;            /*!< used to force boot from user Flash area.                                  */
            uint32_t            : 15;
    } FLASH_SEC1R_b;
  } ;
  
  union {
    __IOM uint32_t FLASH_SEC2R;                 /*!< Flash Securable area bank2 register                                       */
    
    struct {
      __IOM uint32_t SEC_SIZE2  : 8;            /*!< sets the number of pages used in the bank 2 Securable memory
                                                     area.                                                                     */
            uint32_t            : 24;
    } FLASH_SEC2R_b;
  } ;
} FLASH_Type;                                   /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                          DBGMCU                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBGMCU)
  */

typedef struct {                                /*!< DBGMCU Structure                                                          */
  
  union {
    __IM  uint32_t IDCODE;                      /*!< MCU Device ID Code Register                                               */
    
    struct {
      __IM  uint32_t DEV_ID     : 16;           /*!< Device Identifier                                                         */
      __IM  uint32_t REV_ID     : 16;           /*!< Revision Identifier                                                       */
    } IDCODE_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< Debug MCU Configuration Register                                          */
    
    struct {
      __IOM uint32_t DBG_SLEEP  : 1;            /*!< Debug Sleep Mode                                                          */
      __IOM uint32_t DBG_STOP   : 1;            /*!< Debug Stop Mode                                                           */
      __IOM uint32_t DBG_STANDBY : 1;           /*!< Debug Standby Mode                                                        */
            uint32_t            : 2;
      __IOM uint32_t TRACE_IOEN : 1;            /*!< Trace pin assignment control                                              */
      __IOM uint32_t TRACE_MODE : 2;            /*!< Trace pin assignment control                                              */
            uint32_t            : 24;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t APB1L_FZ;                    /*!< APB Low Freeze Register 1                                                 */
    
