unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DBG_TIMER2_STOP : 1;       /*!< Debug Timer 2 stopped when Core is halted                                 */
      __IOM uint32_t DBG_TIM3_STOP : 1;         /*!< TIM3 counter stopped when core is halted                                  */
      __IOM uint32_t DBG_TIM4_STOP : 1;         /*!< TIM4 counter stopped when core is halted                                  */
      __IOM uint32_t DBG_TIM5_STOP : 1;         /*!< TIM5 counter stopped when core is halted                                  */
      __IOM uint32_t DBG_TIMER6_STOP : 1;       /*!< Debug Timer 6 stopped when Core is halted                                 */
      __IOM uint32_t DBG_TIM7_STOP : 1;         /*!< TIM7 counter stopped when core is halted                                  */
            uint32_t            : 4;
      __IOM uint32_t DBG_RTC_STOP : 1;          /*!< Debug RTC stopped when Core is halted                                     */
      __IOM uint32_t DBG_WWDG_STOP : 1;         /*!< Debug Window Wachdog stopped when Core is halted                          */
      __IOM uint32_t DBG_IWDG_STOP : 1;         /*!< Debug Independent Wachdog stopped when Core is halted                     */
            uint32_t            : 8;
      __IOM uint32_t DBG_I2C1_STOP : 1;         /*!< I2C1 SMBUS timeout mode stopped when core is halted                       */
      __IOM uint32_t DBG_I2C2_STOP : 1;         /*!< I2C2 SMBUS timeout mode stopped when core is halted                       */
            uint32_t            : 7;
      __IOM uint32_t DBG_I2C3_STOP : 1;         /*!< I2C3 SMBUS timeout mode stopped when core is halted                       */
      __IOM uint32_t DBG_LPTIMER_STOP : 1;      /*!< LPTIM1 counter stopped when core is halted                                */
    } APB1L_FZ_b;
  } ;
  
  union {
    __IOM uint32_t APB1H_FZ;                    /*!< APB Low Freeze Register 2                                                 */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t DBG_I2C4_STOP : 1;         /*!< DBG_I2C4_STOP                                                             */
            uint32_t            : 30;
    } APB1H_FZ_b;
  } ;
  
  union {
    __IOM uint32_t APB2_FZ;                     /*!< APB High Freeze Register                                                  */
    
    struct {
            uint32_t            : 11;
      __IOM uint32_t DBG_TIM1_STOP : 1;         /*!< TIM1 counter stopped when core is halted                                  */
            uint32_t            : 1;
      __IOM uint32_t DBG_TIM8_STOP : 1;         /*!< TIM8 counter stopped when core is halted                                  */
            uint32_t            : 2;
      __IOM uint32_t DBG_TIM15_STOP : 1;        /*!< TIM15 counter stopped when core is halted                                 */
      __IOM uint32_t DBG_TIM16_STOP : 1;        /*!< TIM16 counter stopped when core is halted                                 */
      __IOM uint32_t DBG_TIM17_STOP : 1;        /*!< TIM17 counter stopped when core is halted                                 */
            uint32_t            : 1;
      __IOM uint32_t DBG_TIM20_STOP : 1;        /*!< TIM20counter stopped when core is halted                                  */
            uint32_t            : 5;
      __IOM uint32_t DBG_HRTIM0_STOP : 1;       /*!< DBG_HRTIM0_STOP                                                           */
      __IOM uint32_t DBG_HRTIM1_STOP : 1;       /*!< DBG_HRTIM0_STOP                                                           */
      __IOM uint32_t DBG_HRTIM2_STOP : 1;       /*!< DBG_HRTIM0_STOP                                                           */
      __IOM uint32_t DBG_HRTIM3_STOP : 1;       /*!< DBG_HRTIM0_STOP                                                           */
            uint32_t            : 2;
    } APB2_FZ_b;
  } ;
} DBGMCU_Type;                                  /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                /*!< RCC Structure                                                             */
  
  union {
    __IOM uint32_t RCC_CR;                      /*!< Clock control register                                                    */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t HSION      : 1;            /*!< HSI16 clock enableSet and cleared by software.Cleared by hardware
                                                     to stop the HSI16 oscillator when entering Stop, Standby
                                                     or Shutdown mode.Set by hardware to force the HSI16 oscillator
                                                     ON when STOPWUCK=1 or HSIASFS = 1 when leaving Stop modes,
                                                     or in case of failure of the HSE crystal oscillator.This
                                                     bit is set by hardware if the HSI16 is used directly or
                                                     indirectly as system clock.                                               */
      __IOM uint32_t HSIKERON   : 1;            /*!< HSI16 always enable for peripheral kernels.Set and cleared by
                                                     software to force HSI16 ON even in Stop modes. The HSI16
                                                     can only feed USARTs and I<sup>2</sup>Cs peripherals configured
                                                     with HSI16 as kernel clock. Keeping the HSI16 ON in Stop
                                                     mode allows to avoid slowing down the communication speed
                                                     because of the HSI16 startup time. This bit has no effect
                                                     on HSION value.                                                           */
      __IM  uint32_t HSIRDY     : 1;            /*!< HSI16 clock ready flagSet by hardware to indicate that HSI16
                                                     oscillator is stable. This bit is set only when HSI16 is
                                                     enabled by software by setting HSION. Note: Once the HSION
                                                     bit is cleared, HSIRDY goes low after 6 HSI16 clock cycles.               */
            uint32_t            : 5;
      __IOM uint32_t HSEON      : 1;            /*!< HSE clock enableSet and cleared by software.Cleared by hardware
                                                     to stop the HSE oscillator when entering Stop, Standby
                                                     or Shutdown mode. This bit cannot be reset if the HSE oscillator
                                                     is used directly or indirectly as the system clock.                       */
      __IM  uint32_t HSERDY     : 1;            /*!< HSE clock ready flagSet by hardware to indicate that the HSE
                                                     oscillator is stable. Note: Once the HSEON bit is cleared,
                                                     HSERDY goes low after 6 HSE clock cycles.                                 */
      __IOM uint32_t HSEBYP     : 1;            /*!< HSE crystal oscillator bypassSet and cleared by software to
                                                     bypass the oscillator with an external clock. The external
                                                     clock must be enabled with the HSEON bit set, to be used
                                                     by the device. The HSEBYP bit can be written only if the
                                                     HSE oscillator is disabled.                                               */
      __IOM uint32_t CSSON      : 1;            /*!< Clock security system enableSet by software to enable the clock
                                                     security system. When CSSON is set, the clock detector
                                                     is enabled by hardware when the HSE oscillator is ready,
                                                     and disabled by hardware if a HSE clock failure is detected.
                                                     This bit is set only and is cleared by reset.                             */
            uint32_t            : 4;
      __IOM uint32_t PLLON      : 1;            /*!< Main PLL enableSet and cleared by software to enable the main
                                                     PLL.Cleared by hardware when entering Stop, Standby or
                                                     Shutdown mode. This bit cannot be reset if the PLL clock
                                                     is used as the system clock.                                              */
      __IM  uint32_t PLLRDY     : 1;            /*!< Main PLL clock ready flagSet by hardware to indicate that the
                                                     main PLL is locked.                                                       */
            uint32_t            : 6;
    } RCC_CR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_ICSCR;                   /*!< Internal clock sources calibration register                               */
    
