unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 16;
      __IM  uint32_t HSICAL     : 8;            /*!< HSI16 clock calibrationThese bits are initialized at startup
                                                     with the factory-programmed HSI16 calibration trim value.
                                                     When HSITRIM is written, HSICAL is updated with the sum
                                                     of HSITRIM and the factory trim value.                                    */
      __IOM uint32_t HSITRIM    : 7;            /*!< HSI16 clock trimmingThese bits provide an additional user-programmable
                                                     trimming value that is added to the HSICAL[7:0] bits. It
                                                     can be programmed to adjust to variations in voltage and
                                                     temperature that influence the frequency of the HSI16.The
                                                     default value is 16, which, when added to the HSICAL value,
                                                     should trim the HSI16 to 16 MHz 1 %.                                      */
            uint32_t            : 1;
    } RCC_ICSCR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CFGR;                    /*!< Clock configuration register                                              */
    
    struct {
      __IOM uint32_t SW         : 2;            /*!< System clock switchSet and cleared by software to select system
                                                     clock source (SYSCLK).Configured by hardware to force HSI16
                                                     oscillator selection when exiting stop and standby modes
                                                     or in case of failure of the HSE oscillator.                              */
      __IM  uint32_t SWS        : 2;            /*!< System clock switch statusSet and cleared by hardware to indicate
                                                     which clock source is used as system clock.                               */
      __IOM uint32_t HPRE       : 4;            /*!< AHB prescalerSet and cleared by software to control the division
                                                     factor of the AHB clock.Note: Depending on the device voltage
                                                     range, the software has to set correctly these bits to
                                                     ensure that the system frequency does not exceed the maximum
                                                     allowed frequency (for more details please refer to Section
                                                     6.1.5: Dynamic voltage scaling management). After a write
                                                     operation to these bits and before decreasing the voltage
                                                     range, this register must be read to be sure that the new
                                                     value has been taken into account.0xxx: SYSCLK not divided                */
      __IOM uint32_t PPRE1      : 3;            /*!< APB1 prescalerSet and cleared by software to control the division
                                                     factor of the APB1 clock (PCLK1).0xx: HCLK not divided                    */
      __IOM uint32_t PPRE2      : 3;            /*!< APB2 prescalerSet and cleared by software to control the division
                                                     factor of the APB2 clock (PCLK2).0xx: HCLK not divided                    */
            uint32_t            : 10;
      __IOM uint32_t MCOSEL     : 4;            /*!< Microcontroller clock output Set and cleared by software.Others:
                                                     ReservedNote: This clock output may have some truncated
                                                     cycles at startup or during MCO clock source switching.                   */
      __IOM uint32_t MCOPRE     : 3;            /*!< Microcontroller clock output prescalerThese bits are set and
                                                     cleared by software.It is highly recommended to change
                                                     this prescaler before MCO output is enabled.Others: not
                                                     allowed                                                                   */
            uint32_t            : 1;
    } RCC_CFGR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_PLLCFGR;                 /*!< PLL configuration register                                                */
    
    struct {
      __IOM uint32_t PLLSRC     : 2;            /*!< Main PLL entry clock sourceSet and cleared by software to select
                                                     PLL clock source. These bits can be written only when PLL
                                                     is disabled.In order to save power, when no PLL is used,
                                                     the value of PLLSRC should be 00.                                         */
            uint32_t            : 2;
      __IOM uint32_t PLLM       : 4;            /*!< Division factor for the main PLL input clockSet and cleared
                                                     by software to divide the PLL input clock before the VCO.
                                                     These bits can be written only when all PLLs are disabled.VCO
                                                     input frequency = PLL input clock frequency / PLLM with
                                                     1 <= PLLM <= 16...Note: The software has to set these bits
                                                     correctly to ensure that the VCO input frequency is within
                                                     the range defined in the device datasheet.                                */
      __IOM uint32_t PLLN       : 7;            /*!< Main PLL multiplication factor for VCOSet and cleared by software
                                                     to control the multiplication factor of the VCO. These
                                                     bits can be written only when the PLL is disabled. VCO
                                                     output frequency = VCO input frequency x PLLN with 8 =<
                                                     PLLN =< 127......Note: The software has to set correctly
                                                     these bits to assure that the VCO output frequency is within
                                                     the range defined in the device datasheet.                                */
            uint32_t            : 1;
      __IOM uint32_t PLLPEN     : 1;            /*!< Main PLL PLL P clock output enableSet and reset by software
                                                     to enable the PLL P clock output of the PLL.In order to
                                                     save power, when the PLL P clock output of the PLL is not
                                                     used, the value of PLLPEN should be 0.                                    */
      __IOM uint32_t PLLP       : 1;            /*!< Main PLL division factor for PLL P clock.Set and cleared by
                                                     software to control the frequency of the main PLL output
                                                     clock PLL P clock. These bits can be written only if PLL
                                                     is disabled.When the PLLPDIV[4:0] is set to 00000PLL P
                                                     output clock frequency = VCO frequency / PLLP with PLLP
                                                     =7, or 17Note: The software has to set these bits correctly
                                                     not to exceed 170 MHz on this domain.                                     */
            uint32_t            : 2;
      __IOM uint32_t PLLQEN     : 1;            /*!< Main PLL Q clock output enableSet and reset by software to enable
                                                     the PLL Q clock output of the PLL.In order to save power,
                                                     when the PLL Q clock output of the PLL is not used, the
                                                     value of PLLQEN should be 0.                                              */
      __IOM uint32_t PLLQ       : 2;            /*!< Main PLL division factor for PLL Q clock.Set and cleared by
                                                     software to control the frequency of the main PLL output
                                                     clock PLL Q clock. This output can be selected for USB,
                                                     RNG, SAI (48 MHz clock). These bits can be written only
                                                     if PLL is disabled.PLL Q output clock frequency = VCO frequency
                                                     / PLLQ with PLLQ = 2, 4, 6, or 8Note: The software has
                                                     to set these bits correctly not to exceed 170 MHz on this
                                                     domain.                                                                   */
            uint32_t            : 1;
      __IOM uint32_t PLLREN     : 1;            /*!< PLL R clock output enableSet and reset by software to enable
                                                     the PLL R clock output of the PLL (used as system clock).This
                                                     bit cannot be written when PLL R clock output of the PLL
                                                     is used as System Clock.In order to save power, when the
                                                     PLL R clock output of the PLL is not used, the value of
                                                     PLLREN should be 0.                                                       */
      __IOM uint32_t PLLR       : 2;            /*!< Main PLL division factor for PLL R clock (system clock)Set and
                                                     cleared by software to control the frequency of the main
                                                     PLL output clock PLLCLK. This output can be selected as
                                                     system clock. These bits can be written only if PLL is
                                                     disabled.PLL R output clock frequency = VCO frequency /
                                                     PLLR with PLLR = 2, 4, 6, or 8Note: The software has to
                                                     set these bits correctly not to exceed 170 MHz on this
                                                     domain.                                                                   */
      __IOM uint32_t PLLPDIV    : 5;            /*!< Main PLLP division factorSet and cleared by software to control
                                                     the PLL P frequency. PLL P output clock frequency = VCO
                                                     frequency / PLLPDIV.....                                                  */
    } RCC_PLLCFGR_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t RCC_CIER;                    /*!< Clock interrupt enable register                                           */
    
