unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LSIRDYIE   : 1;            /*!< LSI ready interrupt enableSet and cleared by software to enable/disable
                                                     interrupt caused by the LSI oscillator stabilization.                     */
      __IOM uint32_t LSERDYIE   : 1;            /*!< LSE ready interrupt enableSet and cleared by software to enable/disable
                                                     interrupt caused by the LSE oscillator stabilization.                     */
            uint32_t            : 1;
      __IOM uint32_t HSIRDYIE   : 1;            /*!< HSI16 ready interrupt enableSet and cleared by software to enable/disable
                                                     interrupt caused by the HSI16 oscillator stabilization.                   */
      __IOM uint32_t HSERDYIE   : 1;            /*!< HSE ready interrupt enableSet and cleared by software to enable/disable
                                                     interrupt caused by the HSE oscillator stabilization.                     */
      __IOM uint32_t PLLRDYIE   : 1;            /*!< PLL ready interrupt enableSet and cleared by software to enable/disable
                                                     interrupt caused by PLL lock.                                             */
            uint32_t            : 3;
      __IOM uint32_t LSECSSIE   : 1;            /*!< LSE clock security system interrupt enableSet and cleared by
                                                     software to enable/disable interrupt caused by the clock
                                                     security system on LSE.                                                   */
      __IOM uint32_t HSI48RDYIE : 1;            /*!< HSI48 ready interrupt enable Set and cleared by software to
                                                     enable/disable interrupt caused by the internal HSI48 oscillator.         */
            uint32_t            : 21;
    } RCC_CIER_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CIFR;                    /*!< Clock interrupt flag register                                             */
    
    struct {
      __IM  uint32_t LSIRDYF    : 1;            /*!< LSI ready interrupt flagSet by hardware when the LSI clock becomes
                                                     stable and LSIRDYDIE is set.Cleared by software setting
                                                     the LSIRDYC bit.                                                          */
      __IM  uint32_t LSERDYF    : 1;            /*!< LSE ready interrupt flagSet by hardware when the LSE clock becomes
                                                     stable and LSERDYDIE is set.Cleared by software setting
                                                     the LSERDYC bit.                                                          */
            uint32_t            : 1;
      __IM  uint32_t HSIRDYF    : 1;            /*!< HSI16 ready interrupt flagSet by hardware when the HSI16 clock
                                                     becomes stable and HSIRDYDIE is set in a response to setting
                                                     the HSION (refer to Clock control register (RCC_CR)). When
                                                     HSION is not set but the HSI16 oscillator is enabled by
                                                     the peripheral through a clock request, this bit is not
                                                     set and no interrupt is generated.Cleared by software setting
                                                     the HSIRDYC bit.                                                          */
      __IM  uint32_t HSERDYF    : 1;            /*!< HSE ready interrupt flagSet by hardware when the HSE clock becomes
                                                     stable and HSERDYDIE is set.Cleared by software setting
                                                     the HSERDYC bit.                                                          */
      __IM  uint32_t PLLRDYF    : 1;            /*!< PLL ready interrupt flagSet by hardware when the PLL locks and
                                                     PLLRDYDIE is set.Cleared by software setting the PLLRDYC
                                                     bit.                                                                      */
            uint32_t            : 2;
      __IM  uint32_t CSSF       : 1;            /*!< Clock security system interrupt flagSet by hardware when a failure
                                                     is detected in the HSE oscillator.Cleared by software setting
                                                     the CSSC bit.                                                             */
      __IM  uint32_t LSECSSF    : 1;            /*!< LSE Clock security system interrupt flagSet by hardware when
                                                     a failure is detected in the LSE oscillator.Cleared by
                                                     software setting the LSECSSC bit.                                         */
      __IM  uint32_t HSI48RDYF  : 1;            /*!< HSI48 ready interrupt flag Set by hardware when the HSI48 clock
                                                     becomes stable and HSI48RDYIE is set in a response to setting
                                                     the HSI48ON (refer to Clock recovery RC register (RCC_CRRCR)).
                                                     Cleared by software setting the HSI48RDYC bit.                            */
            uint32_t            : 21;
    } RCC_CIFR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CICR;                    /*!< Clock interrupt clear register                                            */
    
    struct {
      __OM  uint32_t LSIRDYC    : 1;            /*!< LSI ready interrupt clearThis bit is set by software to clear
                                                     the LSIRDYF flag.                                                         */
      __OM  uint32_t LSERDYC    : 1;            /*!< LSE ready interrupt clearThis bit is set by software to clear
                                                     the LSERDYF flag.                                                         */
            uint32_t            : 1;
      __OM  uint32_t HSIRDYC    : 1;            /*!< HSI16 ready interrupt clearThis bit is set software to clear
                                                     the HSIRDYF flag.                                                         */
      __OM  uint32_t HSERDYC    : 1;            /*!< HSE ready interrupt clearThis bit is set by software to clear
                                                     the HSERDYF flag.                                                         */
      __OM  uint32_t PLLRDYC    : 1;            /*!< PLL ready interrupt clearThis bit is set by software to clear
                                                     the PLLRDYF flag.                                                         */
            uint32_t            : 2;
      __OM  uint32_t CSSC       : 1;            /*!< Clock security system interrupt clearThis bit is set by software
                                                     to clear the CSSF flag.                                                   */
      __OM  uint32_t LSECSSC    : 1;            /*!< LSE Clock security system interrupt clearThis bit is set by
                                                     software to clear the LSECSSF flag.                                       */
      __OM  uint32_t HSI48RDYC  : 1;            /*!< HSI48 oscillator ready interrupt clear This bit is set by software
                                                     to clear the HSI48RDYF flag.                                              */
            uint32_t            : 21;
    } RCC_CICR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t RCC_AHB1RSTR;                /*!< AHB1 peripheral reset register                                            */
    
