unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DMA1RST    : 1;            /*!< DMA1 resetSet and cleared by software.                                    */
      __IOM uint32_t DMA2RST    : 1;            /*!< DMA2 resetSet and cleared by software.                                    */
      __IOM uint32_t DMAMUX1RST : 1;            /*!< Set and cleared by software.                                              */
      __IOM uint32_t CORDICRST  : 1;            /*!< Set and cleared by software                                               */
      __IOM uint32_t FMACRST    : 1;            /*!< Set and cleared by software                                               */
            uint32_t            : 3;
      __IOM uint32_t FLASHRST   : 1;            /*!< Flash memory interface resetSet and cleared by software. This
                                                     bit can be activated only when the Flash memory is in power
                                                     down mode.                                                                */
            uint32_t            : 3;
      __IOM uint32_t CRCRST     : 1;            /*!< CRC resetSet and cleared by software.                                     */
            uint32_t            : 19;
    } RCC_AHB1RSTR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB2RSTR;                /*!< AHB2 peripheral reset register                                            */
    
    struct {
      __IOM uint32_t GPIOARST   : 1;            /*!< IO port A resetSet and cleared by software.                               */
      __IOM uint32_t GPIOBRST   : 1;            /*!< IO port B resetSet and cleared by software.                               */
      __IOM uint32_t GPIOCRST   : 1;            /*!< IO port C resetSet and cleared by software.                               */
      __IOM uint32_t GPIODRST   : 1;            /*!< IO port D resetSet and cleared by software.                               */
      __IOM uint32_t GPIOERST   : 1;            /*!< IO port E resetSet and cleared by software.                               */
      __IOM uint32_t GPIOFRST   : 1;            /*!< IO port F resetSet and cleared by software.                               */
      __IOM uint32_t GPIOGRST   : 1;            /*!< IO port G resetSet and cleared by software.                               */
            uint32_t            : 6;
      __IOM uint32_t ADC12RST   : 1;            /*!< ADC12 resetSet and cleared by software.                                   */
      __IOM uint32_t ADC345RST  : 1;            /*!< ADC345 resetSet and cleared by software.                                  */
            uint32_t            : 1;
      __IOM uint32_t DAC1RST    : 1;            /*!< DAC1 resetSet and cleared by software.                                    */
      __IOM uint32_t DAC2RST    : 1;            /*!< DAC2 resetSet and cleared by software.                                    */
      __IOM uint32_t DAC3RST    : 1;            /*!< DAC3 resetSet and cleared by software.                                    */
      __IOM uint32_t DAC4RST    : 1;            /*!< DAC4 resetSet and cleared by software.                                    */
            uint32_t            : 4;
      __IOM uint32_t AESRST     : 1;            /*!< AESRST reset Set and cleared by software.                                 */
            uint32_t            : 1;
      __IOM uint32_t RNGRST     : 1;            /*!< RNG resetSet and cleared by software.                                     */
            uint32_t            : 5;
    } RCC_AHB2RSTR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB3RSTR;                /*!< AHB3 peripheral reset register                                            */
    
    struct {
      __IOM uint32_t FMCRST     : 1;            /*!< Flexible static memory controller resetSet and cleared by software.       */
            uint32_t            : 7;
      __IOM uint32_t QSPIRST    : 1;            /*!< QUADSPI resetSet and cleared by software.                                 */
            uint32_t            : 23;
    } RCC_AHB3RSTR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t RCC_APB1RSTR1;               /*!< APB1 peripheral reset register 1                                          */
    
    struct {
      __IOM uint32_t TIM2RST    : 1;            /*!< TIM2 timer resetSet and cleared by software.                              */
      __IOM uint32_t TIM3RST    : 1;            /*!< TIM3 timer resetSet and cleared by software.                              */
      __IOM uint32_t TIM4RST    : 1;            /*!< TIM3 timer resetSet and cleared by software.                              */
      __IOM uint32_t TIM5RST    : 1;            /*!< TIM5 timer resetSet and cleared by software.                              */
      __IOM uint32_t TIM6RST    : 1;            /*!< TIM6 timer resetSet and cleared by software.                              */
      __IOM uint32_t TIM7RST    : 1;            /*!< TIM7 timer resetSet and cleared by software.                              */
            uint32_t            : 2;
      __IOM uint32_t CRSRST     : 1;            /*!< CRS resetSet and cleared by software.                                     */
            uint32_t            : 5;
      __IOM uint32_t SPI2RST    : 1;            /*!< SPI2 resetSet and cleared by software.                                    */
      __IOM uint32_t SPI3RST    : 1;            /*!< SPI3 resetSet and cleared by software.                                    */
            uint32_t            : 1;
      __IOM uint32_t USART2RST  : 1;            /*!< USART2 resetSet and cleared by software.                                  */
      __IOM uint32_t USART3RST  : 1;            /*!< USART3 resetSet and cleared by software.                                  */
      __IOM uint32_t UART4RST   : 1;            /*!< UART4 resetSet and cleared by software.                                   */
      __IOM uint32_t UART5RST   : 1;            /*!< UART5 resetSet and cleared by software.                                   */
      __IOM uint32_t I2C1RST    : 1;            /*!< I2C1 resetSet and cleared by software.                                    */
      __IOM uint32_t I2C2RST    : 1;            /*!< I2C2 resetSet and cleared by software.                                    */
      __IOM uint32_t USBRST     : 1;            /*!< USB device resetSet and reset by software.                                */
            uint32_t            : 1;
      __IOM uint32_t FDCANRST   : 1;            /*!< FDCAN resetSet and reset by software.                                     */
            uint32_t            : 2;
      __IOM uint32_t PWRRST     : 1;            /*!< Power interface resetSet and cleared by software.                         */
            uint32_t            : 1;
      __IOM uint32_t I2C3RST    : 1;            /*!< I2C3 resetSet and cleared by software.                                    */
      __IOM uint32_t LPTIM1RST  : 1;            /*!< Low Power Timer 1 resetSet and cleared by software.                       */
    } RCC_APB1RSTR1_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB1RSTR2;               /*!< APB1 peripheral reset register 2                                          */
    
