unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LPUART1RST : 1;            /*!< Low-power UART 1 resetSet and cleared by software.                        */
      __IOM uint32_t I2C4RST    : 1;            /*!< I2C4 reset Set and cleared by software                                    */
            uint32_t            : 6;
      __IOM uint32_t UCPD1RST   : 1;            /*!< UCPD1 resetSet and cleared by software.                                   */
            uint32_t            : 23;
    } RCC_APB1RSTR2_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB2RSTR;                /*!< APB2 peripheral reset register                                            */
    
    struct {
      __IOM uint32_t SYSCFGRST  : 1;            /*!< SYSCFG + COMP + OPAMP + VREFBUF reset                                     */
            uint32_t            : 10;
      __IOM uint32_t TIM1RST    : 1;            /*!< TIM1 timer resetSet and cleared by software.                              */
      __IOM uint32_t SPI1RST    : 1;            /*!< SPI1 resetSet and cleared by software.                                    */
      __IOM uint32_t TIM8RST    : 1;            /*!< TIM8 timer resetSet and cleared by software.                              */
      __IOM uint32_t USART1RST  : 1;            /*!< USART1 resetSet and cleared by software.                                  */
      __IOM uint32_t SPI4RST    : 1;            /*!< SPI4 resetSet and cleared by software.                                    */
      __IOM uint32_t TIM15RST   : 1;            /*!< TIM15 timer resetSet and cleared by software.                             */
      __IOM uint32_t TIM16RST   : 1;            /*!< TIM16 timer resetSet and cleared by software.                             */
      __IOM uint32_t TIM17RST   : 1;            /*!< TIM17 timer resetSet and cleared by software.                             */
            uint32_t            : 1;
      __IOM uint32_t TIM20RST   : 1;            /*!< TIM20 resetSet and cleared by software.                                   */
      __IOM uint32_t SAI1RST    : 1;            /*!< Serial audio interface 1 (SAI1) resetSet and cleared by software.         */
            uint32_t            : 4;
      __IOM uint32_t HRTIM1RST  : 1;            /*!< HRTIM1 resetSet and cleared by software.                                  */
            uint32_t            : 5;
    } RCC_APB2RSTR_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t RCC_AHB1ENR;                 /*!< AHB1 peripheral clock enable register                                     */
    
    struct {
      __IOM uint32_t DMA1EN     : 1;            /*!< DMA1 clock enableSet and cleared by software.                             */
      __IOM uint32_t DMA2EN     : 1;            /*!< DMA2 clock enableSet and cleared by software.                             */
      __IOM uint32_t DMAMUX1EN  : 1;            /*!< DMAMUX1 clock enableSet and reset by software.                            */
      __IOM uint32_t CORDICEN   : 1;            /*!< CORDIC clock enableSet and reset by software.                             */
      __IOM uint32_t FMACEN     : 1;            /*!< FMAC enableSet and reset by software.                                     */
            uint32_t            : 3;
      __IOM uint32_t FLASHEN    : 1;            /*!< Flash memory interface clock enableSet and cleared by software.
                                                     This bit can be disabled only when the Flash is in power
                                                     down mode.                                                                */
            uint32_t            : 3;
      __IOM uint32_t CRCEN      : 1;            /*!< CRC clock enableSet and cleared by software.                              */
            uint32_t            : 19;
    } RCC_AHB1ENR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB2ENR;                 /*!< AHB2 peripheral clock enable register                                     */
    
    struct {
      __IOM uint32_t GPIOAEN    : 1;            /*!< IO port A clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIOBEN    : 1;            /*!< IO port B clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIOCEN    : 1;            /*!< IO port C clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIODEN    : 1;            /*!< IO port D clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIOEEN    : 1;            /*!< IO port E clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIOFEN    : 1;            /*!< IO port F clock enableSet and cleared by software.                        */
      __IOM uint32_t GPIOGEN    : 1;            /*!< IO port G clock enableSet and cleared by software.                        */
            uint32_t            : 6;
      __IOM uint32_t ADC12EN    : 1;            /*!< ADC12 clock enableSet and cleared by software.                            */
      __IOM uint32_t ADC345EN   : 1;            /*!< ADC345 clock enable Set and cleared by software                           */
            uint32_t            : 1;
      __IOM uint32_t DAC1EN     : 1;            /*!< DAC1 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC2EN     : 1;            /*!< DAC2 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC3EN     : 1;            /*!< DAC3 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC4EN     : 1;            /*!< DAC4 clock enableSet and cleared by software.                             */
            uint32_t            : 4;
      __IOM uint32_t AESEN      : 1;            /*!< AES clock enableSet and cleared by software.                              */
            uint32_t            : 1;
      __IOM uint32_t RNGEN      : 1;            /*!< RNG enableSet and cleared by software.                                    */
            uint32_t            : 5;
    } RCC_AHB2ENR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB3ENR;                 /*!< AHB3 peripheral clock enable register                                     */
    
