unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t FMCEN      : 1;            /*!< Flexible static memory controller clock enableSet and cleared
                                                     by software.                                                              */
            uint32_t            : 7;
      __IOM uint32_t QSPIEN     : 1;            /*!< QUADSPI memory interface clock enableSet and cleared by software.         */
            uint32_t            : 23;
    } RCC_AHB3ENR_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t RCC_APB1ENR1;                /*!< APB1 peripheral clock enable register 1                                   */
    
    struct {
      __IOM uint32_t TIM2EN     : 1;            /*!< TIM2 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t TIM3EN     : 1;            /*!< TIM3 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t TIM4EN     : 1;            /*!< TIM4 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t TIM5EN     : 1;            /*!< TIM5 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t TIM6EN     : 1;            /*!< TIM6 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t TIM7EN     : 1;            /*!< TIM7 timer clock enableSet and cleared by software.                       */
            uint32_t            : 2;
      __IOM uint32_t CRSEN      : 1;            /*!< CRS Recovery System clock enableSet and cleared by software.              */
            uint32_t            : 1;
      __IOM uint32_t RTCAPBEN   : 1;            /*!< RTC APB clock enable Set and cleared by software                          */
      __IOM uint32_t WWDGEN     : 1;            /*!< Window watchdog clock enableSet by software to enable the window
                                                     watchdog clock. Reset by hardware system reset. This bit
                                                     can also be set by hardware if the WWDG_SW option bit is
                                                     reset.                                                                    */
            uint32_t            : 2;
      __IOM uint32_t SPI2EN     : 1;            /*!< SPI2 clock enableSet and cleared by software.                             */
      __IOM uint32_t SPI3EN     : 1;            /*!< SPI3 clock enableSet and cleared by software.                             */
            uint32_t            : 1;
      __IOM uint32_t USART2EN   : 1;            /*!< USART2 clock enableSet and cleared by software.                           */
      __IOM uint32_t USART3EN   : 1;            /*!< USART3 clock enableSet and cleared by software.                           */
      __IOM uint32_t UART4EN    : 1;            /*!< UART4 clock enableSet and cleared by software.                            */
      __IOM uint32_t UART5EN    : 1;            /*!< UART5 clock enableSet and cleared by software.                            */
      __IOM uint32_t I2C1EN     : 1;            /*!< I2C1 clock enableSet and cleared by software.                             */
      __IOM uint32_t I2C2EN     : 1;            /*!< I2C2 clock enableSet and cleared by software.                             */
      __IOM uint32_t USBEN      : 1;            /*!< USB device clock enableSet and cleared by software.                       */
            uint32_t            : 1;
      __IOM uint32_t FDCANEN    : 1;            /*!< FDCAN clock enableSet and cleared by software.                            */
            uint32_t            : 2;
      __IOM uint32_t PWREN      : 1;            /*!< Power interface clock enableSet and cleared by software.                  */
            uint32_t            : 1;
      __IOM uint32_t I2C3EN     : 1;            /*!< I2C3 clock enableSet and cleared by software.                             */
      __IOM uint32_t LPTIM1EN   : 1;            /*!< Low power timer 1 clock enableSet and cleared by software.                */
    } RCC_APB1ENR1_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB1ENR2;                /*!< APB1 peripheral clock enable register 2                                   */
    
    struct {
      __IOM uint32_t LPUART1EN  : 1;            /*!< Low power UART 1 clock enableSet and cleared by software.                 */
      __IOM uint32_t I2C4EN     : 1;            /*!< I2C4 clock enable Set and cleared by software                             */
            uint32_t            : 6;
      __IOM uint32_t UCPD1EN    : 1;            /*!< UCPD1 clock enableSet and cleared by software.                            */
            uint32_t            : 23;
    } RCC_APB1ENR2_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB2ENR;                 /*!< APB2 peripheral clock enable register                                     */
    
    struct {
      __IOM uint32_t SYSCFGEN   : 1;            /*!< SYSCFG + COMP + VREFBUF + OPAMP clock enableSet and cleared
                                                     by software.                                                              */
            uint32_t            : 10;
      __IOM uint32_t TIM1EN     : 1;            /*!< TIM1 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t SPI1EN     : 1;            /*!< SPI1 clock enableSet and cleared by software.                             */
      __IOM uint32_t TIM8EN     : 1;            /*!< TIM8 timer clock enableSet and cleared by software.                       */
      __IOM uint32_t USART1EN   : 1;            /*!< USART1clock enableSet and cleared by software.                            */
      __IOM uint32_t SPI4EN     : 1;            /*!< SPI4 clock enableSet and cleared by software.                             */
      __IOM uint32_t TIM15EN    : 1;            /*!< TIM15 timer clock enableSet and cleared by software.                      */
      __IOM uint32_t TIM16EN    : 1;            /*!< TIM16 timer clock enableSet and cleared by software.                      */
      __IOM uint32_t TIM17EN    : 1;            /*!< TIM17 timer clock enableSet and cleared by software.                      */
            uint32_t            : 1;
      __IOM uint32_t TIM20EN    : 1;            /*!< TIM20 timer clock enableSet and cleared by software.                      */
      __IOM uint32_t SAI1EN     : 1;            /*!< SAI1 clock enableSet and cleared by software.                             */
            uint32_t            : 4;
      __IOM uint32_t HRTIM1EN   : 1;            /*!< HRTIM1 clock enableSet and cleared by software.                           */
            uint32_t            : 5;
    } RCC_APB2ENR_b;
  } ;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t RCC_AHB1SMENR;               /*!< AHB1 peripheral clocks enable in Sleep and Stop modes register            */
    
