unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DMA1SMEN   : 1;            /*!< DMA1 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t DMA2SMEN   : 1;            /*!< DMA2 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software during Sleep mode.                                            */
      __IOM uint32_t DMAMUX1SMEN : 1;           /*!< DMAMUX1 clock enable during Sleep and Stop modes.Set and cleared
                                                     by software.                                                              */
      __IOM uint32_t CORDICSMEN : 1;            /*!< CORDICSM clock enable.Set and cleared by software.                        */
      __IOM uint32_t FMACSMEN   : 1;            /*!< FMACSM clock enable.Set and cleared by software.                          */
            uint32_t            : 3;
      __IOM uint32_t FLASHSMEN  : 1;            /*!< Flash memory interface clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
      __IOM uint32_t SRAM1SMEN  : 1;            /*!< SRAM1 interface clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
            uint32_t            : 2;
      __IOM uint32_t CRCSMEN    : 1;            /*!< CRC clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 19;
    } RCC_AHB1SMENR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB2SMENR;               /*!< AHB2 peripheral clocks enable in Sleep and Stop modes register            */
    
    struct {
      __IOM uint32_t GPIOASMEN  : 1;            /*!< IO port A clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIOBSMEN  : 1;            /*!< IO port B clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIOCSMEN  : 1;            /*!< IO port C clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIODSMEN  : 1;            /*!< IO port D clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIOESMEN  : 1;            /*!< IO port E clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIOFSMEN  : 1;            /*!< IO port F clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t GPIOGSMEN  : 1;            /*!< IO port G clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 2;
      __IOM uint32_t CCMSRAMSMEN : 1;           /*!< CCM SRAM interface clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
      __IOM uint32_t SRAM2SMEN  : 1;            /*!< SRAM2 interface clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
            uint32_t            : 2;
      __IOM uint32_t ADC12SMEN  : 1;            /*!< ADC12 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t ADC345SMEN : 1;            /*!< ADC345 clock enableSet and cleared by software.                           */
            uint32_t            : 1;
      __IOM uint32_t DAC1SMEN   : 1;            /*!< DAC1 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC2SMEN   : 1;            /*!< DAC2 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC3SMEN   : 1;            /*!< DAC3 clock enableSet and cleared by software.                             */
      __IOM uint32_t DAC4SMEN   : 1;            /*!< DAC4 clock enableSet and cleared by software.                             */
            uint32_t            : 4;
      __IOM uint32_t AESSMEN    : 1;            /*!< AESM clocks enableSet and cleared by software.                            */
            uint32_t            : 1;
      __IOM uint32_t RNGEN      : 1;            /*!< RNG enableSet and cleared by software.                                    */
            uint32_t            : 5;
    } RCC_AHB2SMENR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_AHB3SMENR;               /*!< AHB3 peripheral clocks enable in Sleep and Stop modes register            */
    
    struct {
      __IOM uint32_t FMCSMEN    : 1;            /*!< Flexible static memory controller clocks enable during Sleep
                                                     and Stop modesSet and cleared by software.                                */
            uint32_t            : 7;
      __IOM uint32_t QSPISMEN   : 1;            /*!< QUADSPI memory interface clock enable during Sleep and Stop
                                                     modesSet and cleared by software.                                         */
            uint32_t            : 23;
    } RCC_AHB3SMENR_b;
  } ;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t RCC_APB1SMENR1;              /*!< APB1 peripheral clocks enable in Sleep and Stop modes register
                                                     1                                                                         */
    
