unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TIM2SMEN   : 1;            /*!< TIM2 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM3SMEN   : 1;            /*!< TIM3 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM4SMEN   : 1;            /*!< TIM4 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM5SMEN   : 1;            /*!< TIM5 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM6SMEN   : 1;            /*!< TIM6 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM7SMEN   : 1;            /*!< TIM7 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
            uint32_t            : 2;
      __IOM uint32_t CRSSMEN    : 1;            /*!< CRS timer clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 1;
      __IOM uint32_t RTCAPBSMEN : 1;            /*!< RTC APB clock enable during Sleep and Stop modesSet and cleared
                                                     by software                                                               */
      __IOM uint32_t WWDGSMEN   : 1;            /*!< Window watchdog clocks enable during Sleep and Stop modesSet
                                                     and cleared by software. This bit is forced to 1 by hardware
                                                     when the hardware WWDG option is activated.                               */
            uint32_t            : 2;
      __IOM uint32_t SPI2SMEN   : 1;            /*!< SPI2 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t SPI3SMEN   : 1;            /*!< SPI3 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 1;
      __IOM uint32_t USART2SMEN : 1;            /*!< USART2 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t USART3SMEN : 1;            /*!< USART3 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t UART4SMEN  : 1;            /*!< UART4 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t UART5SMEN  : 1;            /*!< UART5 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t I2C1SMEN   : 1;            /*!< I2C1 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t I2C2SMEN   : 1;            /*!< I2C2 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t USBSMEN    : 1;            /*!< USB device clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
            uint32_t            : 1;
      __IOM uint32_t FDCANSMEN  : 1;            /*!< FDCAN clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 2;
      __IOM uint32_t PWRSMEN    : 1;            /*!< Power interface clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
            uint32_t            : 1;
      __IOM uint32_t I2C3SMEN   : 1;            /*!< I2C3 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t LPTIM1SMEN : 1;            /*!< Low power timer 1 clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
    } RCC_APB1SMENR1_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB1SMENR2;              /*!< APB1 peripheral clocks enable in Sleep and Stop modes register
                                                     2                                                                         */
    
