unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LPUART1SMEN : 1;           /*!< Low power UART 1 clocks enable during Sleep and Stop modesSet
                                                     and cleared by software.                                                  */
      __IOM uint32_t I2C4SMEN   : 1;            /*!< I2C4 clocks enable during Sleep and Stop modes Set and cleared
                                                     by software                                                               */
            uint32_t            : 6;
      __IOM uint32_t UCPD1SMEN  : 1;            /*!< UCPD1 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 23;
    } RCC_APB1SMENR2_b;
  } ;
  
  union {
    __IOM uint32_t RCC_APB2SMENR;               /*!< APB2 peripheral clocks enable in Sleep and Stop modes register            */
    
    struct {
      __IOM uint32_t SYSCFGSMEN : 1;            /*!< SYSCFG + COMP + VREFBUF + OPAMP clocks enable during Sleep and
                                                     Stop modesSet and cleared by software.                                    */
            uint32_t            : 10;
      __IOM uint32_t TIM1SMEN   : 1;            /*!< TIM1 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t SPI1SMEN   : 1;            /*!< SPI1 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t TIM8SMEN   : 1;            /*!< TIM8 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t USART1SMEN : 1;            /*!< USART1clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
      __IOM uint32_t SPI4SMEN   : 1;            /*!< SPI4 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM15SMEN  : 1;            /*!< TIM15 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM16SMEN  : 1;            /*!< TIM16 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t TIM17SMEN  : 1;            /*!< TIM17 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
            uint32_t            : 1;
      __IOM uint32_t TIM20SMEN  : 1;            /*!< TIM20 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
      __IOM uint32_t SAI1SMEN   : 1;            /*!< SAI1 clocks enable during Sleep and Stop modesSet and cleared
                                                     by software.                                                              */
            uint32_t            : 4;
      __IOM uint32_t HRTIM1SMEN : 1;            /*!< HRTIM1 timer clocks enable during Sleep and Stop modesSet and
                                                     cleared by software.                                                      */
            uint32_t            : 5;
    } RCC_APB2SMENR_b;
  } ;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t RCC_CCIPR;                   /*!< Peripherals independent clock configuration register                      */
    
    struct {
      __IOM uint32_t USART1SEL  : 2;            /*!< USART1 clock source selectionThis bit is set and cleared by
                                                     software to select the USART1 clock source.                               */
      __IOM uint32_t USART2SEL  : 2;            /*!< USART2 clock source selectionThis bit is set and cleared by
                                                     software to select the USART2 clock source.                               */
      __IOM uint32_t USART3SEL  : 2;            /*!< USART3 clock source selectionThis bit is set and cleared by
                                                     software to select the USART3 clock source.                               */
      __IOM uint32_t UART4SEL   : 2;            /*!< UART4 clock source selectionThis bit is set and cleared by software
                                                     to select the UART4 clock source.                                         */
      __IOM uint32_t UART5SEL   : 2;            /*!< UART5 clock source selectionThese bits are set and cleared by
                                                     software to select the UART5 clock source.                                */
      __IOM uint32_t LPUART1SEL : 2;            /*!< LPUART1 clock source selectionThese bits are set and cleared
                                                     by software to select the LPUART1 clock source.                           */
      __IOM uint32_t I2C1SEL    : 2;            /*!< I2C1 clock source selectionThese bits are set and cleared by
                                                     software to select the I2C1 clock source.                                 */
      __IOM uint32_t I2C2SEL    : 2;            /*!< I2C2 clock source selectionThese bits are set and cleared by
                                                     software to select the I2C2 clock source.                                 */
      __IOM uint32_t I2C3SEL    : 2;            /*!< I2C3 clock source selectionThese bits are set and cleared by
                                                     software to select the I2C3 clock source.                                 */
      __IOM uint32_t LPTIM1SEL  : 2;            /*!< Low power timer 1 clock source selectionThese bits are set and
                                                     cleared by software to select the LPTIM1 clock source.                    */
      __IOM uint32_t SAI1SEL    : 2;            /*!< clock source selectionThese bits are set and cleared by software
                                                     to select the SAI clock source.                                           */
      __IOM uint32_t I2S23SEL   : 2;            /*!< clock source selectionThese bits are set and cleared by software
                                                     to select the I2S23 clock source.                                         */
      __IOM uint32_t FDCANSEL   : 2;            /*!< None                                                                      */
      __IOM uint32_t CLK48SEL   : 2;            /*!< 48 MHz clock source selectionThese bits are set and cleared
                                                     by software to select the 48 MHz clock source used by USB
                                                     device FS and RNG.                                                        */
      __IOM uint32_t ADC12SEL   : 2;            /*!< ADC1/2 clock source selectionThese bits are set and cleared
                                                     by software to select the clock source used by the ADC
                                                     interface.                                                                */
      __IOM uint32_t ADC345SEL  : 2;            /*!< ADC3/4/5 clock source selectionThese bits are set and cleared
                                                     by software to select the clock source used by the ADC345
                                                     interface.                                                                */
    } RCC_CCIPR_b;
  } ;
  __IM  uint32_t  RESERVED8;
  
  union {
    __IOM uint32_t RCC_BDCR;                    /*!< RTC domain control register                                               */
    
