unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LSEON      : 1;            /*!< LSE oscillator enableSet and cleared by software.                         */
      __IM  uint32_t LSERDY     : 1;            /*!< LSE oscillator readySet and cleared by hardware to indicate
                                                     when the external 32 kHz oscillator is stable. After the
                                                     LSEON bit is cleared, LSERDY goes low after 6 external
                                                     low-speed oscillator clock cycles.                                        */
      __IOM uint32_t LSEBYP     : 1;            /*!< LSE oscillator bypassSet and cleared by software to bypass oscillator
                                                     in debug mode. This bit can be written only when the external
                                                     32 kHz oscillator is disabled (LSEON=0 and LSERDY=0).                     */
      __IOM uint32_t LSEDRV     : 2;            /*!< LSE oscillator drive capabilitySet by software to modulate the
                                                     LSE oscillators drive capability. The oscillator is in
                                                     Xtal mode when it is not in bypass mode.                                  */
      __IOM uint32_t LSECSSON   : 1;            /*!< CSS on LSE enableSet by software to enable the Clock Security
                                                     System on LSE (32 kHz oscillator).LSECSSON must be enabled
                                                     after the LSE oscillator is enabled (LSEON bit enabled)
                                                     and ready (LSERDY flag set by hardware), and after the
                                                     RTCSEL bit is selected.Once enabled this bit cannot be
                                                     disabled, except after a LSE failure detection (LSECSSD=1).
                                                     In that case the software MUST disable the LSECSSON bit.                  */
      __IM  uint32_t LSECSSD    : 1;            /*!< CSS on LSE failure DetectionSet by hardware to indicate when
                                                     a failure has been detected by the Clock Security Systemon
                                                     the external 32 kHz oscillator (LSE).                                     */
            uint32_t            : 1;
      __IOM uint32_t RTCSEL     : 2;            /*!< RTC clock source selectionSet by software to select the clock
                                                     source for the RTC. Once the RTC clock source has been
                                                     selected, it cannot be changed anymore unless the RTC domain
                                                     is reset, or unless a failure is detected on LSE (LSECSSD
                                                     is set). The BDRST bit can be used to reset them.                         */
            uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< RTC clock enableSet and cleared by software.                              */
      __IOM uint32_t BDRST      : 1;            /*!< RTC domain software resetSet and cleared by software.                     */
            uint32_t            : 7;
      __IOM uint32_t LSCOEN     : 1;            /*!< Low speed clock output enableSet and cleared by software.                 */
      __IOM uint32_t LSCOSEL    : 1;            /*!< Low speed clock output selectionSet and cleared by software.              */
            uint32_t            : 6;
    } RCC_BDCR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CSR;                     /*!< Control/status register                                                   */
    
    struct {
      __IOM uint32_t LSION      : 1;            /*!< LSI oscillator enableSet and cleared by software.                         */
      __IM  uint32_t LSIRDY     : 1;            /*!< LSI oscillator readySet and cleared by hardware to indicate
                                                     when the LSI oscillator is stable. After the LSION bit
                                                     is cleared, LSIRDY goes low after 3 LSI oscillator clock
                                                     cycles. This bit can be set even if LSION = 0 if the LSI
                                                     is requested by the Clock Security System on LSE, by the
                                                     Independent Watchdog or by the RTC.                                       */
            uint32_t            : 21;
      __IOM uint32_t RMVF       : 1;            /*!< Remove reset flagSet by software to clear the reset flags.                */
            uint32_t            : 1;
      __IM  uint32_t OBLRSTF    : 1;            /*!< Option byte loader reset flagSet by hardware when a reset from
                                                     the Option Byte loading occurs.Cleared by writing to the
                                                     RMVF bit.                                                                 */
      __IM  uint32_t PINRSTF    : 1;            /*!< Pin reset flagSet by hardware when a reset from the NRST pin
                                                     occurs.Cleared by writing to the RMVF bit.                                */
      __IM  uint32_t BORRSTF    : 1;            /*!< BOR flagSet by hardware when a BOR occurs.Cleared by writing
                                                     to the RMVF bit.                                                          */
      __IM  uint32_t SFTRSTF    : 1;            /*!< Software reset flagSet by hardware when a software reset occurs.Cleared
                                                     by writing to the RMVF bit.                                               */
      __IM  uint32_t IWDGRSTF   : 1;            /*!< Independent window watchdog reset flagSet by hardware when an
                                                     independent watchdog reset domain occurs.Cleared by writing
                                                     to the RMVF bit.                                                          */
      __IM  uint32_t WWDGRSTF   : 1;            /*!< Window watchdog reset flagSet by hardware when a window watchdog
                                                     reset occurs.Cleared by writing to the RMVF bit.                          */
      __IM  uint32_t LPWRRSTF   : 1;            /*!< Low-power reset flagSet by hardware when a reset occurs due
                                                     to illegal Stop, Standby or Shutdown mode entry.Cleared
                                                     by writing to the RMVF bit.                                               */
    } RCC_CSR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CRRCR;                   /*!< Clock recovery RC register                                                */
    
