unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t HSI48ON    : 1;            /*!< HSI48 clock enableSet and cleared by software.Cleared by hardware
                                                     to stop the HSI48 when entering in Stop, Standby or Shutdown
                                                     modes.                                                                    */
      __IM  uint32_t HSI48RDY   : 1;            /*!< HSI48 clock ready flagSet by hardware to indicate that HSI48
                                                     oscillator is stable. This bit is set only when HSI48 is
                                                     enabled by software by setting HSI48ON.                                   */
            uint32_t            : 5;
      __IM  uint32_t HSI48CAL   : 9;            /*!< HSI48 clock calibrationThese bits are initialized at startup
                                                     with the factory-programmed HSI48 calibration trim value.They
                                                     are ready only.                                                           */
            uint32_t            : 16;
    } RCC_CRRCR_b;
  } ;
  
  union {
    __IOM uint32_t RCC_CCIPR2;                  /*!< Peripherals independent clock configuration register                      */
    
    struct {
      __IOM uint32_t I2C4SEL    : 2;            /*!< I2C4 clock source selectionThese bits are set and cleared by
                                                     software to select the I2C4 clock source.                                 */
            uint32_t            : 18;
      __IOM uint32_t QSPISEL    : 2;            /*!< QUADSPI clock source selectionSet and reset by software.                  */
            uint32_t            : 10;
    } RCC_CCIPR2_b;
  } ;
} RCC_Type;                                     /*!< Size = 160 (0xa0)                                                         */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                /*!< PWR Structure                                                             */
  
  union {
    __IOM uint32_t PWR_CR1;                     /*!< Power control register 1                                                  */
    
    struct {
      __IOM uint32_t LPMS       : 3;            /*!< Low-power mode selectionThese bits select the low-power mode
                                                     entered when CPU enters the deepsleep mode.1xx: Shutdown
                                                     modeNote: In Standby mode, SRAM2 can be preserved or not,
                                                     depending on RRS bit configuration in PWR_CR3.                            */
      __IOM uint32_t FPD_STOP   : 1;            /*!< FPD_STOP                                                                  */
            uint32_t            : 4;
      __IOM uint32_t DBP        : 1;            /*!< Disable backup domain write protectionIn reset state, the RTC
                                                     and backup registers are protected against parasitic write
                                                     access. This bit must be set to enable write access to
                                                     these registers.                                                          */
      __IOM uint32_t VOS        : 2;            /*!< Voltage scaling range selection                                           */
            uint32_t            : 3;
      __IOM uint32_t LPR        : 1;            /*!< Low-power runWhen this bit is set, the regulator is switched
                                                     from main mode (MR) to low-power mode (LPR).                              */
            uint32_t            : 17;
    } PWR_CR1_b;
  } ;
  
  union {
    __IOM uint32_t PWR_CR2;                     /*!< Power control register 2                                                  */
    
    struct {
      __IOM uint32_t PVDE       : 1;            /*!< Programmable voltage detector enableNote: This bit is write-protected
                                                     when the PVDL bit is set in the SYSCFG_CFGR2 register.
                                                     The protection can be reset only by a system reset.                       */
      __IOM uint32_t PVDLS      : 3;            /*!< Programmable voltage detector level selection.These bits select
                                                     the PVD falling threshold:Note: These bits are write-protected
                                                     when the PVDL bit is set in the SYSCFG_CFGR2 register.
                                                     The protection can be reset only by a system reset.                       */
            uint32_t            : 2;
      __IOM uint32_t PVMEN1     : 1;            /*!< Peripheral voltage monitoring 3 enable: V<sub>DDA</sub> vs.
                                                     ADC/COMP min voltage 1.62V                                                */
      __IOM uint32_t PVMEN2     : 1;            /*!< Peripheral voltage monitoring 4 enable: V<sub>DDA</sub> vs.
                                                     DAC 1MSPS /DAC 15MSPS min voltage.                                        */
            uint32_t            : 24;
    } PWR_CR2_b;
  } ;
  
  union {
    __IOM uint32_t PWR_CR3;                     /*!< Power control register 3                                                  */
    
    struct {
      __IOM uint32_t EWUP1      : 1;            /*!< Enable Wakeup pin WKUP1When this bit is set, the external wakeup
                                                     pin WKUP1 is enabled and triggers a wakeup from Standby
                                                     or Shutdown event when a rising or a falling edge occurs.
                                                     The active edge is configured via the WP1 bit in the PWR_CR4
                                                     register.                                                                 */
      __IOM uint32_t EWUP2      : 1;            /*!< Enable Wakeup pin WKUP2When this bit is set, the external wakeup
                                                     pin WKUP2 is enabled and triggers a wakeup from Standby
                                                     or Shutdown event when a rising or a falling edge occurs.
                                                     The active edge is configured via the WP2 bit in the PWR_CR4
                                                     register.                                                                 */
      __IOM uint32_t EWUP3      : 1;            /*!< Enable Wakeup pin WKUP3When this bit is set, the external wakeup
                                                     pin WKUP3 is enabled and triggers a wakeup from Standby
                                                     or Shutdown event when a rising or a falling edge occurs.
                                                     The active edge is configured via the WP3 bit in the PWR_CR4
                                                     register.                                                                 */
      __IOM uint32_t EWUP4      : 1;            /*!< Enable Wakeup pin WKUP4When this bit is set, the external wakeup
                                                     pin WKUP4 is enabled and triggers a wakeup from Standby
                                                     or Shutdown event when a rising or a falling edge occurs.
                                                     The active edge is configured via the WP4 bit in the PWR_CR4
                                                     register.                                                                 */
      __IOM uint32_t EWUP5      : 1;            /*!< Enable Wakeup pin WKUP5When this bit is set, the external wakeup
                                                     pin WKUP5 is enabled and triggers a wakeup from Standby
                                                     or Shutdown event when a rising or a falling edge occurs.The
                                                     active edge is configured via the WP5 bit in the PWR_CR4
                                                     register.                                                                 */
            uint32_t            : 3;
      __IOM uint32_t RRS        : 1;            /*!< SRAM2 retention in Standby mode                                           */
            uint32_t            : 1;
      __IOM uint32_t APC        : 1;            /*!< Apply pull-up and pull-down configurationWhen this bit is set,
                                                     the I/O pull-up and pull-down configurations defined in
                                                     the PWR_PUCRxand PWR_PDCRx registers are applied. When
                                                     this bit is cleared, the PWR_PUCRx andPWR_PDCRx registers
                                                     are not applied to the I/Os.                                              */
            uint32_t            : 2;
      __IOM uint32_t UCPD1_STDBY : 1;           /*!< UCPD1_STDBY USB Type-C and Power Delivery standby mode.                   */
      __IOM uint32_t UCPD1_DBDIS : 1;           /*!< USB Type-C and Power Delivery Dead Battery disable.After exiting
                                                     reset, the USB Type-C dead battery behavior is enabled,
                                                     which may havea pull-down effect on CC1 and CC2 pins. It
                                                     is recommended to disable it in all cases, eitherto stop
                                                     this pull-down or to hand over control to the UCPD1 (which
                                                     should therefore beinitialized before doing the disable).                 */
      __IOM uint32_t EIWUL      : 1;            /*!< Enable internal wakeup line                                               */
            uint32_t            : 16;
    } PWR_CR3_b;
  } ;
  
  union {
    __IOM uint32_t PWR_CR4;                     /*!< Power control register 4                                                  */
    
