unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t WP1        : 1;            /*!< Wakeup pin WKUP1 polarityThis bit defines the polarity used
                                                     for an event detection on external wake-up pin, WKUP1                     */
      __IOM uint32_t WP2        : 1;            /*!< Wakeup pin WKUP2 polarityThis bit defines the polarity used
                                                     for an event detection on external wake-up pin, WKUP2                     */
      __IOM uint32_t WP3        : 1;            /*!< Wakeup pin WKUP3 polarityThis bit defines the polarity used
                                                     for an event detection on external wake-up pin, WKUP3                     */
      __IOM uint32_t WP4        : 1;            /*!< Wakeup pin WKUP4 polarityThis bit defines the polarity used
                                                     for an event detection on external wake-up pin, WKUP4                     */
      __IOM uint32_t WP5        : 1;            /*!< Wakeup pin WKUP5 polarityThis bit defines the polarity used
                                                     for an event detection on external wake-up pin, WKUP5                     */
            uint32_t            : 3;
      __IOM uint32_t VBE        : 1;            /*!< V<sub>BAT</sub> battery charging enable                                   */
      __IOM uint32_t VBRS       : 1;            /*!< V<sub>BAT</sub> battery charging resistor selection                       */
            uint32_t            : 22;
    } PWR_CR4_b;
  } ;
  
  union {
    __IOM uint32_t PWR_SR1;                     /*!< Power status register 1                                                   */
    
    struct {
      __IM  uint32_t WUF1       : 1;            /*!< Wakeup flag 1This bit is set when a wakeup event is detected
                                                     on wakeup pin, WKUP1. It is cleared by writing 1 in the
                                                     CWUF1 bit of the PWR_SCR register.                                        */
      __IM  uint32_t WUF2       : 1;            /*!< Wakeup flag 2This bit is set when a wakeup event is detected
                                                     on wakeup pin, WKUP2. It is cleared by writing 1 in the
                                                     CWUF2 bit of the PWR_SCR register.                                        */
      __IM  uint32_t WUF3       : 1;            /*!< Wakeup flag 3This bit is set when a wakeup event is detected
                                                     on wakeup pin, WKUP3. It is cleared by writing 1 in the
                                                     CWUF3 bit of the PWR_SCR register.                                        */
      __IM  uint32_t WUF4       : 1;            /*!< Wakeup flag 4This bit is set when a wakeup event is detected
                                                     on wakeup pin,WKUP4. It is cleared by writing 1 in the
                                                     CWUF4 bit of the PWR_SCR register.                                        */
      __IM  uint32_t WUF5       : 1;            /*!< Wakeup flag 5This bit is set when a wakeup event is detected
                                                     on wakeup pin, WKUP5. It is cleared by writing 1 in the
                                                     CWUF5 bit of the PWR_SCR register.                                        */
            uint32_t            : 3;
      __IM  uint32_t SBF        : 1;            /*!< Standby flagThis bit is set by hardware when the device enters
                                                     the Standby mode and is cleared by setting the CSBF bit
                                                     in the PWR_SCR register, or by a power-on reset. It is
                                                     not cleared by the system reset.                                          */
            uint32_t            : 6;
      __IM  uint32_t WUFI       : 1;            /*!< Wakeup flag internalThis bit is set when a wakeup is detected
                                                     on the internal wakeup line. It is cleared when all internal
                                                     wakeup sources are cleared.                                               */
            uint32_t            : 16;
    } PWR_SR1_b;
  } ;
  
  union {
    __IOM uint32_t PWR_SR2;                     /*!< Power status register 2                                                   */
    
    struct {
            uint32_t            : 8;
      __IM  uint32_t REGLPS     : 1;            /*!< Low-power regulator startedThis bit provides the information
                                                     whether the low-power regulator is ready after a power-onreset
                                                     or a Standby/Shutdown. If the Standby mode is entered while
                                                     REGLPS bit is still cleared, the wakeup from Standby mode
                                                     time may be increased.                                                    */
      __IM  uint32_t REGLPF     : 1;            /*!< Low-power regulator flagThis bit is set by hardware when the
                                                     MCU is in Low-power run mode. When the MCU exitsthe Low-power
                                                     run mode, this bit remains at 1 until the regulator is
                                                     ready in main mode. A polling on this bit must be done
                                                     before increasing the product frequency.This bit is cleared
                                                     by hardware when the regulator is ready.                                  */
      __IM  uint32_t VOSF       : 1;            /*!< Voltage scaling flagA delay is required for the internal regulator
                                                     to be ready after the voltage scaling has been changed.
                                                     VOSF indicates that the regulator reached the voltage level
                                                     defined with VOS bits of the PWR_CR1 register.                            */
      __IM  uint32_t PVDO       : 1;            /*!< Programmable voltage detector output                                      */
            uint32_t            : 2;
      __IM  uint32_t PVMO1      : 1;            /*!< Peripheral voltage monitoring output: V<sub>DDA</sub> vs. 1.62
                                                     VNote: PVMO1 is cleared when PVM1 is disabled (PVME = 0).
                                                     After enabling PVM1, the PVM1 output is valid after the
                                                     PVM1 wakeup time.                                                         */
      __IM  uint32_t PVMO2      : 1;            /*!< Peripheral voltage monitoring output: V<sub>DDA</sub> vs. 1.8
                                                     VNote: PVMO2 is cleared when PVM2 is disabled (PVME = 0).
                                                     After enabling PVM2, the PVM2 output is valid after the
                                                     PVM2 wakeup time.                                                         */
            uint32_t            : 16;
    } PWR_SR2_b;
  } ;
  
  union {
    __IOM uint32_t PWR_SCR;                     /*!< Power status clear register                                               */
    
