unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t CWUF1      : 1;            /*!< Clear wakeup flag 1Setting this bit clears the WUF1 flag in
                                                     the PWR_SR1 register.                                                     */
      __OM  uint32_t CWUF2      : 1;            /*!< Clear wakeup flag 2Setting this bit clears the WUF2 flag in
                                                     the PWR_SR1 register.                                                     */
      __OM  uint32_t CWUF3      : 1;            /*!< Clear wakeup flag 3Setting this bit clears the WUF3 flag in
                                                     the PWR_SR1 register.                                                     */
      __OM  uint32_t CWUF4      : 1;            /*!< Clear wakeup flag 4Setting this bit clears the WUF4 flag in
                                                     the PWR_SR1 register.                                                     */
      __OM  uint32_t CWUF5      : 1;            /*!< Clear wakeup flag 5Setting this bit clears the WUF5 flag in
                                                     the PWR_SR1 register.                                                     */
            uint32_t            : 3;
      __OM  uint32_t CSBF       : 1;            /*!< Clear standby flagSetting this bit clears the SBF flag in the
                                                     PWR_SR1 register.                                                         */
            uint32_t            : 23;
    } PWR_SCR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t PWR_PUCRA;                   /*!< Power Port A pull-up control register                                     */
    
    struct {
      __IOM uint32_t PU0        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU1        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU2        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU3        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU4        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU5        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU6        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU7        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU8        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU9        : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU10       : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU11       : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU12       : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU13       : 1;            /*!< Port A pull-up bit y (y=0..13)When set, this bit activates the
                                                     pull-up on PA[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
            uint32_t            : 1;
      __IOM uint32_t PU15       : 1;            /*!< Port A pull-up bit 15When set, this bit activates the pull-up
                                                     on PA[15] when APC bit is set in PWR_CR3 register. The
                                                     pull-up is not activated if the corresponding PD15 bit
                                                     is also set.                                                              */
            uint32_t            : 16;
    } PWR_PUCRA_b;
  } ;
  
  union {
    __IOM uint32_t PWR_PDCRA;                   /*!< Power Port A pull-down control register                                   */
    
