unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PD0        : 1;            /*!< Port B pull-down bit y (y=0..3)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD1        : 1;            /*!< Port B pull-down bit y (y=0..3)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD2        : 1;            /*!< Port B pull-down bit y (y=0..3)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD3        : 1;            /*!< Port B pull-down bit y (y=0..3)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
            uint32_t            : 1;
      __IOM uint32_t PD5        : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD6        : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD7        : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD8        : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD9        : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD10       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD11       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD12       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD13       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD14       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD15       : 1;            /*!< Port B pull-down bit y (y=5..15)When set, this bit activates
                                                     the pull-down on PB[y] when APC bit is set in PWR_CR3 register.           */
            uint32_t            : 16;
    } PWR_PDCRB_b;
  } ;
  
  union {
    __IOM uint32_t PWR_PUCRC;                   /*!< Power Port C pull-up control register                                     */
    
    struct {
      __IOM uint32_t PU0        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU1        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU2        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU3        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU4        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU5        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU6        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU7        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU8        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU9        : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU10       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU11       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU12       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU13       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU14       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU15       : 1;            /*!< Port C pull-up bit y (y=0..15)When set, this bit activates the
                                                     pull-up on PC[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
            uint32_t            : 16;
    } PWR_PUCRC_b;
  } ;
  
  union {
    __IOM uint32_t PWR_PDCRC;                   /*!< Power Port C pull-down control register                                   */
    
