unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PD0        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD1        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD2        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD3        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD4        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD5        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD6        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD7        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD8        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD9        : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD10       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD11       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD12       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD13       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD14       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD15       : 1;            /*!< Port F pull-down bit y (y=0..15)When set, this bit activates
                                                     the pull-down on PF[y] when APC bit is set in PWR_CR3 register.           */
            uint32_t            : 16;
    } PWR_PDCRF_b;
  } ;
  
  union {
    __IOM uint32_t PWR_PUCRG;                   /*!< Power Port G pull-up control register                                     */
    
    struct {
      __IOM uint32_t PU0        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU1        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU2        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU3        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU4        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU5        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU6        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU7        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU8        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU9        : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
      __IOM uint32_t PU10       : 1;            /*!< Port G pull-up bit y (y=0..10)When set, this bit activates the
                                                     pull-up on PG[y] when APC bit is set in PWR_CR3 register.
                                                     The pull-up is not activated if the corresponding PDy bit
                                                     is also set.                                                              */
            uint32_t            : 21;
    } PWR_PUCRG_b;
  } ;
  
  union {
    __IOM uint32_t PWR_PDCRG;                   /*!< Power Port G pull-down control register                                   */
    
