unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PD0        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD1        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD2        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD3        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD4        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD5        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD6        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD7        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD8        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD9        : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
      __IOM uint32_t PD10       : 1;            /*!< Port G pull-down bit y (y=0..10)When set, this bit activates
                                                     the pull-down on PG[y] when APC bit is set in PWR_CR3 register.           */
            uint32_t            : 21;
    } PWR_PDCRG_b;
  } ;
  __IM  uint32_t  RESERVED1[10];
  
  union {
    __IOM uint32_t PWR_CR5;                     /*!< Power control register                                                    */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t R1MODE     : 1;            /*!< Main regular range 1 modeThis bit is only valid for the main
                                                     regulator in range 1 and has no effect on range 2. It is
                                                     recommended to reset this bit when the system frequency
                                                     is greater than 150 MHz. Refer to                                         */
            uint32_t            : 23;
    } PWR_CR5_b;
  } ;
} PWR_Type;                                     /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct {                                /*!< RNG Structure                                                             */
  
  union {
    __IOM uint32_t CR;                          /*!< control register                                                          */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t RNGEN      : 1;            /*!< Random number generator enable                                            */
      __IOM uint32_t IE         : 1;            /*!< Interrupt enable                                                          */
            uint32_t            : 1;
      __IOM uint32_t CED        : 1;            /*!< Clock error detection                                                     */
            uint32_t            : 26;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IM  uint32_t DRDY       : 1;            /*!< Data ready                                                                */
      __IM  uint32_t CECS       : 1;            /*!< Clock error current status                                                */
      __IM  uint32_t SECS       : 1;            /*!< Seed error current status                                                 */
            uint32_t            : 2;
      __IOM uint32_t CEIS       : 1;            /*!< Clock error interrupt status                                              */
      __IOM uint32_t SEIS       : 1;            /*!< Seed error interrupt status                                               */
            uint32_t            : 25;
    } SR_b;
  } ;
  
  union {
    __IM  uint32_t DR;                          /*!< data register                                                             */
    
    struct {
      __IM  uint32_t RNDATA     : 32;           /*!< Random data                                                               */
    } DR_b;
  } ;
} RNG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOA)
  */

typedef struct {                                /*!< GPIOA Structure                                                           */
  
  union {
    __IOM uint32_t MODER;                       /*!< GPIO port mode register                                                   */
    
