unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t AFRL0      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL1      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL2      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL3      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL4      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL5      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL6      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL7      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
    } AFRL_b;
  } ;
  
  union {
    __IOM uint32_t AFRH;                        /*!< GPIO alternate function high register                                     */
    
    struct {
      __IOM uint32_t AFRH8      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH9      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH10     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH11     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH12     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH13     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH14     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH15     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
    } AFRH_b;
  } ;
  
  union {
    __OM  uint32_t BRR;                         /*!< GPIO port bit reset register                                              */
    
    struct {
      __OM  uint32_t BR0        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR1        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR2        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR3        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR4        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR5        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR6        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR7        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR8        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR9        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR10       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR11       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR12       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR13       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR14       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR15       : 1;            /*!< Port Reset bit                                                            */
            uint32_t            : 16;
    } BRR_b;
  } ;
} GPIOA_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                /*!< GPIOB Structure                                                           */
  
  union {
    __IOM uint32_t MODER;                       /*!< GPIO port mode register                                                   */
    
    struct {
      __IOM uint32_t MODER0     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER1     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER2     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER3     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER4     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER5     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER6     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER7     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER8     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER9     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER10    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER11    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER12    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER13    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER14    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t MODER15    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } MODER_b;
  } ;
  
  union {
    __IOM uint32_t OTYPER;                      /*!< GPIO port output type register                                            */
    
