unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t OT0        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT1        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT2        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT3        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT4        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT5        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT6        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT7        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT8        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT9        : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT10       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT11       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT12       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT13       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT14       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OT15       : 1;            /*!< Port x configuration bits (y = 0..15)                                     */
            uint32_t            : 16;
    } OTYPER_b;
  } ;
  
  union {
    __IOM uint32_t OSPEEDR;                     /*!< GPIO port output speed register                                           */
    
    struct {
      __IOM uint32_t OSPEEDR0   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR1   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR2   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR3   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR4   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR5   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR6   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR7   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR8   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR9   : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR10  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR11  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR12  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR13  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR14  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t OSPEEDR15  : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } OSPEEDR_b;
  } ;
  
  union {
    __IOM uint32_t PUPDR;                       /*!< GPIO port pull-up/pull-down register                                      */
    
    struct {
      __IOM uint32_t PUPDR0     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR1     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR2     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR3     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR4     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR5     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR6     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR7     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR8     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR9     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR10    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR11    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR12    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR13    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR14    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR15    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } PUPDR_b;
  } ;
  
  union {
    __IM  uint32_t IDR;                         /*!< GPIO port input data register                                             */
    
