unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t IDR0       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR1       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR2       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR3       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR4       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR5       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR6       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR7       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR8       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR9       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR10      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR11      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR12      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR13      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR14      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR15      : 1;            /*!< Port input data (y = 0..15)                                               */
            uint32_t            : 16;
    } IDR_b;
  } ;
  
  union {
    __IOM uint32_t ODR;                         /*!< GPIO port output data register                                            */
    
    struct {
      __IOM uint32_t ODR0       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR1       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR2       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR3       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR4       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR5       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR6       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR7       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR8       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR9       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR10      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR11      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR12      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR13      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR14      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR15      : 1;            /*!< Port output data (y = 0..15)                                              */
            uint32_t            : 16;
    } ODR_b;
  } ;
  
  union {
    __OM  uint32_t BSRR;                        /*!< GPIO port bit set/reset register                                          */
    
    struct {
      __OM  uint32_t BS0        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS1        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS2        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS3        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS4        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS5        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS6        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS7        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS8        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS9        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS10       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS11       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS12       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS13       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS14       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS15       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BR0        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BR1        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR2        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR3        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR4        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR5        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR6        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR7        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR8        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR9        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR10       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR11       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR12       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR13       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR14       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR15       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
    } BSRR_b;
  } ;
  
  union {
    __IOM uint32_t LCKR;                        /*!< GPIO port configuration lock register                                     */
    
