unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LCK0       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK1       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK2       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK3       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK4       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK5       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK6       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK7       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK8       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK9       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK10      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK11      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK12      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK13      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK14      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK15      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCKK       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
            uint32_t            : 15;
    } LCKR_b;
  } ;
  
  union {
    __IOM uint32_t AFRL;                        /*!< GPIO alternate function low register                                      */
    
    struct {
      __IOM uint32_t AFRL0      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL1      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL2      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL3      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL4      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL5      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL6      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL7      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
    } AFRL_b;
  } ;
  
  union {
    __IOM uint32_t AFRH;                        /*!< GPIO alternate function high register                                     */
    
    struct {
      __IOM uint32_t AFRH8      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH9      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH10     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH11     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH12     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH13     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH14     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH15     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
    } AFRH_b;
  } ;
  
  union {
    __OM  uint32_t BRR;                         /*!< GPIO port bit reset register                                              */
    
    struct {
      __OM  uint32_t BR0        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR1        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR2        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR3        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR4        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR5        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR6        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR7        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR8        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR9        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR10       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR11       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR12       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR13       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR14       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR15       : 1;            /*!< Port Reset bit                                                            */
            uint32_t            : 16;
    } BRR_b;
  } ;
} GPIOB_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOC)
  */

typedef struct {                                /*!< GPIOC Structure                                                           */
  
  union {
    __IOM uint32_t MODER;                       /*!< GPIO port mode register                                                   */
    
