unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t PUPDR0     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR1     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR2     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR3     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR4     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR5     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR6     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR7     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR8     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR9     : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR10    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR11    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR12    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR13    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR14    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
      __IOM uint32_t PUPDR15    : 2;            /*!< Port x configuration bits (y = 0..15)                                     */
    } PUPDR_b;
  } ;
  
  union {
    __IM  uint32_t IDR;                         /*!< GPIO port input data register                                             */
    
    struct {
      __IM  uint32_t IDR0       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR1       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR2       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR3       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR4       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR5       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR6       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR7       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR8       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR9       : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR10      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR11      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR12      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR13      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR14      : 1;            /*!< Port input data (y = 0..15)                                               */
      __IM  uint32_t IDR15      : 1;            /*!< Port input data (y = 0..15)                                               */
            uint32_t            : 16;
    } IDR_b;
  } ;
  
  union {
    __IOM uint32_t ODR;                         /*!< GPIO port output data register                                            */
    
    struct {
      __IOM uint32_t ODR0       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR1       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR2       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR3       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR4       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR5       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR6       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR7       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR8       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR9       : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR10      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR11      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR12      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR13      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR14      : 1;            /*!< Port output data (y = 0..15)                                              */
      __IOM uint32_t ODR15      : 1;            /*!< Port output data (y = 0..15)                                              */
            uint32_t            : 16;
    } ODR_b;
  } ;
  
  union {
    __OM  uint32_t BSRR;                        /*!< GPIO port bit set/reset register                                          */
    
