unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t BS0        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS1        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS2        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS3        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS4        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS5        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS6        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS7        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS8        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS9        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS10       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS11       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS12       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS13       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS14       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BS15       : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BR0        : 1;            /*!< Port x set bit y (y= 0..15)                                               */
      __OM  uint32_t BR1        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR2        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR3        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR4        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR5        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR6        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR7        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR8        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR9        : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR10       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR11       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR12       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR13       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR14       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
      __OM  uint32_t BR15       : 1;            /*!< Port x reset bit y (y = 0..15)                                            */
    } BSRR_b;
  } ;
  
  union {
    __IOM uint32_t LCKR;                        /*!< GPIO port configuration lock register                                     */
    
    struct {
      __IOM uint32_t LCK0       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK1       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK2       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK3       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK4       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK5       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK6       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK7       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK8       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK9       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK10      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK11      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK12      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK13      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK14      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCK15      : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
      __IOM uint32_t LCKK       : 1;            /*!< Port x lock bit y (y= 0..15)                                              */
            uint32_t            : 15;
    } LCKR_b;
  } ;
  
  union {
    __IOM uint32_t AFRL;                        /*!< GPIO alternate function low register                                      */
    
