unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t AFRL0      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL1      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL2      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL3      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL4      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL5      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL6      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
      __IOM uint32_t AFRL7      : 4;            /*!< Alternate function selection for port x bit y (y = 0..7)                  */
    } AFRL_b;
  } ;
  
  union {
    __IOM uint32_t AFRH;                        /*!< GPIO alternate function high register                                     */
    
    struct {
      __IOM uint32_t AFRH8      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH9      : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH10     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH11     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH12     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH13     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH14     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
      __IOM uint32_t AFRH15     : 4;            /*!< Alternate function selection for port x bit y (y = 8..15)                 */
    } AFRH_b;
  } ;
  
  union {
    __OM  uint32_t BRR;                         /*!< GPIO port bit reset register                                              */
    
    struct {
      __OM  uint32_t BR0        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR1        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR2        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR3        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR4        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR5        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR6        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR7        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR8        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR9        : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR10       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR11       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR12       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR13       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR14       : 1;            /*!< Port Reset bit                                                            */
      __OM  uint32_t BR15       : 1;            /*!< Port Reset bit                                                            */
            uint32_t            : 16;
    } BRR_b;
  } ;
} GPIOC_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM15                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timers (TIM15)
  */

typedef struct {                                /*!< TIM15 Structure                                                           */
  
  union {
    __IOM uint32_t CR1;                         /*!< control register 1                                                        */
    
    struct {
      __IOM uint32_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint32_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint32_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint32_t OPM        : 1;            /*!< One-pulse mode                                                            */
            uint32_t            : 3;
      __IOM uint32_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint32_t CKD        : 2;            /*!< Clock division                                                            */
            uint32_t            : 1;
      __IOM uint32_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint32_t DITHEN     : 1;            /*!< Dithering Enable                                                          */
            uint32_t            : 19;
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< control register 2                                                        */
    
