unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CCPC       : 1;            /*!< Capture/compare preloaded control                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUS       : 1;            /*!< Capture/compare control update selection                                  */
      __IOM uint32_t CCDS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMS        : 3;            /*!< Master mode selection                                                     */
      __IOM uint32_t TI1S       : 1;            /*!< TI1 selection                                                             */
      __IOM uint32_t OIS1       : 1;            /*!< Output Idle state 1                                                       */
      __IOM uint32_t OIS1N      : 1;            /*!< Output Idle state 1                                                       */
      __IOM uint32_t OIS2       : 1;            /*!< Output idle state 2 (OC2 output)                                          */
            uint32_t            : 21;
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t SMCR;                        /*!< slave mode control register                                               */
    
    struct {
      __IOM uint32_t SMS        : 3;            /*!< Slave mode selection                                                      */
            uint32_t            : 1;
      __IOM uint32_t TS         : 3;            /*!< Trigger selection                                                         */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
            uint32_t            : 8;
      __IOM uint32_t SMS_3      : 1;            /*!< Slave mode selection - bit 3                                              */
            uint32_t            : 3;
      __IOM uint32_t TS_4_3     : 2;            /*!< Trigger selection - bit 4:3                                               */
            uint32_t            : 10;
    } SMCR_b;
  } ;
  
  union {
    __IOM uint32_t DIER;                        /*!< DMA/Interrupt enable register                                             */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CC1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CC2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
            uint32_t            : 2;
      __IOM uint32_t COMIE      : 1;            /*!< COM interrupt enable                                                      */
      __IOM uint32_t TIE        : 1;            /*!< Trigger interrupt enable                                                  */
      __IOM uint32_t BIE        : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UDE        : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CC1DE      : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CC2DE      : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
            uint32_t            : 2;
      __IOM uint32_t COMDE      : 1;            /*!< COM DMA request enable                                                    */
      __IOM uint32_t TDE        : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 17;
    } DIER_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IOM uint32_t UIF        : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CC1IF      : 1;            /*!< Capture/compare 1 interrupt flag                                          */
      __IOM uint32_t CC2IF      : 1;            /*!< Capture/compare 2 interrupt flag                                          */
            uint32_t            : 2;
      __IOM uint32_t COMIF      : 1;            /*!< COM interrupt flag                                                        */
      __IOM uint32_t TIF        : 1;            /*!< Trigger interrupt flag                                                    */
      __IOM uint32_t BIF        : 1;            /*!< Break interrupt flag                                                      */
            uint32_t            : 1;
      __IOM uint32_t CC1OF      : 1;            /*!< Capture/Compare 1 overcapture flag                                        */
      __IOM uint32_t CC2OF      : 1;            /*!< Capture/Compare 2 overcapture flag                                        */
            uint32_t            : 21;
    } SR_b;
  } ;
  
  union {
    __OM  uint32_t EGR;                         /*!< event generation register                                                 */
    
    struct {
      __OM  uint32_t UG         : 1;            /*!< Update generation                                                         */
      __OM  uint32_t CC1G       : 1;            /*!< Capture/compare 1 generation                                              */
      __OM  uint32_t CC2G       : 1;            /*!< Capture/compare 2 generation                                              */
            uint32_t            : 2;
      __OM  uint32_t COMG       : 1;            /*!< Capture/Compare control update generation                                 */
      __OM  uint32_t TG         : 1;            /*!< Trigger generation                                                        */
      __OM  uint32_t BG         : 1;            /*!< Break generation                                                          */
            uint32_t            : 24;
    } EGR_b;
  } ;
  
  union {
    union {
      __IOM uint32_t CCMR1_Output;              /*!< capture/compare mode register (output mode)                               */
      
