unhuman-io/obot-controller/obot2/src/STM32G474.h
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t OC1FE    : 1;            /*!< Output Compare 1 fast enable                                              */
        __IOM uint32_t OC1PE    : 1;            /*!< Output Compare 1 preload enable                                           */
        __IOM uint32_t OC1M     : 3;            /*!< Output Compare 1 mode                                                     */
        __IOM uint32_t OC1CE    : 1;            /*!< OC1CE                                                                     */
        __IOM uint32_t CC2S     : 2;            /*!< CC2S                                                                      */
        __IOM uint32_t OC2FE    : 1;            /*!< OC2FE                                                                     */
        __IOM uint32_t OC2PE    : 1;            /*!< OC2PE                                                                     */
        __IOM uint32_t OC2M     : 3;            /*!< OC2M                                                                      */
              uint32_t          : 1;
        __IOM uint32_t OC1M_3   : 1;            /*!< Output Compare 1 mode                                                     */
              uint32_t          : 7;
        __IOM uint32_t OC2M_3   : 1;            /*!< Output Compare 2 mode - bit 3                                             */
              uint32_t          : 7;
      } CCMR1_Output_b;
    } ;
    
    union {
      __IOM uint32_t CCMR1_Input;               /*!< capture/compare mode register 1 (input mode)                              */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t IC1PSC   : 2;            /*!< Input capture 1 prescaler                                                 */
        __IOM uint32_t IC1F     : 4;            /*!< Input capture 1 filter                                                    */
        __IOM uint32_t CC2S     : 2;            /*!< CC2S                                                                      */
        __IOM uint32_t IC2PSC   : 2;            /*!< IC2PSC                                                                    */
        __IOM uint32_t IC2F     : 4;            /*!< IC2F                                                                      */
              uint32_t          : 16;
      } CCMR1_Input_b;
    } ;
  };
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CCER;                        /*!< capture/compare enable register                                           */
    
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint32_t CC1P       : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CC1NE      : 1;            /*!< Capture/Compare 1 complementary output enable                             */
      __IOM uint32_t CC1NP      : 1;            /*!< Capture/Compare 1 output Polarity                                         */
      __IOM uint32_t CC2E       : 1;            /*!< Capture/Compare 2 output enable                                           */
      __IOM uint32_t CC2P       : 1;            /*!< Capture/Compare 2 output polarity                                         */
            uint32_t            : 1;
      __IOM uint32_t CC2NP      : 1;            /*!< Capture/Compare 2 complementary output polarity                           */
            uint32_t            : 24;
    } CCER_b;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< counter                                                                   */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< counter value                                                             */
            uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< UIF Copy                                                                  */
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< prescaler                                                                 */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< Prescaler value                                                           */
            uint32_t            : 16;
    } PSC_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< auto-reload register                                                      */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< Auto-reload value                                                         */
            uint32_t            : 16;
    } ARR_b;
  } ;
  
  union {
    __IOM uint32_t RCR;                         /*!< repetition counter register                                               */
    
    struct {
      __IOM uint32_t REP        : 8;            /*!< Repetition counter value                                                  */
            uint32_t            : 24;
    } RCR_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< capture/compare register 1                                                */
    
    struct {
      __IOM uint32_t CCR1       : 16;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 16;
    } CCR1_b;
  } ;
  
  union {
    __IOM uint32_t CCR2;                        /*!< capture/compare register 2                                                */
    
    struct {
      __IOM uint32_t CCR2       : 16;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 16;
    } CCR2_b;
  } ;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t BDTR;                        /*!< break and dead-time register                                              */
    
