unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DTG        : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t LOCK       : 2;            /*!< Lock configuration                                                        */
      __IOM uint32_t OSSI       : 1;            /*!< Off-state selection for Idle mode                                         */
      __IOM uint32_t OSSR       : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BKE        : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BKP        : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t AOE        : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t MOE        : 1;            /*!< Main output enable                                                        */
      __IOM uint32_t BKF        : 4;            /*!< Break filter                                                              */
            uint32_t            : 6;
      __IOM uint32_t BKDSRM     : 1;            /*!< BKDSRM                                                                    */
            uint32_t            : 1;
      __IOM uint32_t BKBID      : 1;            /*!< BKBID                                                                     */
            uint32_t            : 3;
    } BDTR_b;
  } ;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t DTR2;                        /*!< timer Deadtime Register 2                                                 */
    
    struct {
      __IOM uint32_t DTGF       : 8;            /*!< Dead-time generator setup                                                 */
            uint32_t            : 8;
      __IOM uint32_t DTAE       : 1;            /*!< Deadtime Asymmetric Enable                                                */
      __IOM uint32_t DTPE       : 1;            /*!< Deadtime Preload Enable                                                   */
            uint32_t            : 14;
    } DTR2_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t TISEL;                       /*!< TIM timer input selection register                                        */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< TI1[0] to TI1[15] input selection                                         */
            uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< TI2[0] to TI2[15] input selection                                         */
            uint32_t            : 20;
    } TISEL_b;
  } ;
  
  union {
    __IOM uint32_t AF1;                         /*!< TIM alternate function option register 1                                  */
    
    struct {
      __IOM uint32_t BKINE      : 1;            /*!< BRK BKIN input enable                                                     */
      __IOM uint32_t BKCMP1E    : 1;            /*!< BRK COMP1 enable                                                          */
      __IOM uint32_t BKCMP2E    : 1;            /*!< BRK COMP2 enable                                                          */
      __IOM uint32_t BKCMP3E    : 1;            /*!< BRK COMP3 enable                                                          */
      __IOM uint32_t BKCMP4E    : 1;            /*!< BRK COMP4 enable                                                          */
      __IOM uint32_t BKCMP5E    : 1;            /*!< BRK COMP5 enable                                                          */
      __IOM uint32_t BKCMP6E    : 1;            /*!< BRK COMP6 enable                                                          */
      __IOM uint32_t BKCMP7E    : 1;            /*!< BRK COMP7 enable                                                          */
            uint32_t            : 1;
      __IOM uint32_t BKINP      : 1;            /*!< BRK BKIN input polarity                                                   */
      __IOM uint32_t BKCMP1P    : 1;            /*!< BRK COMP1 input polarity                                                  */
      __IOM uint32_t BKCMP2P    : 1;            /*!< BRK COMP2 input polarity                                                  */
      __IOM uint32_t BKCMP3P    : 1;            /*!< BRK COMP3 input polarity                                                  */
      __IOM uint32_t BKCMP4P    : 1;            /*!< BRK COMP4 input polarity                                                  */
            uint32_t            : 18;
    } AF1_b;
  } ;
  
  union {
    __IOM uint32_t AF2;                         /*!< TIM alternate function option register 2                                  */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t OCRSEL     : 3;            /*!< OCREF_CLR source selection                                                */
            uint32_t            : 13;
    } AF2_b;
  } ;
  __IM  uint32_t  RESERVED4[221];
  
  union {
    __IOM uint32_t DCR;                         /*!< DMA control register                                                      */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } DCR_b;
  } ;
  
  union {
    __IOM uint32_t DMAR;                        /*!< DMA address for full transfer                                             */
    
    struct {
      __IOM uint32_t DMAB       : 32;           /*!< DMA register for burst accesses                                           */
    } DMAR_b;
  } ;
} TIM15_Type;                                   /*!< Size = 996 (0x3e4)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIM16                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timers (TIM16)
  */

