unhuman-io/obot-controller/obot2/src/STM32G474.h
typedef struct {                                /*!< TIM16 Structure                                                           */
  
  union {
    __IOM uint16_t TIM16_CR1;                   /*!< TIM16 control register 1                                                  */
    
    struct {
      __IOM uint16_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint16_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint16_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint16_t OPM        : 1;            /*!< One pulse mode                                                            */
            uint16_t            : 3;
      __IOM uint16_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint16_t CKD        : 2;            /*!< Clock division                                                            */
            uint16_t            : 1;
      __IOM uint16_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint16_t DITHEN     : 1;            /*!< Dithering enable                                                          */
            uint16_t            : 3;
    } TIM16_CR1_b;
  } ;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint16_t TIM16_CR2;                   /*!< TIM16 control register 2                                                  */
    
    struct {
      __IOM uint16_t CCPC       : 1;            /*!< Capture/compare preloaded control                                         */
            uint16_t            : 1;
      __IOM uint16_t CCUS       : 1;            /*!< Capture/compare control update selection                                  */
      __IOM uint16_t CCDS       : 1;            /*!< Capture/compare DMA selection                                             */
            uint16_t            : 4;
      __IOM uint16_t OIS1       : 1;            /*!< Output Idle state 1 (tim_oc1 output)                                      */
      __IOM uint16_t OIS1N      : 1;            /*!< Output Idle state 1 (tim_oc1n output)                                     */
            uint16_t            : 6;
    } TIM16_CR2_b;
  } ;
  __IM  uint16_t  RESERVED1;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint16_t TIM16_DIER;                  /*!< TIM16 DMA/interrupt enable register                                       */
    
    struct {
      __IOM uint16_t UIE        : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint16_t CC1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
            uint16_t            : 3;
      __IOM uint16_t COMIE      : 1;            /*!< COM interrupt enable                                                      */
            uint16_t            : 1;
      __IOM uint16_t BIE        : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint16_t UDE        : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint16_t CC1DE      : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
            uint16_t            : 6;
    } TIM16_DIER_b;
  } ;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint16_t TIM16_SR;                    /*!< TIM16 status register                                                     */
    
    struct {
      __IOM uint16_t UIF        : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint16_t CC1IF      : 1;            /*!< Capture/Compare 1 interrupt flag                                          */
            uint16_t            : 3;
      __IOM uint16_t COMIF      : 1;            /*!< COM interrupt flag                                                        */
            uint16_t            : 1;
      __IOM uint16_t BIF        : 1;            /*!< Break interrupt flag                                                      */
            uint16_t            : 1;
      __IOM uint16_t CC1OF      : 1;            /*!< Capture/Compare 1 overcapture flag                                        */
            uint16_t            : 6;
    } TIM16_SR_b;
  } ;
  __IM  uint16_t  RESERVED4;
  
  union {
    __OM  uint16_t TIM16_EGR;                   /*!< TIM16 event generation register                                           */
    
    struct {
      __OM  uint16_t UG         : 1;            /*!< Update generation                                                         */
      __OM  uint16_t CC1G       : 1;            /*!< Capture/Compare 1 generation                                              */
            uint16_t            : 3;
      __OM  uint16_t COMG       : 1;            /*!< Capture/Compare control update generation                                 */
            uint16_t            : 1;
      __OM  uint16_t BG         : 1;            /*!< Break generation                                                          */
            uint16_t            : 8;
    } TIM16_EGR_b;
  } ;
  __IM  uint16_t  RESERVED5;
  
  union {
    union {
      __IOM uint32_t TIM16_CCMR1;               /*!< TIM16 capture/compare mode register 1                                     */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t IC1PSC   : 2;            /*!< Input capture 1 prescaler                                                 */
        __IOM uint32_t IC1F     : 4;            /*!< Input capture 1 filter                                                    */
              uint32_t          : 24;
      } TIM16_CCMR1_b;
    } ;
    
    union {
      __IOM uint32_t TIM16_CCMR1_Alternate;     /*!< TIM16 capture/compare mode register 1                                     */
      
