unhuman-io/obot-controller/obot2/src/STM32G474.h
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t OC1FE    : 1;            /*!< Output Compare 1 fast enable                                              */
        __IOM uint32_t OC1PE    : 1;            /*!< Output Compare 1 preload enable                                           */
        __IOM uint32_t OC1M     : 3;            /*!< OC1M[2:0]: Output Compare 1 mode                                          */
        __IOM uint32_t OC1CE    : 1;            /*!< Output Compare 1 clear enable                                             */
              uint32_t          : 8;
        __IOM uint32_t OC1M_1   : 1;            /*!< OC1M[3]                                                                   */
              uint32_t          : 15;
      } TIM16_CCMR1_Alternate_b;
    } ;
  };
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint16_t TIM16_CCER;                  /*!< TIM16 capture/compare enable register                                     */
    
    struct {
      __IOM uint16_t CC1E       : 1;            /*!< Capture/Compare 1 output enable                                           */
      __IOM uint16_t CC1P       : 1;            /*!< Capture/Compare 1 output polarity                                         */
      __IOM uint16_t CC1NE      : 1;            /*!< Capture/Compare 1 complementary output enable                             */
      __IOM uint16_t CC1NP      : 1;            /*!< Capture/Compare 1 complementary output polarity                           */
            uint16_t            : 12;
    } TIM16_CCER_b;
  } ;
  __IM  uint16_t  RESERVED7;
  
  union {
    __IOM uint32_t TIM16_CNT;                   /*!< TIM16 counter                                                             */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< Counter value                                                             */
            uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< UIF Copy                                                                  */
    } TIM16_CNT_b;
  } ;
  
  union {
    __IOM uint16_t TIM16_PSC;                   /*!< TIM16 prescaler                                                           */
    
    struct {
      __IOM uint16_t PSC        : 16;           /*!< Prescaler value                                                           */
    } TIM16_PSC_b;
  } ;
  __IM  uint16_t  RESERVED8;
  
  union {
    __IOM uint32_t TIM16_ARR;                   /*!< TIM16 auto-reload register                                                */
    
    struct {
      __IOM uint32_t ARR        : 20;           /*!< Auto-reload value                                                         */
            uint32_t            : 12;
    } TIM16_ARR_b;
  } ;
  
  union {
    __IOM uint16_t TIM16_RCR;                   /*!< TIM16 repetition counter register                                         */
    
    struct {
      __IOM uint16_t REP        : 8;            /*!< Repetition counter reload value                                           */
            uint16_t            : 8;
    } TIM16_RCR_b;
  } ;
  __IM  uint16_t  RESERVED9;
  
  union {
    __IOM uint32_t TIM16_CCR1;                  /*!< TIM16 capture/compare register 1                                          */
    
    struct {
      __IOM uint32_t CCR1       : 20;           /*!< Capture/Compare 1 value                                                   */
            uint32_t            : 12;
    } TIM16_CCR1_b;
  } ;
  __IM  uint32_t  RESERVED10[3];
  
  union {
    __IOM uint32_t TIM16_BDTR;                  /*!< TIM16 break and dead-time register                                        */
    
    struct {
      __IOM uint32_t DTG        : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t LOCK       : 2;            /*!< Lock configuration                                                        */
      __IOM uint32_t OSSI       : 1;            /*!< Off-state selection for Idle mode                                         */
      __IOM uint32_t OSSR       : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BKE        : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BKP        : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t AOE        : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t MOE        : 1;            /*!< Main output enable                                                        */
      __IOM uint32_t BKF        : 4;            /*!< Break filter                                                              */
            uint32_t            : 6;
      __IOM uint32_t BKDSRM     : 1;            /*!< Break Disarm                                                              */
            uint32_t            : 1;
      __IOM uint32_t BKBID      : 1;            /*!< Break Bidirectional                                                       */
            uint32_t            : 3;
    } TIM16_BDTR_b;
  } ;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t TIM16_DTR2;                  /*!< TIM16 timer deadtime register 2                                           */
    
    struct {
      __IOM uint32_t DTGF       : 8;            /*!< Dead-time falling edge generator setup                                    */
            uint32_t            : 8;
      __IOM uint32_t DTAE       : 1;            /*!< Deadtime asymmetric enable                                                */
      __IOM uint32_t DTPE       : 1;            /*!< Deadtime preload enable                                                   */
            uint32_t            : 14;
    } TIM16_DTR2_b;
  } ;
  __IM  uint32_t  RESERVED12;
  
  union {
    __IOM uint32_t TIM16_TISEL;                 /*!< TIM16 input selection register                                            */
    
