unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< selects tim_ti1_in[15:0] input                                            */
            uint32_t            : 28;
    } TIM16_TISEL_b;
  } ;
  
  union {
    __IOM uint32_t TIM16_AF1;                   /*!< TIM16 alternate function register 1                                       */
    
    struct {
      __IOM uint32_t BKINE      : 1;            /*!< TIMx_BKIN input enable                                                    */
      __IOM uint32_t BKCMP1E    : 1;            /*!< tim_brk_cmp1 enable                                                       */
      __IOM uint32_t BKCMP2E    : 1;            /*!< tim_brk_cmp2 enable                                                       */
      __IOM uint32_t BKCMP3E    : 1;            /*!< tim_brk_cmp3 enable                                                       */
      __IOM uint32_t BKCMP4E    : 1;            /*!< tim_brk_cmp4 enable                                                       */
      __IOM uint32_t BKCMP5E    : 1;            /*!< tim_brk_cmp5 enable                                                       */
      __IOM uint32_t BKCMP6E    : 1;            /*!< tim_brk_cmp6 enable                                                       */
      __IOM uint32_t BKCMP7E    : 1;            /*!< tim_brk_cmp7 enable                                                       */
      __IOM uint32_t BKCMP8E    : 1;            /*!< tim_brk_cmp8 enable                                                       */
      __IOM uint32_t BKINP      : 1;            /*!< TIMx_BKIN input polarity                                                  */
      __IOM uint32_t BKCMP1P    : 1;            /*!< tim_brk_cmp1 input polarity                                               */
      __IOM uint32_t BKCMP2P    : 1;            /*!< tim_brk_cmp2 input polarity                                               */
      __IOM uint32_t BKCMP3P    : 1;            /*!< tim_brk_cmp3 input polarity                                               */
      __IOM uint32_t BKCMP4P    : 1;            /*!< tim_brk_cmp4 input polarity                                               */
            uint32_t            : 18;
    } TIM16_AF1_b;
  } ;
  
  union {
    __IOM uint32_t TIM16_AF2;                   /*!< TIM16 alternate function register 2                                       */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t OCRSEL     : 3;            /*!< tim_ocref_clr source selection                                            */
            uint32_t            : 13;
    } TIM16_AF2_b;
  } ;
  
  union {
    __IOM uint32_t TIM16_OR1;                   /*!< TIM16 option register 1                                                   */
    
    struct {
      __IOM uint32_t HSE32EN    : 1;            /*!< HSE Divided by 32 enable                                                  */
            uint32_t            : 31;
    } TIM16_OR1_b;
  } ;
  __IM  uint32_t  RESERVED13[220];
  
  union {
    __IOM uint32_t TIM16_DCR;                   /*!< TIM16 DMA control register                                                */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } TIM16_DCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM16_DMAR;                  /*!< TIM16/TIM17 DMA address for full transfer                                 */
    
    struct {
      __IOM uint32_t DMAB       : 32;           /*!< DMA register for burst accesses                                           */
    } TIM16_DMAR_b;
  } ;
} TIM16_Type;                                   /*!< Size = 996 (0x3e4)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM1)
  */

typedef struct {                                /*!< TIM1 Structure                                                            */
  
  union {
    __IOM uint16_t TIM1_CR1;                    /*!< TIM1 control register 1                                                   */
    
    struct {
      __IOM uint16_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint16_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint16_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint16_t OPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint16_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint16_t CMS        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint16_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint16_t CKD        : 2;            /*!< Clock division                                                            */
            uint16_t            : 1;
      __IOM uint16_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint16_t DITHEN     : 1;            /*!< Dithering enable                                                          */
            uint16_t            : 3;
    } TIM1_CR1_b;
  } ;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint32_t TIM1_CR2;                    /*!< TIM1 control register 2                                                   */
    
