unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CCPC       : 1;            /*!< Capture/compare preloaded control                                         */
            uint32_t            : 1;
      __IOM uint32_t CCUS       : 1;            /*!< Capture/compare control update selection                                  */
      __IOM uint32_t CCDS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMS        : 3;            /*!< MMS[2:0]: Master mode selection                                           */
      __IOM uint32_t TI1S       : 1;            /*!< tim_ti1 selection                                                         */
      __IOM uint32_t OIS1       : 1;            /*!< Output idle state 1 (tim_oc1 output)                                      */
      __IOM uint32_t OIS1N      : 1;            /*!< Output idle state 1 (tim_oc1n output)                                     */
      __IOM uint32_t OIS2       : 1;            /*!< Output idle state 2 (tim_oc2 output)                                      */
      __IOM uint32_t OIS2N      : 1;            /*!< Output idle state 2 (tim_oc2n output)                                     */
      __IOM uint32_t OIS3       : 1;            /*!< Output idle state 3 (tim_oc3n output)                                     */
      __IOM uint32_t OIS3N      : 1;            /*!< Output idle state 3 (tim_oc3n output)                                     */
      __IOM uint32_t OIS4       : 1;            /*!< Output idle state 4 (tim_oc4 output)                                      */
      __IOM uint32_t OIS4N      : 1;            /*!< Output idle state 4 (tim_oc4n output)                                     */
      __IOM uint32_t OIS5       : 1;            /*!< Output idle state 5 (tim_oc5 output)                                      */
            uint32_t            : 1;
      __IOM uint32_t OIS6       : 1;            /*!< Output idle state 6 (tim_oc6 output)                                      */
            uint32_t            : 1;
      __IOM uint32_t MMS2       : 4;            /*!< Master mode selection 2                                                   */
            uint32_t            : 1;
      __IOM uint32_t MMS_1      : 1;            /*!< MMS[3]                                                                    */
            uint32_t            : 6;
    } TIM1_CR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_SMCR;                   /*!< TIM1 slave mode control register                                          */
    
    struct {
      __IOM uint32_t SMS        : 3;            /*!< SMS[2:0]: Slave mode selection                                            */
      __IOM uint32_t OCCS       : 1;            /*!< OCREF clear selection                                                     */
      __IOM uint32_t TS         : 3;            /*!< TS[2:0]: Trigger selection                                                */
      __IOM uint32_t MSM        : 1;            /*!< Master/slave mode                                                         */
      __IOM uint32_t ETF        : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPS       : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t ECE        : 1;            /*!< External clock enable                                                     */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
      __IOM uint32_t SMS_1      : 1;            /*!< SMS[3]                                                                    */
            uint32_t            : 3;
      __IOM uint32_t TS_1       : 2;            /*!< TS[4:3]                                                                   */
            uint32_t            : 2;
      __IOM uint32_t SMSPE      : 1;            /*!< SMS preload enable                                                        */
      __IOM uint32_t SMSPS      : 1;            /*!< SMS preload source                                                        */
            uint32_t            : 6;
    } TIM1_SMCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_DIER;                   /*!< TIM1 DMA/interrupt enable register                                        */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CC1IE      : 1;            /*!< Capture/compare 1 interrupt enable                                        */
      __IOM uint32_t CC2IE      : 1;            /*!< Capture/compare 2 interrupt enable                                        */
      __IOM uint32_t CC3IE      : 1;            /*!< Capture/compare 3 interrupt enable                                        */
      __IOM uint32_t CC4IE      : 1;            /*!< Capture/compare 4 interrupt enable                                        */
      __IOM uint32_t COMIE      : 1;            /*!< COM interrupt enable                                                      */
      __IOM uint32_t TIE        : 1;            /*!< Trigger interrupt enable                                                  */
      __IOM uint32_t BIE        : 1;            /*!< Break interrupt enable                                                    */
      __IOM uint32_t UDE        : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CC1DE      : 1;            /*!< Capture/compare 1 DMA request enable                                      */
      __IOM uint32_t CC2DE      : 1;            /*!< Capture/compare 2 DMA request enable                                      */
      __IOM uint32_t CC3DE      : 1;            /*!< Capture/compare 3 DMA request enable                                      */
      __IOM uint32_t CC4DE      : 1;            /*!< Capture/compare 4 DMA request enable                                      */
      __IOM uint32_t COMDE      : 1;            /*!< COM DMA request enable                                                    */
      __IOM uint32_t TDE        : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 5;
      __IOM uint32_t IDXIE      : 1;            /*!< Index interrupt enable                                                    */
      __IOM uint32_t DIRIE      : 1;            /*!< Direction change interrupt enable                                         */
      __IOM uint32_t IERRIE     : 1;            /*!< Index error interrupt enable                                              */
      __IOM uint32_t TERRIE     : 1;            /*!< Transition error interrupt enable                                         */
            uint32_t            : 8;
    } TIM1_DIER_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_SR;                     /*!< TIM1 status register                                                      */
    
