unhuman-io/obot-controller/obot2/src/STM32G474.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/compare 3 selection                                               */
        __IOM uint32_t IC3PSC   : 2;            /*!< Input capture 3 prescaler                                                 */
        __IOM uint32_t IC3F     : 4;            /*!< Input capture 3 filter                                                    */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/compare 4 selection                                               */
        __IOM uint32_t IC4PSC   : 2;            /*!< Input capture 4 prescaler                                                 */
        __IOM uint32_t IC4F     : 4;            /*!< Input capture 4 filter                                                    */
              uint32_t          : 16;
      } TIM1_CCMR2_b;
    } ;
    
    union {
      __IOM uint32_t TIM1_CCMR2_Alternate;      /*!< TIM1 capture/compare mode register 2                                      */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/compare 3 selection                                               */
        __IOM uint32_t OC3FE    : 1;            /*!< Output compare 3 fast enable                                              */
        __IOM uint32_t OC3PE    : 1;            /*!< Output compare 3 preload enable                                           */
        __IOM uint32_t OC3M     : 3;            /*!< OC3M[2:0]: Output compare 3 mode                                          */
        __IOM uint32_t OC3CE    : 1;            /*!< Output compare 3 clear enable                                             */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/compare 4 selection                                               */
        __IOM uint32_t OC4FE    : 1;            /*!< Output compare 4 fast enable                                              */
        __IOM uint32_t OC4PE    : 1;            /*!< Output compare 4 preload enable                                           */
        __IOM uint32_t OC4M     : 3;            /*!< OC4M[2:0]: Output compare 4 mode                                          */
        __IOM uint32_t OC4CE    : 1;            /*!< Output compare 4 clear enable                                             */
        __IOM uint32_t OC3M_1   : 1;            /*!< OC3M[3]                                                                   */
              uint32_t          : 7;
        __IOM uint32_t OC4M_1   : 1;            /*!< OC4M[3]                                                                   */
              uint32_t          : 7;
      } TIM1_CCMR2_Alternate_b;
    } ;
  };
  
  union {
    __IOM uint32_t TIM1_CCER;                   /*!< TIM1 capture/compare enable register                                      */
    
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< Capture/compare 1 output enable                                           */
      __IOM uint32_t CC1P       : 1;            /*!< Capture/compare 1 output polarity                                         */
      __IOM uint32_t CC1NE      : 1;            /*!< Capture/compare 1 complementary output enable                             */
      __IOM uint32_t CC1NP      : 1;            /*!< Capture/compare 1 complementary output polarity                           */
      __IOM uint32_t CC2E       : 1;            /*!< Capture/compare 2 output enable                                           */
      __IOM uint32_t CC2P       : 1;            /*!< Capture/compare 2 output polarity                                         */
      __IOM uint32_t CC2NE      : 1;            /*!< Capture/compare 2 complementary output enable                             */
      __IOM uint32_t CC2NP      : 1;            /*!< Capture/compare 2 complementary output polarity                           */
      __IOM uint32_t CC3E       : 1;            /*!< Capture/compare 3 output enable                                           */
      __IOM uint32_t CC3P       : 1;            /*!< Capture/compare 3 output polarity                                         */
      __IOM uint32_t CC3NE      : 1;            /*!< Capture/compare 3 complementary output enable                             */
      __IOM uint32_t CC3NP      : 1;            /*!< Capture/compare 3 complementary output polarity                           */
      __IOM uint32_t CC4E       : 1;            /*!< Capture/compare 4 output enable                                           */
      __IOM uint32_t CC4P       : 1;            /*!< Capture/compare 4 output polarity                                         */
      __IOM uint32_t CC4NE      : 1;            /*!< Capture/compare 4 complementary output enable                             */
      __IOM uint32_t CC4NP      : 1;            /*!< Capture/compare 4 complementary output polarity                           */
      __IOM uint32_t CC5E       : 1;            /*!< Capture/compare 5 output enable                                           */
      __IOM uint32_t CC5P       : 1;            /*!< Capture/compare 5 output polarity                                         */
            uint32_t            : 2;
      __IOM uint32_t CC6E       : 1;            /*!< Capture/compare 6 output enable                                           */
      __IOM uint32_t CC6P       : 1;            /*!< Capture/compare 6 output polarity                                         */
            uint32_t            : 10;
    } TIM1_CCER_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CNT;                    /*!< TIM1 counter                                                              */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< Counter value                                                             */
            uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< UIF copy                                                                  */
    } TIM1_CNT_b;
  } ;
  
  union {
    __IOM uint16_t TIM1_PSC;                    /*!< TIM1 prescaler                                                            */
    
