unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint16_t PSC        : 16;           /*!< Prescaler value                                                           */
    } TIM1_PSC_b;
  } ;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint32_t TIM1_ARR;                    /*!< TIM1 auto-reload register                                                 */
    
    struct {
      __IOM uint32_t ARR        : 20;           /*!< Auto-reload value                                                         */
            uint32_t            : 12;
    } TIM1_ARR_b;
  } ;
  
  union {
    __IOM uint16_t TIM1_RCR;                    /*!< TIM1 repetition counter register                                          */
    
    struct {
      __IOM uint16_t REP        : 16;           /*!< Repetition counter reload value                                           */
    } TIM1_RCR_b;
  } ;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint32_t TIM1_CCR1;                   /*!< TIM1 capture/compare register 1                                           */
    
    struct {
      __IOM uint32_t CCR1       : 20;           /*!< Capture/compare 1 value                                                   */
            uint32_t            : 12;
    } TIM1_CCR1_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCR2;                   /*!< TIM1 capture/compare register 2                                           */
    
    struct {
      __IOM uint32_t CCR2       : 20;           /*!< Capture/compare 2 value                                                   */
            uint32_t            : 12;
    } TIM1_CCR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCR3;                   /*!< TIM1 capture/compare register 3                                           */
    
    struct {
      __IOM uint32_t CCR3       : 20;           /*!< Capture/compare value                                                     */
            uint32_t            : 12;
    } TIM1_CCR3_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCR4;                   /*!< TIM1 capture/compare register 4                                           */
    
    struct {
      __IOM uint32_t CCR4       : 20;           /*!< Capture/compare value                                                     */
            uint32_t            : 12;
    } TIM1_CCR4_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_BDTR;                   /*!< TIM1 break and dead-time register                                         */
    
    struct {
      __IOM uint32_t DTG        : 8;            /*!< Dead-time generator setup                                                 */
      __IOM uint32_t LOCK       : 2;            /*!< Lock configuration                                                        */
      __IOM uint32_t OSSI       : 1;            /*!< Off-state selection for idle mode                                         */
      __IOM uint32_t OSSR       : 1;            /*!< Off-state selection for Run mode                                          */
      __IOM uint32_t BKE        : 1;            /*!< Break enable                                                              */
      __IOM uint32_t BKP        : 1;            /*!< Break polarity                                                            */
      __IOM uint32_t AOE        : 1;            /*!< Automatic output enable                                                   */
      __IOM uint32_t MOE        : 1;            /*!< Main output enable                                                        */
      __IOM uint32_t BKF        : 4;            /*!< Break filter                                                              */
      __IOM uint32_t BK2F       : 4;            /*!< Break 2 filter                                                            */
      __IOM uint32_t BK2E       : 1;            /*!< Break 2 enable                                                            */
      __IOM uint32_t BK2P       : 1;            /*!< Break 2 polarity                                                          */
      __IOM uint32_t BKDSRM     : 1;            /*!< Break disarm                                                              */
      __IOM uint32_t BK2DSRM    : 1;            /*!< Break2 disarm                                                             */
      __IOM uint32_t BKBID      : 1;            /*!< Break bidirectional                                                       */
      __IOM uint32_t BK2BID     : 1;            /*!< Break2 bidirectional                                                      */
            uint32_t            : 2;
    } TIM1_BDTR_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCR5;                   /*!< TIM1 capture/compare register 5                                           */
    
    struct {
      __IOM uint32_t CCR5       : 20;           /*!< Capture/compare 5 value                                                   */
            uint32_t            : 9;
      __IOM uint32_t GC5C1      : 1;            /*!< Group channel 5 and channel 1                                             */
      __IOM uint32_t GC5C2      : 1;            /*!< Group channel 5 and channel 2                                             */
      __IOM uint32_t GC5C3      : 1;            /*!< Group channel 5 and channel 3                                             */
    } TIM1_CCR5_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCR6;                   /*!< TIM1 capture/compare register 6                                           */
    
    struct {
      __IOM uint32_t CCR6       : 20;           /*!< Capture/compare 6 value                                                   */
            uint32_t            : 12;
    } TIM1_CCR6_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_CCMR3;                  /*!< TIM1 capture/compare mode register 3                                      */
    
    struct {
            uint32_t            : 2;
      __IOM uint32_t OC5FE      : 1;            /*!< Output compare 5 fast enable                                              */
      __IOM uint32_t OC5PE      : 1;            /*!< Output compare 5 preload enable                                           */
      __IOM uint32_t OC5M       : 3;            /*!< OC5M[2:0]: Output compare 5 mode                                          */
      __IOM uint32_t OC5CE      : 1;            /*!< Output compare 5 clear enable                                             */
            uint32_t            : 2;
      __IOM uint32_t OC6FE      : 1;            /*!< Output compare 6 fast enable                                              */
      __IOM uint32_t OC6PE      : 1;            /*!< Output compare 6 preload enable                                           */
      __IOM uint32_t OC6M       : 3;            /*!< OC6M[2:0]: Output compare 6 mode                                          */
      __IOM uint32_t OC6CE      : 1;            /*!< Output compare 6 clear enable                                             */
      __IOM uint32_t OC5M_1     : 1;            /*!< OC5M[3]                                                                   */
            uint32_t            : 7;
      __IOM uint32_t OC6M_1     : 1;            /*!< OC6M[3]                                                                   */
            uint32_t            : 7;
    } TIM1_CCMR3_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_DTR2;                   /*!< TIM1 timer deadtime register 2                                            */
    
