unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DTGF       : 8;            /*!< Dead-time falling edge generator setup                                    */
            uint32_t            : 8;
      __IOM uint32_t DTAE       : 1;            /*!< Deadtime asymmetric enable                                                */
      __IOM uint32_t DTPE       : 1;            /*!< Deadtime preload enable                                                   */
            uint32_t            : 14;
    } TIM1_DTR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_ECR;                    /*!< TIM1 timer encoder control register                                       */
    
    struct {
      __IOM uint32_t IE         : 1;            /*!< Index enable                                                              */
      __IOM uint32_t IDIR       : 2;            /*!< Index direction                                                           */
            uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< First index                                                               */
      __IOM uint32_t IPOS       : 2;            /*!< Index positioning                                                         */
            uint32_t            : 8;
      __IOM uint32_t PW         : 8;            /*!< Pulse width                                                               */
      __IOM uint32_t PWPRSC     : 3;            /*!< Pulse width prescaler                                                     */
            uint32_t            : 5;
    } TIM1_ECR_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_TISEL;                  /*!< TIM1 timer input selection register                                       */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< Selects tim_ti1[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< Selects tim_ti2[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< Selects tim_ti3[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< Selects tim_ti4[15:0] input                                               */
            uint32_t            : 4;
    } TIM1_TISEL_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_AF1;                    /*!< TIM1 alternate function option register 1                                 */
    
    struct {
      __IOM uint32_t BKINE      : 1;            /*!< TIMx_BKIN input enable                                                    */
      __IOM uint32_t BKCMP1E    : 1;            /*!< tim_brk_cmp1 enable                                                       */
      __IOM uint32_t BKCMP2E    : 1;            /*!< tim_brk_cmp2 enable                                                       */
      __IOM uint32_t BKCMP3E    : 1;            /*!< tim_brk_cmp3 enable                                                       */
      __IOM uint32_t BKCMP4E    : 1;            /*!< tim_brk_cmp4 enable                                                       */
      __IOM uint32_t BKCMP5E    : 1;            /*!< tim_brk_cmp5 enable                                                       */
      __IOM uint32_t BKCMP6E    : 1;            /*!< tim_brk_cmp6 enable                                                       */
      __IOM uint32_t BKCMP7E    : 1;            /*!< tim_brk_cmp7 enable                                                       */
      __IOM uint32_t BKCMP8E    : 1;            /*!< tim_brk_cmp8 enable                                                       */
      __IOM uint32_t BKINP      : 1;            /*!< TIMx_BKIN input polarity                                                  */
      __IOM uint32_t BKCMP1P    : 1;            /*!< tim_brk_cmp1 input polarity                                               */
      __IOM uint32_t BKCMP2P    : 1;            /*!< tim_brk_cmp2 input polarity                                               */
      __IOM uint32_t BKCMP3P    : 1;            /*!< tim_brk_cmp3 input polarity                                               */
      __IOM uint32_t BKCMP4P    : 1;            /*!< tim_brk_cmp4 input polarity                                               */
      __IOM uint32_t ETRSEL     : 4;            /*!< etr_in source selection                                                   */
            uint32_t            : 14;
    } TIM1_AF1_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_AF2;                    /*!< TIM1 alternate function register 2                                        */
    
    struct {
      __IOM uint32_t BK2INE     : 1;            /*!< TIMx_BKIN2 input enable                                                   */
      __IOM uint32_t BK2CMP1E   : 1;            /*!< tim_brk2_cmp1 enable                                                      */
      __IOM uint32_t BK2CMP2E   : 1;            /*!< tim_brk2_cmp2 enable                                                      */
      __IOM uint32_t BK2CMP3E   : 1;            /*!< tim_brk2_cmp3 enable                                                      */
      __IOM uint32_t BK2CMP4E   : 1;            /*!< tim_brk2_cmp4 enable                                                      */
      __IOM uint32_t BK2CMP5E   : 1;            /*!< tim_brk2_cmp5 enable                                                      */
      __IOM uint32_t BK2CMP6E   : 1;            /*!< tim_brk2_cmp6 enable                                                      */
      __IOM uint32_t BK2CMP7E   : 1;            /*!< tim_brk2_cmp7 enable                                                      */
      __IOM uint32_t BK2CMP8E   : 1;            /*!< tim_brk2_cmp8 enable                                                      */
      __IOM uint32_t BK2INP     : 1;            /*!< TIMx_BKIN2 input polarity                                                 */
      __IOM uint32_t BK2CMP1P   : 1;            /*!< tim_brk2_cmp1 input polarity                                              */
      __IOM uint32_t BK2CMP2P   : 1;            /*!< tim_brk2_cmp2 input polarity                                              */
      __IOM uint32_t BK2CMP3P   : 1;            /*!< tim_brk2_cmp3 input polarity                                              */
      __IOM uint32_t BK2CMP4P   : 1;            /*!< tim_brk2_cmp4 input polarity                                              */
            uint32_t            : 2;
      __IOM uint32_t OCRSEL     : 3;            /*!< ocref_clr source selection                                                */
            uint32_t            : 13;
    } TIM1_AF2_b;
  } ;
  __IM  uint32_t  RESERVED4[221];
  
  union {
    __IOM uint32_t TIM1_DCR;                    /*!< TIM1 DMA control register                                                 */
    
