unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DBA        : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } TIM1_DCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM1_DMAR;                   /*!< TIM1 DMA address for full transfer                                        */
    
    struct {
      __IOM uint32_t DMAB       : 32;           /*!< DMA register for burst accesses                                           */
    } TIM1_DMAR_b;
  } ;
} TIM1_Type;                                    /*!< Size = 996 (0x3e4)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIM2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM2)
  */

typedef struct {                                /*!< TIM2 Structure                                                            */
  
  union {
    __IOM uint16_t TIM2_CR1;                    /*!< TIM2 control register 1                                                   */
    
    struct {
      __IOM uint16_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint16_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint16_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint16_t OPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint16_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint16_t CMS        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint16_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint16_t CKD        : 2;            /*!< Clock division                                                            */
            uint16_t            : 1;
      __IOM uint16_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint16_t DITHEN     : 1;            /*!< Dithering Enable                                                          */
            uint16_t            : 3;
    } TIM2_CR1_b;
  } ;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint32_t TIM2_CR2;                    /*!< TIM2 control register 2                                                   */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t CCDS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMS        : 3;            /*!< MMS[0]: Master mode selection                                             */
      __IOM uint32_t TI1S       : 1;            /*!< tim_ti1 selection                                                         */
            uint32_t            : 17;
      __IOM uint32_t MMS_1      : 1;            /*!< MMS[3]                                                                    */
            uint32_t            : 6;
    } TIM2_CR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_SMCR;                   /*!< TIM2 slave mode control register                                          */
    
    struct {
      __IOM uint32_t SMS        : 3;            /*!< SMS[0]: Slave mode selection                                              */
      __IOM uint32_t OCCS       : 1;            /*!< OCREF clear selection                                                     */
      __IOM uint32_t TS         : 3;            /*!< TS[0]: Trigger selection                                                  */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
      __IOM uint32_t ETF        : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPS       : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t ECE        : 1;            /*!< External clock enable                                                     */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
      __IOM uint32_t SMS_1      : 1;            /*!< SMS[3]                                                                    */
            uint32_t            : 3;
      __IOM uint32_t TS_1       : 2;            /*!< TS[4:3]                                                                   */
            uint32_t            : 2;
      __IOM uint32_t SMSPE      : 1;            /*!< SMS preload enable                                                        */
      __IOM uint32_t SMSPS      : 1;            /*!< SMS preload source                                                        */
            uint32_t            : 6;
    } TIM2_SMCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_DIER;                   /*!< TIM2 DMA/Interrupt enable register                                        */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CC1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CC2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
      __IOM uint32_t CC3IE      : 1;            /*!< Capture/Compare 3 interrupt enable                                        */
      __IOM uint32_t CC4IE      : 1;            /*!< Capture/Compare 4 interrupt enable                                        */
            uint32_t            : 1;
      __IOM uint32_t TIE        : 1;            /*!< Trigger interrupt enable                                                  */
            uint32_t            : 1;
      __IOM uint32_t UDE        : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CC1DE      : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CC2DE      : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
      __IOM uint32_t CC3DE      : 1;            /*!< Capture/Compare 3 DMA request enable                                      */
      __IOM uint32_t CC4DE      : 1;            /*!< Capture/Compare 4 DMA request enable                                      */
            uint32_t            : 1;
      __IOM uint32_t TDE        : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 5;
      __IOM uint32_t IDXIE      : 1;            /*!< Index interrupt enable                                                    */
      __IOM uint32_t DIRIE      : 1;            /*!< Direction change interrupt enable                                         */
      __IOM uint32_t IERRIE     : 1;            /*!< Index error interrupt enable                                              */
      __IOM uint32_t TERRIE     : 1;            /*!< Transition error interrupt enable                                         */
            uint32_t            : 8;
    } TIM2_DIER_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_SR;                     /*!< TIM2 status register                                                      */
    
