unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t UIF        : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CC1IF      : 1;            /*!< Capture/compare 1 interrupt flag                                          */
      __IOM uint32_t CC2IF      : 1;            /*!< Capture/Compare 2 interrupt flag                                          */
      __IOM uint32_t CC3IF      : 1;            /*!< Capture/Compare 3 interrupt flag                                          */
      __IOM uint32_t CC4IF      : 1;            /*!< Capture/Compare 4 interrupt flag                                          */
            uint32_t            : 1;
      __IOM uint32_t TIF        : 1;            /*!< Trigger interrupt flag                                                    */
            uint32_t            : 2;
      __IOM uint32_t CC1OF      : 1;            /*!< Capture/Compare 1 overcapture flag                                        */
      __IOM uint32_t CC2OF      : 1;            /*!< Capture/compare 2 overcapture flag                                        */
      __IOM uint32_t CC3OF      : 1;            /*!< Capture/Compare 3 overcapture flag                                        */
      __IOM uint32_t CC4OF      : 1;            /*!< Capture/Compare 4 overcapture flag                                        */
            uint32_t            : 7;
      __IOM uint32_t IDXF       : 1;            /*!< Index interrupt flag                                                      */
      __IOM uint32_t DIRF       : 1;            /*!< Direction change interrupt flag                                           */
      __IOM uint32_t IERRF      : 1;            /*!< Index error interrupt flag                                                */
      __IOM uint32_t TERRF      : 1;            /*!< Transition error interrupt flag                                           */
            uint32_t            : 8;
    } TIM2_SR_b;
  } ;
  
  union {
    __OM  uint16_t TIM2_EGR;                    /*!< TIM2 event generation register                                            */
    
    struct {
      __OM  uint16_t UG         : 1;            /*!< Update generation                                                         */
      __OM  uint16_t CC1G       : 1;            /*!< Capture/compare 1 generation                                              */
      __OM  uint16_t CC2G       : 1;            /*!< Capture/compare 2 generation                                              */
      __OM  uint16_t CC3G       : 1;            /*!< Capture/compare 3 generation                                              */
      __OM  uint16_t CC4G       : 1;            /*!< Capture/compare 4 generation                                              */
            uint16_t            : 1;
      __OM  uint16_t TG         : 1;            /*!< Trigger generation                                                        */
            uint16_t            : 9;
    } TIM2_EGR_b;
  } ;
  __IM  uint16_t  RESERVED1;
  
  union {
    union {
      __IOM uint32_t TIM2_CCMR1;                /*!< TIM2 capture/compare mode register 1 [alternate]                          */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t IC1PSC   : 2;            /*!< Input capture 1 prescaler                                                 */
        __IOM uint32_t IC1F     : 4;            /*!< Input capture 1 filter                                                    */
        __IOM uint32_t CC2S     : 2;            /*!< Capture/compare 2 selection                                               */
        __IOM uint32_t IC2PSC   : 2;            /*!< Input capture 2 prescaler                                                 */
        __IOM uint32_t IC2F     : 4;            /*!< Input capture 2 filter                                                    */
              uint32_t          : 16;
      } TIM2_CCMR1_b;
    } ;
    
    union {
      __IOM uint32_t TIM2_CCMR1_Alternate;      /*!< TIM2 capture/compare mode register 1                                      */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t OC1FE    : 1;            /*!< Output compare 1 fast enable                                              */
        __IOM uint32_t OC1PE    : 1;            /*!< Output compare 1 preload enable                                           */
        __IOM uint32_t OC1M     : 3;            /*!< OC1M[2:0]: Output compare 1 mode                                          */
        __IOM uint32_t OC1CE    : 1;            /*!< Output compare 1 clear enable                                             */
        __IOM uint32_t CC2S     : 2;            /*!< Capture/Compare 2 selection                                               */
        __IOM uint32_t OC2FE    : 1;            /*!< Output compare 2 fast enable                                              */
        __IOM uint32_t OC2PE    : 1;            /*!< Output compare 2 preload enable                                           */
        __IOM uint32_t OC2M     : 3;            /*!< OC2M[2:0]: Output compare 2 mode                                          */
        __IOM uint32_t OC2CE    : 1;            /*!< Output compare 2 clear enable                                             */
        __IOM uint32_t OC1M_1   : 1;            /*!< OC1M[3]                                                                   */
              uint32_t          : 7;
        __IOM uint32_t OC2M_1   : 1;            /*!< OC2M[3]                                                                   */
              uint32_t          : 7;
      } TIM2_CCMR1_Alternate_b;
    } ;
  };
  
  union {
    union {
      __IOM uint32_t TIM2_CCMR2;                /*!< TIM2 capture/compare mode register 2 [alternate]                          */
      
