unhuman-io/obot-controller/obot2/src/STM32G474.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/Compare 3 selection                                               */
        __IOM uint32_t IC3PSC   : 2;            /*!< Input capture 3 prescaler                                                 */
        __IOM uint32_t IC3F     : 4;            /*!< Input capture 3 filter                                                    */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/Compare 4 selection                                               */
        __IOM uint32_t IC4PSC   : 2;            /*!< Input capture 4 prescaler                                                 */
        __IOM uint32_t IC4F     : 4;            /*!< Input capture 4 filter                                                    */
              uint32_t          : 16;
      } TIM2_CCMR2_b;
    } ;
    
    union {
      __IOM uint32_t TIM2_CCMR2_Alternate;      /*!< TIM2 capture/compare mode register 2                                      */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/Compare 3 selection                                               */
        __IOM uint32_t OC3FE    : 1;            /*!< Output compare 3 fast enable                                              */
        __IOM uint32_t OC3PE    : 1;            /*!< Output compare 3 preload enable                                           */
        __IOM uint32_t OC3M     : 3;            /*!< OC3M[2:0]: Output compare 3 mode                                          */
        __IOM uint32_t OC3CE    : 1;            /*!< Output compare 3 clear enable                                             */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/Compare 4 selection                                               */
        __IOM uint32_t OC4FE    : 1;            /*!< Output compare 4 fast enable                                              */
        __IOM uint32_t OC4PE    : 1;            /*!< Output compare 4 preload enable                                           */
        __IOM uint32_t OC4M     : 3;            /*!< OC4M[2:0]: Output compare 4 mode                                          */
        __IOM uint32_t OC4CE    : 1;            /*!< Output compare 4 clear enable                                             */
        __IOM uint32_t OC3M_1   : 1;            /*!< OC3M[3]                                                                   */
              uint32_t          : 7;
        __IOM uint32_t OC4M_1   : 1;            /*!< OC4M[3]                                                                   */
              uint32_t          : 7;
      } TIM2_CCMR2_Alternate_b;
    } ;
  };
  
  union {
    __IOM uint16_t TIM2_CCER;                   /*!< TIM2 capture/compare enable register                                      */
    
    struct {
      __IOM uint16_t CC1E       : 1;            /*!< Capture/Compare 1 output enable.                                          */
      __IOM uint16_t CC1P       : 1;            /*!< Capture/Compare 1 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC1NP      : 1;            /*!< Capture/Compare 1 output Polarity.                                        */
      __IOM uint16_t CC2E       : 1;            /*!< Capture/Compare 2 output enable.                                          */
      __IOM uint16_t CC2P       : 1;            /*!< Capture/Compare 2 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC2NP      : 1;            /*!< Capture/Compare 2 output Polarity.                                        */
      __IOM uint16_t CC3E       : 1;            /*!< Capture/Compare 3 output enable.                                          */
      __IOM uint16_t CC3P       : 1;            /*!< Capture/Compare 3 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC3NP      : 1;            /*!< Capture/Compare 3 output Polarity.                                        */
      __IOM uint16_t CC4E       : 1;            /*!< Capture/Compare 4 output enable.                                          */
      __IOM uint16_t CC4P       : 1;            /*!< Capture/Compare 4 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC4NP      : 1;            /*!< Capture/Compare 4 output Polarity.                                        */
    } TIM2_CCER_b;
  } ;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint32_t TIM2_CNT;                    /*!< TIM2 counter                                                              */
    
    struct {
      __IOM uint32_t CNT        : 31;           /*!< Least significant part of counter value                                   */
      __IOM uint32_t UIFCPY_CNT : 1;            /*!< Value depends on IUFREMAP in TIMx_CR1.                                    */
    } TIM2_CNT_b;
  } ;
  
  union {
    __IOM uint16_t TIM2_PSC;                    /*!< TIM2 prescaler                                                            */
    
    struct {
      __IOM uint16_t PSC        : 16;           /*!< Prescaler value                                                           */
    } TIM2_PSC_b;
  } ;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint32_t TIM2_ARR;                    /*!< TIM2 auto-reload register                                                 */
    
    struct {
      __IOM uint32_t ARR        : 32;           /*!< Auto-reload value                                                         */
    } TIM2_ARR_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t TIM2_CCR1;                   /*!< TIM2 capture/compare register 1                                           */
    
    struct {
      __IOM uint32_t CCR1       : 32;           /*!< Capture/compare 1 value                                                   */
    } TIM2_CCR1_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_CCR2;                   /*!< TIM2 capture/compare register 2                                           */
    
