unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CCR2       : 32;           /*!< Capture/compare 2 value                                                   */
    } TIM2_CCR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_CCR3;                   /*!< TIM2 capture/compare register 3                                           */
    
    struct {
      __IOM uint32_t CCR3       : 32;           /*!< Capture/compare 3 value                                                   */
    } TIM2_CCR3_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_CCR4;                   /*!< TIM2 capture/compare register 4                                           */
    
    struct {
      __IOM uint32_t CCR4       : 32;           /*!< Capture/compare 4 value                                                   */
    } TIM2_CCR4_b;
  } ;
  __IM  uint32_t  RESERVED5[5];
  
  union {
    __IOM uint32_t TIM2_ECR;                    /*!< TIM2 timer encoder control register                                       */
    
    struct {
      __IOM uint32_t IE         : 1;            /*!< Index enable                                                              */
      __IOM uint32_t IDIR       : 2;            /*!< Index direction                                                           */
            uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< First index                                                               */
      __IOM uint32_t IPOS       : 2;            /*!< Index positioning                                                         */
            uint32_t            : 8;
      __IOM uint32_t PW         : 8;            /*!< Pulse width                                                               */
      __IOM uint32_t PWPRSC     : 3;            /*!< Pulse width prescaler                                                     */
            uint32_t            : 5;
    } TIM2_ECR_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_TISEL;                  /*!< TIM2 timer input selection register                                       */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< Selects tim_ti1[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< Selects tim_ti2[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< Selects tim_ti3[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< Selects tim_ti4[15:0] input                                               */
            uint32_t            : 4;
    } TIM2_TISEL_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_AF1;                    /*!< TIM2 alternate function register 1                                        */
    
    struct {
            uint32_t            : 14;
      __IOM uint32_t ETRSEL     : 4;            /*!< etr_in source selection                                                   */
            uint32_t            : 14;
    } TIM2_AF1_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_AF2;                    /*!< TIM2 alternate function register 2                                        */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t OCRSEL     : 3;            /*!< ocref_clr source selection                                                */
            uint32_t            : 13;
    } TIM2_AF2_b;
  } ;
  __IM  uint32_t  RESERVED6[221];
  
  union {
    __IOM uint32_t TIM2_DCR;                    /*!< TIM2 DMA control register                                                 */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } TIM2_DCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_DMAR;                   /*!< TIM2 DMA address for full transfer                                        */
    
    struct {
      __IOM uint32_t DMAB       : 32;           /*!< DMA register for burst accesses                                           */
    } TIM2_DMAR_b;
  } ;
} TIM2_Type;                                    /*!< Size = 996 (0x3e4)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIM3                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM3)
  */

typedef struct {                                /*!< TIM3 Structure                                                            */
  
  union {
    __IOM uint16_t TIM3_CR1;                    /*!< TIM3 control register 1                                                   */
    
    struct {
      __IOM uint16_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint16_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint16_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint16_t OPM        : 1;            /*!< One-pulse mode                                                            */
      __IOM uint16_t DIR        : 1;            /*!< Direction                                                                 */
      __IOM uint16_t CMS        : 2;            /*!< Center-aligned mode selection                                             */
      __IOM uint16_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
      __IOM uint16_t CKD        : 2;            /*!< Clock division                                                            */
            uint16_t            : 1;
      __IOM uint16_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint16_t DITHEN     : 1;            /*!< Dithering Enable                                                          */
            uint16_t            : 3;
    } TIM3_CR1_b;
  } ;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint32_t TIM3_CR2;                    /*!< TIM3 control register 2                                                   */
    
