unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 3;
      __IOM uint32_t CCDS       : 1;            /*!< Capture/compare DMA selection                                             */
      __IOM uint32_t MMS        : 3;            /*!< MMS[0]: Master mode selection                                             */
      __IOM uint32_t TI1S       : 1;            /*!< tim_ti1 selection                                                         */
            uint32_t            : 17;
      __IOM uint32_t MMS_1      : 1;            /*!< MMS[3]                                                                    */
            uint32_t            : 6;
    } TIM3_CR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_SMCR;                   /*!< TIM3 slave mode control register                                          */
    
    struct {
      __IOM uint32_t SMS        : 3;            /*!< SMS[0]: Slave mode selection                                              */
      __IOM uint32_t OCCS       : 1;            /*!< OCREF clear selection                                                     */
      __IOM uint32_t TS         : 3;            /*!< TS[0]: Trigger selection                                                  */
      __IOM uint32_t MSM        : 1;            /*!< Master/Slave mode                                                         */
      __IOM uint32_t ETF        : 4;            /*!< External trigger filter                                                   */
      __IOM uint32_t ETPS       : 2;            /*!< External trigger prescaler                                                */
      __IOM uint32_t ECE        : 1;            /*!< External clock enable                                                     */
      __IOM uint32_t ETP        : 1;            /*!< External trigger polarity                                                 */
      __IOM uint32_t SMS_1      : 1;            /*!< SMS[3]                                                                    */
            uint32_t            : 3;
      __IOM uint32_t TS_1       : 2;            /*!< TS[4:3]                                                                   */
            uint32_t            : 2;
      __IOM uint32_t SMSPE      : 1;            /*!< SMS preload enable                                                        */
      __IOM uint32_t SMSPS      : 1;            /*!< SMS preload source                                                        */
            uint32_t            : 6;
    } TIM3_SMCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_DIER;                   /*!< TIM3 DMA/Interrupt enable register                                        */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< Update interrupt enable                                                   */
      __IOM uint32_t CC1IE      : 1;            /*!< Capture/Compare 1 interrupt enable                                        */
      __IOM uint32_t CC2IE      : 1;            /*!< Capture/Compare 2 interrupt enable                                        */
      __IOM uint32_t CC3IE      : 1;            /*!< Capture/Compare 3 interrupt enable                                        */
      __IOM uint32_t CC4IE      : 1;            /*!< Capture/Compare 4 interrupt enable                                        */
            uint32_t            : 1;
      __IOM uint32_t TIE        : 1;            /*!< Trigger interrupt enable                                                  */
            uint32_t            : 1;
      __IOM uint32_t UDE        : 1;            /*!< Update DMA request enable                                                 */
      __IOM uint32_t CC1DE      : 1;            /*!< Capture/Compare 1 DMA request enable                                      */
      __IOM uint32_t CC2DE      : 1;            /*!< Capture/Compare 2 DMA request enable                                      */
      __IOM uint32_t CC3DE      : 1;            /*!< Capture/Compare 3 DMA request enable                                      */
      __IOM uint32_t CC4DE      : 1;            /*!< Capture/Compare 4 DMA request enable                                      */
            uint32_t            : 1;
      __IOM uint32_t TDE        : 1;            /*!< Trigger DMA request enable                                                */
            uint32_t            : 5;
      __IOM uint32_t IDXIE      : 1;            /*!< Index interrupt enable                                                    */
      __IOM uint32_t DIRIE      : 1;            /*!< Direction change interrupt enable                                         */
      __IOM uint32_t IERRIE     : 1;            /*!< Index error interrupt enable                                              */
      __IOM uint32_t TERRIE     : 1;            /*!< Transition error interrupt enable                                         */
            uint32_t            : 8;
    } TIM3_DIER_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_SR;                     /*!< TIM3 status register                                                      */
    
    struct {
      __IOM uint32_t UIF        : 1;            /*!< Update interrupt flag                                                     */
      __IOM uint32_t CC1IF      : 1;            /*!< Capture/compare 1 interrupt flag                                          */
      __IOM uint32_t CC2IF      : 1;            /*!< Capture/Compare 2 interrupt flag                                          */
      __IOM uint32_t CC3IF      : 1;            /*!< Capture/Compare 3 interrupt flag                                          */
      __IOM uint32_t CC4IF      : 1;            /*!< Capture/Compare 4 interrupt flag                                          */
            uint32_t            : 1;
      __IOM uint32_t TIF        : 1;            /*!< Trigger interrupt flag                                                    */
            uint32_t            : 2;
      __IOM uint32_t CC1OF      : 1;            /*!< Capture/Compare 1 overcapture flag                                        */
      __IOM uint32_t CC2OF      : 1;            /*!< Capture/compare 2 overcapture flag                                        */
      __IOM uint32_t CC3OF      : 1;            /*!< Capture/Compare 3 overcapture flag                                        */
      __IOM uint32_t CC4OF      : 1;            /*!< Capture/Compare 4 overcapture flag                                        */
            uint32_t            : 7;
      __IOM uint32_t IDXF       : 1;            /*!< Index interrupt flag                                                      */
      __IOM uint32_t DIRF       : 1;            /*!< Direction change interrupt flag                                           */
      __IOM uint32_t IERRF      : 1;            /*!< Index error interrupt flag                                                */
      __IOM uint32_t TERRF      : 1;            /*!< Transition error interrupt flag                                           */
            uint32_t            : 8;
    } TIM3_SR_b;
  } ;
  
  union {
    __OM  uint16_t TIM3_EGR;                    /*!< TIM3 event generation register                                            */
    
