unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint16_t UG         : 1;            /*!< Update generation                                                         */
      __OM  uint16_t CC1G       : 1;            /*!< Capture/compare 1 generation                                              */
      __OM  uint16_t CC2G       : 1;            /*!< Capture/compare 2 generation                                              */
      __OM  uint16_t CC3G       : 1;            /*!< Capture/compare 3 generation                                              */
      __OM  uint16_t CC4G       : 1;            /*!< Capture/compare 4 generation                                              */
            uint16_t            : 1;
      __OM  uint16_t TG         : 1;            /*!< Trigger generation                                                        */
            uint16_t            : 9;
    } TIM3_EGR_b;
  } ;
  __IM  uint16_t  RESERVED1;
  
  union {
    union {
      __IOM uint32_t TIM3_CCMR1;                /*!< TIM3 capture/compare mode register 1 [alternate]                          */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t IC1PSC   : 2;            /*!< Input capture 1 prescaler                                                 */
        __IOM uint32_t IC1F     : 4;            /*!< Input capture 1 filter                                                    */
        __IOM uint32_t CC2S     : 2;            /*!< Capture/compare 2 selection                                               */
        __IOM uint32_t IC2PSC   : 2;            /*!< Input capture 2 prescaler                                                 */
        __IOM uint32_t IC2F     : 4;            /*!< Input capture 2 filter                                                    */
              uint32_t          : 16;
      } TIM3_CCMR1_b;
    } ;
    
    union {
      __IOM uint32_t TIM3_CCMR1_Alternate;      /*!< TIM3 capture/compare mode register 1                                      */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< Capture/Compare 1 selection                                               */
        __IOM uint32_t OC1FE    : 1;            /*!< Output compare 1 fast enable                                              */
        __IOM uint32_t OC1PE    : 1;            /*!< Output compare 1 preload enable                                           */
        __IOM uint32_t OC1M     : 3;            /*!< OC1M[2:0]: Output compare 1 mode                                          */
        __IOM uint32_t OC1CE    : 1;            /*!< Output compare 1 clear enable                                             */
        __IOM uint32_t CC2S     : 2;            /*!< Capture/Compare 2 selection                                               */
        __IOM uint32_t OC2FE    : 1;            /*!< Output compare 2 fast enable                                              */
        __IOM uint32_t OC2PE    : 1;            /*!< Output compare 2 preload enable                                           */
        __IOM uint32_t OC2M     : 3;            /*!< OC2M[2:0]: Output compare 2 mode                                          */
        __IOM uint32_t OC2CE    : 1;            /*!< Output compare 2 clear enable                                             */
        __IOM uint32_t OC1M_1   : 1;            /*!< OC1M[3]                                                                   */
              uint32_t          : 7;
        __IOM uint32_t OC2M_1   : 1;            /*!< OC2M[3]                                                                   */
              uint32_t          : 7;
      } TIM3_CCMR1_Alternate_b;
    } ;
  };
  
  union {
    union {
      __IOM uint32_t TIM3_CCMR2;                /*!< TIM3 capture/compare mode register 2 [alternate]                          */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/Compare 3 selection                                               */
        __IOM uint32_t IC3PSC   : 2;            /*!< Input capture 3 prescaler                                                 */
        __IOM uint32_t IC3F     : 4;            /*!< Input capture 3 filter                                                    */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/Compare 4 selection                                               */
        __IOM uint32_t IC4PSC   : 2;            /*!< Input capture 4 prescaler                                                 */
        __IOM uint32_t IC4F     : 4;            /*!< Input capture 4 filter                                                    */
              uint32_t          : 16;
      } TIM3_CCMR2_b;
    } ;
    
    union {
      __IOM uint32_t TIM3_CCMR2_Alternate;      /*!< TIM3 capture/compare mode register 2                                      */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< Capture/Compare 3 selection                                               */
        __IOM uint32_t OC3FE    : 1;            /*!< Output compare 3 fast enable                                              */
        __IOM uint32_t OC3PE    : 1;            /*!< Output compare 3 preload enable                                           */
        __IOM uint32_t OC3M     : 3;            /*!< OC3M[2:0]: Output compare 3 mode                                          */
        __IOM uint32_t OC3CE    : 1;            /*!< Output compare 3 clear enable                                             */
        __IOM uint32_t CC4S     : 2;            /*!< Capture/Compare 4 selection                                               */
        __IOM uint32_t OC4FE    : 1;            /*!< Output compare 4 fast enable                                              */
        __IOM uint32_t OC4PE    : 1;            /*!< Output compare 4 preload enable                                           */
        __IOM uint32_t OC4M     : 3;            /*!< OC4M[2:0]: Output compare 4 mode                                          */
        __IOM uint32_t OC4CE    : 1;            /*!< Output compare 4 clear enable                                             */
        __IOM uint32_t OC3M_1   : 1;            /*!< OC3M[3]                                                                   */
              uint32_t          : 7;
        __IOM uint32_t OC4M_1   : 1;            /*!< OC4M[3]                                                                   */
              uint32_t          : 7;
      } TIM3_CCMR2_Alternate_b;
    } ;
  };
  
  union {
    __IOM uint16_t TIM3_CCER;                   /*!< TIM3 capture/compare enable register                                      */
    
