unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint16_t CC1E       : 1;            /*!< Capture/Compare 1 output enable.                                          */
      __IOM uint16_t CC1P       : 1;            /*!< Capture/Compare 1 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC1NP      : 1;            /*!< Capture/Compare 1 output Polarity.                                        */
      __IOM uint16_t CC2E       : 1;            /*!< Capture/Compare 2 output enable.                                          */
      __IOM uint16_t CC2P       : 1;            /*!< Capture/Compare 2 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC2NP      : 1;            /*!< Capture/Compare 2 output Polarity.                                        */
      __IOM uint16_t CC3E       : 1;            /*!< Capture/Compare 3 output enable.                                          */
      __IOM uint16_t CC3P       : 1;            /*!< Capture/Compare 3 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC3NP      : 1;            /*!< Capture/Compare 3 output Polarity.                                        */
      __IOM uint16_t CC4E       : 1;            /*!< Capture/Compare 4 output enable.                                          */
      __IOM uint16_t CC4P       : 1;            /*!< Capture/Compare 4 output Polarity.                                        */
            uint16_t            : 1;
      __IOM uint16_t CC4NP      : 1;            /*!< Capture/Compare 4 output Polarity.                                        */
    } TIM3_CCER_b;
  } ;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint32_t TIM3_CNT;                    /*!< TIM3 counter                                                              */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< Counter value                                                             */
            uint32_t            : 15;
      __IOM uint32_t UIFCPY     : 1;            /*!< Value depends on IUFREMAP in TIMx_CR1.                                    */
    } TIM3_CNT_b;
  } ;
  
  union {
    __IOM uint16_t TIM3_PSC;                    /*!< TIM3 prescaler                                                            */
    
    struct {
      __IOM uint16_t PSC        : 16;           /*!< Prescaler value                                                           */
    } TIM3_PSC_b;
  } ;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint32_t TIM3_ARR;                    /*!< TIM3 auto-reload register                                                 */
    
    struct {
      __IOM uint32_t ARR        : 20;           /*!< Low Auto-reload value                                                     */
            uint32_t            : 12;
    } TIM3_ARR_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t TIM3_CCR1;                   /*!< TIM3 capture/compare register 1                                           */
    
    struct {
      __IOM uint32_t CCR1       : 20;           /*!< Capture/compare 1 value                                                   */
            uint32_t            : 12;
    } TIM3_CCR1_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_CCR2;                   /*!< TIM3 capture/compare register 2                                           */
    
    struct {
      __IOM uint32_t CCR2       : 20;           /*!< Capture/compare 1 value                                                   */
            uint32_t            : 12;
    } TIM3_CCR2_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_CCR3;                   /*!< TIM3 capture/compare register 3                                           */
    
    struct {
      __IOM uint32_t CCR3       : 20;           /*!< Capture/compare 3 value                                                   */
            uint32_t            : 12;
    } TIM3_CCR3_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_CCR4;                   /*!< TIM3 capture/compare register 4                                           */
    
    struct {
      __IOM uint32_t CCR4       : 20;           /*!< Capture/compare 4 value                                                   */
            uint32_t            : 12;
    } TIM3_CCR4_b;
  } ;
  __IM  uint32_t  RESERVED5[5];
  
  union {
    __IOM uint32_t TIM3_ECR;                    /*!< TIM3 timer encoder control register                                       */
    
    struct {
      __IOM uint32_t IE         : 1;            /*!< Index enable                                                              */
      __IOM uint32_t IDIR       : 2;            /*!< Index direction                                                           */
            uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< First index                                                               */
      __IOM uint32_t IPOS       : 2;            /*!< Index positioning                                                         */
            uint32_t            : 8;
      __IOM uint32_t PW         : 8;            /*!< Pulse width                                                               */
      __IOM uint32_t PWPRSC     : 3;            /*!< Pulse width prescaler                                                     */
            uint32_t            : 5;
    } TIM3_ECR_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_TISEL;                  /*!< TIM3 timer input selection register                                       */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< Selects tim_ti1[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< Selects tim_ti2[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< Selects tim_ti3[15:0] input                                               */
            uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< Selects tim_ti4[15:0] input                                               */
            uint32_t            : 4;
    } TIM3_TISEL_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_AF1;                    /*!< TIM3 alternate function register 1                                        */
    
