unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 14;
      __IOM uint32_t ETRSEL     : 4;            /*!< etr_in source selection                                                   */
            uint32_t            : 14;
    } TIM3_AF1_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_AF2;                    /*!< TIM3 alternate function register 2                                        */
    
    struct {
            uint32_t            : 16;
      __IOM uint32_t OCRSEL     : 3;            /*!< ocref_clr source selection                                                */
            uint32_t            : 13;
    } TIM3_AF2_b;
  } ;
  __IM  uint32_t  RESERVED6[221];
  
  union {
    __IOM uint32_t TIM3_DCR;                    /*!< TIM3 DMA control register                                                 */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< DMA base address                                                          */
            uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< DMA burst length                                                          */
            uint32_t            : 19;
    } TIM3_DCR_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_DMAR;                   /*!< TIM3 DMA address for full transfer                                        */
    
    struct {
      __IOM uint32_t DMAB       : 32;           /*!< DMA register for burst accesses                                           */
    } TIM3_DMAR_b;
  } ;
} TIM3_Type;                                    /*!< Size = 996 (0x3e4)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIM6                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Basic-timers (TIM6)
  */

typedef struct {                                /*!< TIM6 Structure                                                            */
  
  union {
    __IOM uint16_t TIM6_CR1;                    /*!< TIM6 control register 1                                                   */
    
    struct {
      __IOM uint16_t CEN        : 1;            /*!< Counter enable                                                            */
      __IOM uint16_t UDIS       : 1;            /*!< Update disable                                                            */
      __IOM uint16_t URS        : 1;            /*!< Update request source                                                     */
      __IOM uint16_t OPM        : 1;            /*!< One-pulse mode                                                            */
            uint16_t            : 3;
      __IOM uint16_t ARPE       : 1;            /*!< Auto-reload preload enable                                                */
            uint16_t            : 3;
      __IOM uint16_t UIFREMAP   : 1;            /*!< UIF status bit remapping                                                  */
      __IOM uint16_t DITHEN     : 1;            /*!< Dithering enable                                                          */
            uint16_t            : 3;
    } TIM6_CR1_b;
  } ;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint16_t TIM6_CR2;                    /*!< TIM6 control register 2                                                   */
    
    struct {
            uint16_t            : 4;
      __IOM uint16_t MMS        : 3;            /*!< Master mode selection                                                     */
            uint16_t            : 9;
    } TIM6_CR2_b;
  } ;
  __IM  uint16_t  RESERVED1;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint16_t TIM6_DIER;                   /*!< TIM6 DMA/Interrupt enable register                                        */
    
    struct {
      __IOM uint16_t UIE        : 1;            /*!< Update interrupt enable                                                   */
            uint16_t            : 7;
      __IOM uint16_t UDE        : 1;            /*!< Update DMA request enable                                                 */
            uint16_t            : 7;
    } TIM6_DIER_b;
  } ;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint16_t TIM6_SR;                     /*!< TIM6 status register                                                      */
    
    struct {
      __IOM uint16_t UIF        : 1;            /*!< Update interrupt flag                                                     */
            uint16_t            : 15;
    } TIM6_SR_b;
  } ;
  __IM  uint16_t  RESERVED4;
  
  union {
    __OM  uint16_t TIM6_EGR;                    /*!< TIM6 event generation register                                            */
    
    struct {
      __OM  uint16_t UG         : 1;            /*!< Update generation                                                         */
            uint16_t            : 15;
    } TIM6_EGR_b;
  } ;
  __IM  uint16_t  RESERVED5;
  __IM  uint32_t  RESERVED6[3];
  
  union {
    __IOM uint32_t TIM6_CNT;                    /*!< TIM6 counter                                                              */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< Counter value                                                             */
            uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< UIF copy                                                                  */
    } TIM6_CNT_b;
  } ;
  
  union {
    __IOM uint16_t TIM6_PSC;                    /*!< TIM6 prescaler                                                            */
    
    struct {
      __IOM uint16_t PSC        : 16;           /*!< Prescaler value                                                           */
    } TIM6_PSC_b;
  } ;
  __IM  uint16_t  RESERVED7;
  
  union {
    __IOM uint32_t TIM6_ARR;                    /*!< TIM6 auto-reload register                                                 */
    
