unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ARR        : 20;           /*!< Auto-reload value                                                         */
            uint32_t            : 12;
    } TIM6_ARR_b;
  } ;
} TIM6_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          LPTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low power timer (LPTIM1)
  */

typedef struct {                                /*!< LPTIM1 Structure                                                          */
  
  union {
    __IM  uint32_t ISR;                         /*!< Interrupt and Status Register                                             */
    
    struct {
      __IM  uint32_t CMPM       : 1;            /*!< Compare match                                                             */
      __IM  uint32_t ARRM       : 1;            /*!< Autoreload match                                                          */
      __IM  uint32_t EXTTRIG    : 1;            /*!< External trigger edge event                                               */
      __IM  uint32_t CMPOK      : 1;            /*!< Compare register update OK                                                */
      __IM  uint32_t ARROK      : 1;            /*!< Autoreload register update OK                                             */
      __IM  uint32_t UP         : 1;            /*!< Counter direction change down to up                                       */
      __IM  uint32_t DOWN       : 1;            /*!< Counter direction change up to down                                       */
            uint32_t            : 25;
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< Interrupt Clear Register                                                  */
    
    struct {
      __OM  uint32_t CMPMCF     : 1;            /*!< compare match Clear Flag                                                  */
      __OM  uint32_t ARRMCF     : 1;            /*!< Autoreload match Clear Flag                                               */
      __OM  uint32_t EXTTRIGCF  : 1;            /*!< External trigger valid edge Clear Flag                                    */
      __OM  uint32_t CMPOKCF    : 1;            /*!< Compare register update OK Clear Flag                                     */
      __OM  uint32_t ARROKCF    : 1;            /*!< Autoreload register update OK Clear Flag                                  */
      __OM  uint32_t UPCF       : 1;            /*!< Direction change to UP Clear Flag                                         */
      __OM  uint32_t DOWNCF     : 1;            /*!< Direction change to down Clear Flag                                       */
            uint32_t            : 25;
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< Interrupt Enable Register                                                 */
    
    struct {
      __IOM uint32_t CMPMIE     : 1;            /*!< Compare match Interrupt Enable                                            */
      __IOM uint32_t ARRMIE     : 1;            /*!< Autoreload match Interrupt Enable                                         */
      __IOM uint32_t EXTTRIGIE  : 1;            /*!< External trigger valid edge Interrupt Enable                              */
      __IOM uint32_t CMPOKIE    : 1;            /*!< Compare register update OK Interrupt Enable                               */
      __IOM uint32_t ARROKIE    : 1;            /*!< Autoreload register update OK Interrupt Enable                            */
      __IOM uint32_t UPIE       : 1;            /*!< Direction change to UP Interrupt Enable                                   */
      __IOM uint32_t DOWNIE     : 1;            /*!< Direction change to down Interrupt Enable                                 */
            uint32_t            : 25;
    } IER_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< Configuration Register                                                    */
    
    struct {
      __IOM uint32_t CKSEL      : 1;            /*!< Clock selector                                                            */
      __IOM uint32_t CKPOL      : 2;            /*!< Clock Polarity                                                            */
      __IOM uint32_t CKFLT      : 2;            /*!< Configurable digital filter for external clock                            */
            uint32_t            : 1;
      __IOM uint32_t TRGFLT     : 2;            /*!< Configurable digital filter for trigger                                   */
            uint32_t            : 1;
      __IOM uint32_t PRESC      : 3;            /*!< Clock prescaler                                                           */
            uint32_t            : 1;
      __IOM uint32_t TRIGSEL    : 4;            /*!< Trigger selector                                                          */
      __IOM uint32_t TRIGEN     : 2;            /*!< Trigger enable and polarity                                               */
      __IOM uint32_t TIMOUT     : 1;            /*!< Timeout enable                                                            */
      __IOM uint32_t WAVE       : 1;            /*!< Waveform shape                                                            */
      __IOM uint32_t WAVPOL     : 1;            /*!< Waveform shape polarity                                                   */
      __IOM uint32_t PRELOAD    : 1;            /*!< Registers update mode                                                     */
      __IOM uint32_t COUNTMODE  : 1;            /*!< counter mode enabled                                                      */
      __IOM uint32_t ENC        : 1;            /*!< Encoder mode enable                                                       */
            uint32_t            : 7;
    } CFGR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< Control Register                                                          */
    
