unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< LPTIM Enable                                                              */
      __IOM uint32_t SNGSTRT    : 1;            /*!< LPTIM start in single mode                                                */
      __IOM uint32_t CNTSTRT    : 1;            /*!< Timer start in continuous mode                                            */
      __IOM uint32_t COUNTRST   : 1;            /*!< COUNTRST                                                                  */
      __IOM uint32_t RSTARE     : 1;            /*!< RSTARE                                                                    */
            uint32_t            : 27;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CMP;                         /*!< Compare Register                                                          */
    
    struct {
      __IOM uint32_t CMP        : 16;           /*!< Compare value                                                             */
            uint32_t            : 16;
    } CMP_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< Autoreload Register                                                       */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< Auto reload value                                                         */
            uint32_t            : 16;
    } ARR_b;
  } ;
  
  union {
    __IM  uint32_t CNT;                         /*!< Counter Register                                                          */
    
    struct {
      __IM  uint32_t CNT        : 16;           /*!< Counter value                                                             */
            uint32_t            : 16;
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t OR;                          /*!< option register                                                           */
    
    struct {
      __IOM uint32_t IN1        : 1;            /*!< IN1                                                                       */
      __IOM uint32_t IN2        : 1;            /*!< IN2                                                                       */
      __IOM uint32_t IN1_2_1    : 2;            /*!< IN1_2_1                                                                   */
      __IOM uint32_t IN2_2_1    : 2;            /*!< IN2_2_1                                                                   */
            uint32_t            : 26;
    } OR_b;
  } ;
} LPTIM1_Type;                                  /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver       transmitter (USART1)
  */

typedef struct {                                /*!< USART1 Structure                                                          */
  
  union {
    __IOM uint32_t CR1;                         /*!< Control register 1                                                        */
    
    struct {
      __IOM uint32_t UE         : 1;            /*!< USART enable                                                              */
      __IOM uint32_t UESM       : 1;            /*!< USART enable in Stop mode                                                 */
      __IOM uint32_t RE         : 1;            /*!< Receiver enable                                                           */
      __IOM uint32_t TE         : 1;            /*!< Transmitter enable                                                        */
      __IOM uint32_t IDLEIE     : 1;            /*!< IDLE interrupt enable                                                     */
      __IOM uint32_t RXNEIE     : 1;            /*!< RXNE interrupt enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< Transmission complete interrupt enable                                    */
      __IOM uint32_t TXEIE      : 1;            /*!< interrupt enable                                                          */
      __IOM uint32_t PEIE       : 1;            /*!< PE interrupt enable                                                       */
      __IOM uint32_t PS         : 1;            /*!< Parity selection                                                          */
      __IOM uint32_t PCE        : 1;            /*!< Parity control enable                                                     */
      __IOM uint32_t WAKE       : 1;            /*!< Receiver wakeup method                                                    */
      __IOM uint32_t M0         : 1;            /*!< Word length                                                               */
      __IOM uint32_t MME        : 1;            /*!< Mute mode enable                                                          */
      __IOM uint32_t CMIE       : 1;            /*!< Character match interrupt enable                                          */
      __IOM uint32_t OVER8      : 1;            /*!< Oversampling mode                                                         */
      __IOM uint32_t DEDT0      : 1;            /*!< DEDT0                                                                     */
      __IOM uint32_t DEDT1      : 1;            /*!< DEDT1                                                                     */
      __IOM uint32_t DEDT2      : 1;            /*!< DEDT2                                                                     */
      __IOM uint32_t DEDT3      : 1;            /*!< DEDT3                                                                     */
      __IOM uint32_t DEDT4      : 1;            /*!< Driver Enable de-assertion time                                           */
      __IOM uint32_t DEAT0      : 1;            /*!< DEAT0                                                                     */
      __IOM uint32_t DEAT1      : 1;            /*!< DEAT1                                                                     */
      __IOM uint32_t DEAT2      : 1;            /*!< DEAT2                                                                     */
      __IOM uint32_t DEAT3      : 1;            /*!< DEAT3                                                                     */
      __IOM uint32_t DEAT4      : 1;            /*!< Driver Enable assertion time                                              */
      __IOM uint32_t RTOIE      : 1;            /*!< Receiver timeout interrupt enable                                         */
      __IOM uint32_t EOBIE      : 1;            /*!< End of Block interrupt enable                                             */
      __IOM uint32_t M1         : 1;            /*!< M1                                                                        */
      __IOM uint32_t FIFOEN     : 1;            /*!< FIFOEN                                                                    */
      __IOM uint32_t TXFEIE     : 1;            /*!< TXFEIE                                                                    */
      __IOM uint32_t RXFFIE     : 1;            /*!< RXFFIE                                                                    */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< Control register 2                                                        */
    
