unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SLVEN      : 1;            /*!< SLVEN                                                                     */
            uint32_t            : 2;
      __IOM uint32_t DIS_NSS    : 1;            /*!< DIS_NSS                                                                   */
      __IOM uint32_t ADDM7      : 1;            /*!< 7-bit Address Detection/4-bit Address Detection                           */
      __IOM uint32_t LBDL       : 1;            /*!< LIN break detection length                                                */
      __IOM uint32_t LBDIE      : 1;            /*!< LIN break detection interrupt enable                                      */
            uint32_t            : 1;
      __IOM uint32_t LBCL       : 1;            /*!< Last bit clock pulse                                                      */
      __IOM uint32_t CPHA       : 1;            /*!< Clock phase                                                               */
      __IOM uint32_t CPOL       : 1;            /*!< Clock polarity                                                            */
      __IOM uint32_t CLKEN      : 1;            /*!< Clock enable                                                              */
      __IOM uint32_t STOP       : 2;            /*!< STOP bits                                                                 */
      __IOM uint32_t LINEN      : 1;            /*!< LIN mode enable                                                           */
      __IOM uint32_t SWAP       : 1;            /*!< Swap TX/RX pins                                                           */
      __IOM uint32_t RXINV      : 1;            /*!< RX pin active level inversion                                             */
      __IOM uint32_t TXINV      : 1;            /*!< TX pin active level inversion                                             */
      __IOM uint32_t TAINV      : 1;            /*!< Binary data inversion                                                     */
      __IOM uint32_t MSBFIRST   : 1;            /*!< Most significant bit first                                                */
      __IOM uint32_t ABREN      : 1;            /*!< Auto baud rate enable                                                     */
      __IOM uint32_t ABRMOD0    : 1;            /*!< ABRMOD0                                                                   */
      __IOM uint32_t ABRMOD1    : 1;            /*!< Auto baud rate mode                                                       */
      __IOM uint32_t RTOEN      : 1;            /*!< Receiver timeout enable                                                   */
      __IOM uint32_t ADD0_3     : 4;            /*!< Address of the USART node                                                 */
      __IOM uint32_t ADD4_7     : 4;            /*!< Address of the USART node                                                 */
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t CR3;                         /*!< Control register 3                                                        */
    
    struct {
      __IOM uint32_t EIE        : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t IREN       : 1;            /*!< Ir mode enable                                                            */
      __IOM uint32_t IRLP       : 1;            /*!< Ir low-power                                                              */
      __IOM uint32_t HDSEL      : 1;            /*!< Half-duplex selection                                                     */
      __IOM uint32_t NACK       : 1;            /*!< Smartcard NACK enable                                                     */
      __IOM uint32_t SCEN       : 1;            /*!< Smartcard mode enable                                                     */
      __IOM uint32_t DMAR       : 1;            /*!< DMA enable receiver                                                       */
      __IOM uint32_t DMAT       : 1;            /*!< DMA enable transmitter                                                    */
      __IOM uint32_t RTSE       : 1;            /*!< RTS enable                                                                */
      __IOM uint32_t CTSE       : 1;            /*!< CTS enable                                                                */
      __IOM uint32_t CTSIE      : 1;            /*!< CTS interrupt enable                                                      */
      __IOM uint32_t ONEBIT     : 1;            /*!< One sample bit method enable                                              */
      __IOM uint32_t OVRDIS     : 1;            /*!< Overrun Disable                                                           */
      __IOM uint32_t DDRE       : 1;            /*!< DMA Disable on Reception Error                                            */
      __IOM uint32_t DEM        : 1;            /*!< Driver enable mode                                                        */
      __IOM uint32_t DEP        : 1;            /*!< Driver enable polarity selection                                          */
            uint32_t            : 1;
      __IOM uint32_t SCARCNT    : 3;            /*!< Smartcard auto-retry count                                                */
      __IOM uint32_t WUS        : 2;            /*!< Wakeup from Stop mode interrupt flag selection                            */
      __IOM uint32_t WUFIE      : 1;            /*!< Wakeup from Stop mode interrupt enable                                    */
      __IOM uint32_t TXFTIE     : 1;            /*!< TXFTIE                                                                    */
      __IOM uint32_t TCBGTIE    : 1;            /*!< TCBGTIE                                                                   */
      __IOM uint32_t RXFTCFG    : 3;            /*!< RXFTCFG                                                                   */
      __IOM uint32_t RXFTIE     : 1;            /*!< RXFTIE                                                                    */
      __IOM uint32_t TXFTCFG    : 3;            /*!< TXFTCFG                                                                   */
    } CR3_b;
  } ;
  
  union {
    __IOM uint32_t BRR;                         /*!< Baud rate register                                                        */
    
