unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< DIV_Fraction                                                              */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< DIV_Mantissa                                                              */
            uint32_t            : 16;
    } BRR_b;
  } ;
  
  union {
    __IOM uint32_t GTPR;                        /*!< Guard time and prescaler register                                         */
    
    struct {
      __IOM uint32_t PSC        : 8;            /*!< Prescaler value                                                           */
      __IOM uint32_t GT         : 8;            /*!< Guard time value                                                          */
            uint32_t            : 16;
    } GTPR_b;
  } ;
  
  union {
    __IOM uint32_t RTOR;                        /*!< Receiver timeout register                                                 */
    
    struct {
      __IOM uint32_t RTO        : 24;           /*!< Receiver timeout value                                                    */
      __IOM uint32_t BLEN       : 8;            /*!< Block Length                                                              */
    } RTOR_b;
  } ;
  
  union {
    __OM  uint32_t RQR;                         /*!< Request register                                                          */
    
    struct {
      __OM  uint32_t ABRRQ      : 1;            /*!< Auto baud rate request                                                    */
      __OM  uint32_t SBKRQ      : 1;            /*!< Send break request                                                        */
      __OM  uint32_t MMRQ       : 1;            /*!< Mute mode request                                                         */
      __OM  uint32_t RXFRQ      : 1;            /*!< Receive data flush request                                                */
      __OM  uint32_t TXFRQ      : 1;            /*!< Transmit data flush request                                               */
            uint32_t            : 27;
    } RQR_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< Interrupt & status register                                               */
    
    struct {
      __IM  uint32_t PE         : 1;            /*!< PE                                                                        */
      __IM  uint32_t FE         : 1;            /*!< FE                                                                        */
      __IM  uint32_t NF         : 1;            /*!< NF                                                                        */
      __IM  uint32_t ORE        : 1;            /*!< ORE                                                                       */
      __IM  uint32_t IDLE       : 1;            /*!< IDLE                                                                      */
      __IM  uint32_t RXNE       : 1;            /*!< RXNE                                                                      */
      __IM  uint32_t TC         : 1;            /*!< TC                                                                        */
      __IM  uint32_t TXE        : 1;            /*!< TXE                                                                       */
      __IM  uint32_t LBDF       : 1;            /*!< LBDF                                                                      */
      __IM  uint32_t CTSIF      : 1;            /*!< CTSIF                                                                     */
      __IM  uint32_t CTS        : 1;            /*!< CTS                                                                       */
      __IM  uint32_t RTOF       : 1;            /*!< RTOF                                                                      */
      __IM  uint32_t EOBF       : 1;            /*!< EOBF                                                                      */
      __IM  uint32_t UDR        : 1;            /*!< UDR                                                                       */
      __IM  uint32_t ABRE       : 1;            /*!< ABRE                                                                      */
      __IM  uint32_t ABRF       : 1;            /*!< ABRF                                                                      */
      __IM  uint32_t BUSY       : 1;            /*!< BUSY                                                                      */
      __IM  uint32_t CMF        : 1;            /*!< CMF                                                                       */
      __IM  uint32_t SBKF       : 1;            /*!< SBKF                                                                      */
      __IM  uint32_t RWU        : 1;            /*!< RWU                                                                       */
      __IM  uint32_t WUF        : 1;            /*!< WUF                                                                       */
      __IM  uint32_t TEACK      : 1;            /*!< TEACK                                                                     */
      __IM  uint32_t REACK      : 1;            /*!< REACK                                                                     */
      __IM  uint32_t TXFE       : 1;            /*!< TXFE                                                                      */
      __IM  uint32_t RXFF       : 1;            /*!< RXFF                                                                      */
      __IM  uint32_t TCBGT      : 1;            /*!< TCBGT                                                                     */
      __IM  uint32_t RXFT       : 1;            /*!< RXFT                                                                      */
      __IM  uint32_t TXFT       : 1;            /*!< TXFT                                                                      */
            uint32_t            : 4;
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< Interrupt flag clear register                                             */
    
