unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t PECF       : 1;            /*!< Parity error clear flag                                                   */
      __OM  uint32_t FECF       : 1;            /*!< Framing error clear flag                                                  */
      __OM  uint32_t NCF        : 1;            /*!< Noise detected clear flag                                                 */
      __OM  uint32_t ORECF      : 1;            /*!< Overrun error clear flag                                                  */
      __OM  uint32_t IDLECF     : 1;            /*!< Idle line detected clear flag                                             */
      __OM  uint32_t TXFECF     : 1;            /*!< TXFECF                                                                    */
      __OM  uint32_t TCCF       : 1;            /*!< Transmission complete clear flag                                          */
      __OM  uint32_t TCBGTCF    : 1;            /*!< TCBGTCF                                                                   */
      __OM  uint32_t LBDCF      : 1;            /*!< LIN break detection clear flag                                            */
      __OM  uint32_t CTSCF      : 1;            /*!< CTS clear flag                                                            */
            uint32_t            : 1;
      __OM  uint32_t RTOCF      : 1;            /*!< Receiver timeout clear flag                                               */
      __OM  uint32_t EOBCF      : 1;            /*!< End of block clear flag                                                   */
      __OM  uint32_t UDRCF      : 1;            /*!< UDRCF                                                                     */
            uint32_t            : 3;
      __OM  uint32_t CMCF       : 1;            /*!< Character match clear flag                                                */
            uint32_t            : 2;
      __OM  uint32_t WUCF       : 1;            /*!< Wakeup from Stop mode clear flag                                          */
            uint32_t            : 11;
    } ICR_b;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< Receive data register                                                     */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< Receive data value                                                        */
            uint32_t            : 23;
    } RDR_b;
  } ;
  
  union {
    __IOM uint32_t TDR;                         /*!< Transmit data register                                                    */
    
    struct {
      __IOM uint32_t TDR        : 9;            /*!< Transmit data value                                                       */
            uint32_t            : 23;
    } TDR_b;
  } ;
  
  union {
    __IOM uint32_t PRESC;                       /*!< USART prescaler register                                                  */
    
    struct {
      __IOM uint32_t PRESCALER  : 4;            /*!< PRESCALER                                                                 */
            uint32_t            : 28;
    } PRESC_b;
  } ;
} USART1_Type;                                  /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART4                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver       transmitter (UART4)
  */

typedef struct {                                /*!< UART4 Structure                                                           */
  
  union {
    __IOM uint32_t CR1;                         /*!< Control register 1                                                        */
    
    struct {
      __IOM uint32_t UE         : 1;            /*!< USART enable                                                              */
      __IOM uint32_t UESM       : 1;            /*!< USART enable in Stop mode                                                 */
      __IOM uint32_t RE         : 1;            /*!< Receiver enable                                                           */
      __IOM uint32_t TE         : 1;            /*!< Transmitter enable                                                        */
      __IOM uint32_t IDLEIE     : 1;            /*!< IDLE interrupt enable                                                     */
      __IOM uint32_t RXNEIE     : 1;            /*!< RXNE interrupt enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< Transmission complete interrupt enable                                    */
      __IOM uint32_t TXEIE      : 1;            /*!< interrupt enable                                                          */
      __IOM uint32_t PEIE       : 1;            /*!< PE interrupt enable                                                       */
      __IOM uint32_t PS         : 1;            /*!< Parity selection                                                          */
      __IOM uint32_t PCE        : 1;            /*!< Parity control enable                                                     */
      __IOM uint32_t WAKE       : 1;            /*!< Receiver wakeup method                                                    */
      __IOM uint32_t M0         : 1;            /*!< Word length                                                               */
      __IOM uint32_t MME        : 1;            /*!< Mute mode enable                                                          */
      __IOM uint32_t CMIE       : 1;            /*!< Character match interrupt enable                                          */
      __IOM uint32_t OVER8      : 1;            /*!< Oversampling mode                                                         */
      __IOM uint32_t DEDT0      : 1;            /*!< DEDT0                                                                     */
      __IOM uint32_t DEDT1      : 1;            /*!< DEDT1                                                                     */
      __IOM uint32_t DEDT2      : 1;            /*!< DEDT2                                                                     */
      __IOM uint32_t DEDT3      : 1;            /*!< DEDT3                                                                     */
      __IOM uint32_t DEDT4      : 1;            /*!< Driver Enable de-assertion time                                           */
      __IOM uint32_t DEAT0      : 1;            /*!< DEAT0                                                                     */
      __IOM uint32_t DEAT1      : 1;            /*!< DEAT1                                                                     */
      __IOM uint32_t DEAT2      : 1;            /*!< DEAT2                                                                     */
      __IOM uint32_t DEAT3      : 1;            /*!< DEAT3                                                                     */
      __IOM uint32_t DEAT4      : 1;            /*!< Driver Enable assertion time                                              */
      __IOM uint32_t RTOIE      : 1;            /*!< Receiver timeout interrupt enable                                         */
      __IOM uint32_t EOBIE      : 1;            /*!< End of Block interrupt enable                                             */
      __IOM uint32_t M1         : 1;            /*!< M1                                                                        */
      __IOM uint32_t FIFOEN     : 1;            /*!< FIFOEN                                                                    */
      __IOM uint32_t TXFEIE     : 1;            /*!< TXFEIE                                                                    */
      __IOM uint32_t RXFFIE     : 1;            /*!< RXFFIE                                                                    */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< Control register 2                                                        */
    
