unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDM7      : 1;            /*!< 7-bit Address Detection/4-bit Address Detection                           */
            uint32_t            : 7;
      __IOM uint32_t STOP       : 2;            /*!< STOP bits                                                                 */
            uint32_t            : 1;
      __IOM uint32_t SWAP       : 1;            /*!< Swap TX/RX pins                                                           */
      __IOM uint32_t RXINV      : 1;            /*!< RX pin active level inversion                                             */
      __IOM uint32_t TXINV      : 1;            /*!< TX pin active level inversion                                             */
      __IOM uint32_t TAINV      : 1;            /*!< Binary data inversion                                                     */
      __IOM uint32_t MSBFIRST   : 1;            /*!< Most significant bit first                                                */
            uint32_t            : 4;
      __IOM uint32_t ADD0_3     : 4;            /*!< Address of the USART node                                                 */
      __IOM uint32_t ADD4_7     : 4;            /*!< Address of the USART node                                                 */
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t CR3;                         /*!< Control register 3                                                        */
    
    struct {
      __IOM uint32_t EIE        : 1;            /*!< Error interrupt enable                                                    */
            uint32_t            : 2;
      __IOM uint32_t HDSEL      : 1;            /*!< Half-duplex selection                                                     */
            uint32_t            : 2;
      __IOM uint32_t DMAR       : 1;            /*!< DMA enable receiver                                                       */
      __IOM uint32_t DMAT       : 1;            /*!< DMA enable transmitter                                                    */
      __IOM uint32_t RTSE       : 1;            /*!< RTS enable                                                                */
      __IOM uint32_t CTSE       : 1;            /*!< CTS enable                                                                */
      __IOM uint32_t CTSIE      : 1;            /*!< CTS interrupt enable                                                      */
            uint32_t            : 1;
      __IOM uint32_t OVRDIS     : 1;            /*!< Overrun Disable                                                           */
      __IOM uint32_t DDRE       : 1;            /*!< DMA Disable on Reception Error                                            */
      __IOM uint32_t DEM        : 1;            /*!< Driver enable mode                                                        */
      __IOM uint32_t DEP        : 1;            /*!< Driver enable polarity selection                                          */
            uint32_t            : 4;
      __IOM uint32_t WUS        : 2;            /*!< Wakeup from Stop mode interrupt flag selection                            */
      __IOM uint32_t WUFIE      : 1;            /*!< Wakeup from Stop mode interrupt enable                                    */
      __IOM uint32_t TXFTIE     : 1;            /*!< TXFTIE                                                                    */
            uint32_t            : 1;
      __IOM uint32_t RXFTCFG    : 3;            /*!< RXFTCFG                                                                   */
      __IOM uint32_t RXFTIE     : 1;            /*!< RXFTIE                                                                    */
      __IOM uint32_t TXFTCFG    : 3;            /*!< TXFTCFG                                                                   */
    } CR3_b;
  } ;
  
  union {
    __IOM uint32_t BRR;                         /*!< Baud rate register                                                        */
    
    struct {
      __IOM uint32_t BRR        : 20;           /*!< BRR                                                                       */
            uint32_t            : 12;
    } BRR_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __OM  uint32_t RQR;                         /*!< Request register                                                          */
    
    struct {
            uint32_t            : 1;
      __OM  uint32_t SBKRQ      : 1;            /*!< Send break request                                                        */
      __OM  uint32_t MMRQ       : 1;            /*!< Mute mode request                                                         */
      __OM  uint32_t RXFRQ      : 1;            /*!< Receive data flush request                                                */
      __OM  uint32_t TXFRQ      : 1;            /*!< TXFRQ                                                                     */
            uint32_t            : 27;
    } RQR_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< Interrupt & status register                                               */
    
    struct {
      __IM  uint32_t PE         : 1;            /*!< PE                                                                        */
      __IM  uint32_t FE         : 1;            /*!< FE                                                                        */
      __IM  uint32_t NF         : 1;            /*!< NF                                                                        */
      __IM  uint32_t ORE        : 1;            /*!< ORE                                                                       */
      __IM  uint32_t IDLE       : 1;            /*!< IDLE                                                                      */
      __IM  uint32_t RXNE       : 1;            /*!< RXNE                                                                      */
      __IM  uint32_t TC         : 1;            /*!< TC                                                                        */
      __IM  uint32_t TXE        : 1;            /*!< TXE                                                                       */
            uint32_t            : 1;
      __IM  uint32_t CTSIF      : 1;            /*!< CTSIF                                                                     */
      __IM  uint32_t CTS        : 1;            /*!< CTS                                                                       */
            uint32_t            : 5;
      __IM  uint32_t BUSY       : 1;            /*!< BUSY                                                                      */
      __IM  uint32_t CMF        : 1;            /*!< CMF                                                                       */
      __IM  uint32_t SBKF       : 1;            /*!< SBKF                                                                      */
      __IM  uint32_t RWU        : 1;            /*!< RWU                                                                       */
      __IM  uint32_t WUF        : 1;            /*!< WUF                                                                       */
      __IM  uint32_t TEACK      : 1;            /*!< TEACK                                                                     */
      __IM  uint32_t REACK      : 1;            /*!< REACK                                                                     */
      __IM  uint32_t TXFE       : 1;            /*!< TXFE                                                                      */
      __IM  uint32_t RXFF       : 1;            /*!< RXFF                                                                      */
            uint32_t            : 1;
      __IM  uint32_t RXFT       : 1;            /*!< RXFT                                                                      */
      __IM  uint32_t TXFT       : 1;            /*!< TXFT                                                                      */
            uint32_t            : 4;
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< Interrupt flag clear register                                             */
    
