unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t PECF       : 1;            /*!< Parity error clear flag                                                   */
      __OM  uint32_t FECF       : 1;            /*!< Framing error clear flag                                                  */
      __OM  uint32_t NCF        : 1;            /*!< Noise detected clear flag                                                 */
      __OM  uint32_t ORECF      : 1;            /*!< Overrun error clear flag                                                  */
      __OM  uint32_t IDLECF     : 1;            /*!< Idle line detected clear flag                                             */
            uint32_t            : 1;
      __OM  uint32_t TCCF       : 1;            /*!< Transmission complete clear flag                                          */
            uint32_t            : 2;
      __OM  uint32_t CTSCF      : 1;            /*!< CTS clear flag                                                            */
            uint32_t            : 7;
      __OM  uint32_t CMCF       : 1;            /*!< Character match clear flag                                                */
            uint32_t            : 2;
      __OM  uint32_t WUCF       : 1;            /*!< Wakeup from Stop mode clear flag                                          */
            uint32_t            : 11;
    } ICR_b;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< Receive data register                                                     */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< Receive data value                                                        */
            uint32_t            : 23;
    } RDR_b;
  } ;
  
  union {
    __IOM uint32_t TDR;                         /*!< Transmit data register                                                    */
    
    struct {
      __IOM uint32_t TDR        : 9;            /*!< Transmit data value                                                       */
            uint32_t            : 23;
    } TDR_b;
  } ;
  
  union {
    __IOM uint32_t PRESC;                       /*!< Prescaler register                                                        */
    
    struct {
      __IOM uint32_t PRESCALER  : 4;            /*!< PRESCALER                                                                 */
            uint32_t            : 28;
    } PRESC_b;
  } ;
} LPUART1_Type;                                 /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface/Inter-IC       sound (SPI1)
  */

typedef struct {                                /*!< SPI1 Structure                                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< control register 1                                                        */
    
    struct {
      __IOM uint32_t CPHA       : 1;            /*!< Clock phase                                                               */
      __IOM uint32_t CPOL       : 1;            /*!< Clock polarity                                                            */
      __IOM uint32_t MSTR       : 1;            /*!< Master selection                                                          */
      __IOM uint32_t BR         : 3;            /*!< Baud rate control                                                         */
      __IOM uint32_t SPE        : 1;            /*!< SPI enable                                                                */
      __IOM uint32_t LSBFIRST   : 1;            /*!< Frame format                                                              */
      __IOM uint32_t SSI        : 1;            /*!< Internal slave select                                                     */
      __IOM uint32_t SSM        : 1;            /*!< Software slave management                                                 */
      __IOM uint32_t RXONLY     : 1;            /*!< Receive only                                                              */
      __IOM uint32_t DFF        : 1;            /*!< Data frame format                                                         */
      __IOM uint32_t CRCNEXT    : 1;            /*!< CRC transfer next                                                         */
      __IOM uint32_t CRCEN      : 1;            /*!< Hardware CRC calculation enable                                           */
      __IOM uint32_t BIDIOE     : 1;            /*!< Output enable in bidirectional mode                                       */
      __IOM uint32_t BIDIMODE   : 1;            /*!< Bidirectional data mode enable                                            */
            uint32_t            : 16;
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< control register 2                                                        */
    
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< Rx buffer DMA enable                                                      */
      __IOM uint32_t TXDMAEN    : 1;            /*!< Tx buffer DMA enable                                                      */
      __IOM uint32_t SSOE       : 1;            /*!< SS output enable                                                          */
      __IOM uint32_t NSSP       : 1;            /*!< NSS pulse management                                                      */
      __IOM uint32_t FRF        : 1;            /*!< Frame format                                                              */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RXNEIE     : 1;            /*!< RX buffer not empty interrupt enable                                      */
      __IOM uint32_t TXEIE      : 1;            /*!< Tx buffer empty interrupt enable                                          */
      __IOM uint32_t DS         : 4;            /*!< Data size                                                                 */
      __IOM uint32_t FRXTH      : 1;            /*!< FIFO reception threshold                                                  */
      __IOM uint32_t LDMA_RX    : 1;            /*!< Last DMA transfer for reception                                           */
      __IOM uint32_t LDMA_TX    : 1;            /*!< Last DMA transfer for transmission                                        */
            uint32_t            : 17;
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< status register                                                           */
    
