unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< Rx buffer DMA enable                                                      */
      __IOM uint32_t TXDMAEN    : 1;            /*!< Tx buffer DMA enable                                                      */
      __IOM uint32_t SSOE       : 1;            /*!< SS output enable                                                          */
      __IOM uint32_t NSSP       : 1;            /*!< NSS pulse management                                                      */
      __IOM uint32_t FRF        : 1;            /*!< Frame format                                                              */
      __IOM uint32_t ERRIE      : 1;            /*!< Error interrupt enable                                                    */
      __IOM uint32_t RXNEIE     : 1;            /*!< RX buffer not empty interrupt enable                                      */
      __IOM uint32_t TXEIE      : 1;            /*!< Tx buffer empty interrupt enable                                          */
      __IOM uint32_t DS         : 4;            /*!< Data size                                                                 */
      __IOM uint32_t FRXTH      : 1;            /*!< FIFO reception threshold                                                  */
      __IOM uint32_t LDMA_RX    : 1;            /*!< Last DMA transfer for reception                                           */
      __IOM uint32_t LDMA_TX    : 1;            /*!< Last DMA transfer for transmission                                        */
            uint32_t            : 17;
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IM  uint32_t RXNE       : 1;            /*!< Receive buffer not empty                                                  */
      __IM  uint32_t TXE        : 1;            /*!< Transmit buffer empty                                                     */
            uint32_t            : 2;
      __IOM uint32_t CRCERR     : 1;            /*!< CRC error flag                                                            */
      __IM  uint32_t MODF       : 1;            /*!< Mode fault                                                                */
      __IM  uint32_t OVR        : 1;            /*!< Overrun flag                                                              */
      __IM  uint32_t BSY        : 1;            /*!< Busy flag                                                                 */
      __IM  uint32_t TIFRFE     : 1;            /*!< TI frame format error                                                     */
      __IM  uint32_t FRLVL      : 2;            /*!< FIFO reception level                                                      */
      __IM  uint32_t FTLVL      : 2;            /*!< FIFO transmission level                                                   */
            uint32_t            : 19;
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< data register                                                             */
    
    struct {
      __IOM uint32_t DR         : 16;           /*!< Data register                                                             */
            uint32_t            : 16;
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t CRCPR;                       /*!< CRC polynomial register                                                   */
    
    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< CRC polynomial register                                                   */
            uint32_t            : 16;
    } CRCPR_b;
  } ;
  
  union {
    __IM  uint32_t RXCRCR;                      /*!< RX CRC register                                                           */
    
    struct {
      __IM  uint32_t RxCRC      : 16;           /*!< Rx CRC register                                                           */
            uint32_t            : 16;
    } RXCRCR_b;
  } ;
  
  union {
    __IM  uint32_t TXCRCR;                      /*!< TX CRC register                                                           */
    
    struct {
      __IM  uint32_t TxCRC      : 16;           /*!< Tx CRC register                                                           */
            uint32_t            : 16;
    } TXCRCR_b;
  } ;
  
  union {
    __IOM uint32_t I2SCFGR;                     /*!< configuration register                                                    */
    
    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< CHLEN                                                                     */
      __IOM uint32_t DATLEN     : 2;            /*!< DATLEN                                                                    */
      __IOM uint32_t CKPOL      : 1;            /*!< CKPOL                                                                     */
      __IOM uint32_t I2SSTD     : 2;            /*!< I2SSTD                                                                    */
            uint32_t            : 1;
      __IOM uint32_t PCMSYNC    : 1;            /*!< PCMSYNC                                                                   */
      __IOM uint32_t I2SCFG     : 2;            /*!< I2SCFG                                                                    */
      __IOM uint32_t I2SE       : 1;            /*!< I2SE                                                                      */
      __IOM uint32_t I2SMOD     : 1;            /*!< I2SMOD                                                                    */
            uint32_t            : 20;
    } I2SCFGR_b;
  } ;
  
  union {
    __IOM uint32_t I2SPR;                       /*!< prescaler register                                                        */
    
    struct {
      __IOM uint32_t I2SDIV     : 8;            /*!< I2SDIV                                                                    */
      __IOM uint32_t ODD        : 1;            /*!< ODD                                                                       */
      __IOM uint32_t MCKOE      : 1;            /*!< MCKOE                                                                     */
            uint32_t            : 22;
    } I2SPR_b;
  } ;
} SPI4_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event       controller (EXTI)
  */

typedef struct {                                /*!< EXTI Structure                                                            */
  
  union {
    __IOM uint32_t IMR1;                        /*!< Interrupt mask register                                                   */
    
