unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t IM0        : 1;            /*!< Interrupt Mask on line 0                                                  */
      __IOM uint32_t IM1        : 1;            /*!< Interrupt Mask on line 1                                                  */
      __IOM uint32_t IM2        : 1;            /*!< Interrupt Mask on line 2                                                  */
      __IOM uint32_t IM3        : 1;            /*!< Interrupt Mask on line 3                                                  */
      __IOM uint32_t IM4        : 1;            /*!< Interrupt Mask on line 4                                                  */
      __IOM uint32_t IM5        : 1;            /*!< Interrupt Mask on line 5                                                  */
      __IOM uint32_t IM6        : 1;            /*!< Interrupt Mask on line 6                                                  */
      __IOM uint32_t IM7        : 1;            /*!< Interrupt Mask on line 7                                                  */
      __IOM uint32_t IM8        : 1;            /*!< Interrupt Mask on line 8                                                  */
      __IOM uint32_t IM9        : 1;            /*!< Interrupt Mask on line 9                                                  */
      __IOM uint32_t IM10       : 1;            /*!< Interrupt Mask on line 10                                                 */
      __IOM uint32_t IM11       : 1;            /*!< Interrupt Mask on line 11                                                 */
      __IOM uint32_t IM12       : 1;            /*!< Interrupt Mask on line 12                                                 */
      __IOM uint32_t IM13       : 1;            /*!< Interrupt Mask on line 13                                                 */
      __IOM uint32_t IM14       : 1;            /*!< Interrupt Mask on line 14                                                 */
      __IOM uint32_t IM15       : 1;            /*!< Interrupt Mask on line 15                                                 */
      __IOM uint32_t IM16       : 1;            /*!< Interrupt Mask on line 16                                                 */
      __IOM uint32_t IM17       : 1;            /*!< Interrupt Mask on line 17                                                 */
      __IOM uint32_t IM18       : 1;            /*!< Interrupt Mask on line 18                                                 */
      __IOM uint32_t IM19       : 1;            /*!< Interrupt Mask on line 19                                                 */
      __IOM uint32_t IM20       : 1;            /*!< Interrupt Mask on line 20                                                 */
      __IOM uint32_t IM21       : 1;            /*!< Interrupt Mask on line 21                                                 */
      __IOM uint32_t IM22       : 1;            /*!< Interrupt Mask on line 22                                                 */
      __IOM uint32_t IM23       : 1;            /*!< Interrupt Mask on line 23                                                 */
      __IOM uint32_t IM24       : 1;            /*!< Interrupt Mask on line 24                                                 */
      __IOM uint32_t IM25       : 1;            /*!< Interrupt Mask on line 25                                                 */
      __IOM uint32_t IM26       : 1;            /*!< Interrupt Mask on line 26                                                 */
      __IOM uint32_t IM27       : 1;            /*!< Interrupt Mask on line 27                                                 */
      __IOM uint32_t IM28       : 1;            /*!< Interrupt Mask on line 28                                                 */
      __IOM uint32_t IM29       : 1;            /*!< Interrupt Mask on line 29                                                 */
      __IOM uint32_t IM30       : 1;            /*!< Interrupt Mask on line 30                                                 */
      __IOM uint32_t IM31       : 1;            /*!< Interrupt Mask on line 31                                                 */
    } IMR1_b;
  } ;
  
  union {
    __IOM uint32_t EMR1;                        /*!< Event mask register                                                       */
    
    struct {
      __IOM uint32_t EM0        : 1;            /*!< Event Mask on line 0                                                      */
      __IOM uint32_t EM1        : 1;            /*!< Event Mask on line 1                                                      */
      __IOM uint32_t EM2        : 1;            /*!< Event Mask on line 2                                                      */
      __IOM uint32_t EM3        : 1;            /*!< Event Mask on line 3                                                      */
      __IOM uint32_t EM4        : 1;            /*!< Event Mask on line 4                                                      */
      __IOM uint32_t EM5        : 1;            /*!< Event Mask on line 5                                                      */
      __IOM uint32_t EM6        : 1;            /*!< Event Mask on line 6                                                      */
      __IOM uint32_t EM7        : 1;            /*!< Event Mask on line 7                                                      */
      __IOM uint32_t EM8        : 1;            /*!< Event Mask on line 8                                                      */
      __IOM uint32_t EM9        : 1;            /*!< Event Mask on line 9                                                      */
      __IOM uint32_t EM10       : 1;            /*!< Event Mask on line 10                                                     */
      __IOM uint32_t EM11       : 1;            /*!< Event Mask on line 11                                                     */
      __IOM uint32_t EM12       : 1;            /*!< Event Mask on line 12                                                     */
      __IOM uint32_t EM13       : 1;            /*!< Event Mask on line 13                                                     */
      __IOM uint32_t EM14       : 1;            /*!< Event Mask on line 14                                                     */
      __IOM uint32_t EM15       : 1;            /*!< Event Mask on line 15                                                     */
      __IOM uint32_t EM16       : 1;            /*!< Event Mask on line 16                                                     */
      __IOM uint32_t EM17       : 1;            /*!< Event Mask on line 17                                                     */
      __IOM uint32_t EM18       : 1;            /*!< Event Mask on line 18                                                     */
      __IOM uint32_t EM19       : 1;            /*!< Event Mask on line 19                                                     */
      __IOM uint32_t EM20       : 1;            /*!< Event Mask on line 20                                                     */
      __IOM uint32_t EM21       : 1;            /*!< Event Mask on line 21                                                     */
      __IOM uint32_t EM22       : 1;            /*!< Event Mask on line 22                                                     */
      __IOM uint32_t EM23       : 1;            /*!< Event Mask on line 23                                                     */
      __IOM uint32_t EM24       : 1;            /*!< Event Mask on line 24                                                     */
      __IOM uint32_t EM25       : 1;            /*!< Event Mask on line 25                                                     */
      __IOM uint32_t EM26       : 1;            /*!< Event Mask on line 26                                                     */
      __IOM uint32_t EM27       : 1;            /*!< Event Mask on line 27                                                     */
      __IOM uint32_t EM28       : 1;            /*!< Event Mask on line 28                                                     */
      __IOM uint32_t EM29       : 1;            /*!< Event Mask on line 29                                                     */
      __IOM uint32_t EM30       : 1;            /*!< Event Mask on line 30                                                     */
      __IOM uint32_t EM31       : 1;            /*!< Event Mask on line 31                                                     */
    } EMR1_b;
  } ;
  
  union {
    __IOM uint32_t RTSR1;                       /*!< Rising Trigger selection register                                         */
    
