unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t RT0        : 1;            /*!< Rising trigger event configuration of line 0                              */
      __IOM uint32_t RT1        : 1;            /*!< Rising trigger event configuration of line 1                              */
      __IOM uint32_t RT2        : 1;            /*!< Rising trigger event configuration of line 2                              */
      __IOM uint32_t RT3        : 1;            /*!< Rising trigger event configuration of line 3                              */
      __IOM uint32_t RT4        : 1;            /*!< Rising trigger event configuration of line 4                              */
      __IOM uint32_t RT5        : 1;            /*!< Rising trigger event configuration of line 5                              */
      __IOM uint32_t RT6        : 1;            /*!< Rising trigger event configuration of line 6                              */
      __IOM uint32_t RT7        : 1;            /*!< Rising trigger event configuration of line 7                              */
      __IOM uint32_t RT8        : 1;            /*!< Rising trigger event configuration of line 8                              */
      __IOM uint32_t RT9        : 1;            /*!< Rising trigger event configuration of line 9                              */
      __IOM uint32_t RT10       : 1;            /*!< Rising trigger event configuration of line 10                             */
      __IOM uint32_t RT11       : 1;            /*!< Rising trigger event configuration of line 11                             */
      __IOM uint32_t RT12       : 1;            /*!< Rising trigger event configuration of line 12                             */
      __IOM uint32_t RT13       : 1;            /*!< Rising trigger event configuration of line 13                             */
      __IOM uint32_t RT14       : 1;            /*!< Rising trigger event configuration of line 14                             */
      __IOM uint32_t RT15       : 1;            /*!< Rising trigger event configuration of line 15                             */
      __IOM uint32_t RT16       : 1;            /*!< Rising trigger event configuration of line 16                             */
            uint32_t            : 1;
      __IOM uint32_t RT18       : 1;            /*!< Rising trigger event configuration of line 18                             */
      __IOM uint32_t RT19       : 1;            /*!< Rising trigger event configuration of line 19                             */
      __IOM uint32_t RT20       : 1;            /*!< Rising trigger event configuration of line 20                             */
      __IOM uint32_t RT21       : 1;            /*!< Rising trigger event configuration of line 21                             */
      __IOM uint32_t RT22       : 1;            /*!< Rising trigger event configuration of line 22                             */
            uint32_t            : 6;
      __IOM uint32_t RT         : 3;            /*!< RT                                                                        */
    } RTSR1_b;
  } ;
  
  union {
    __IOM uint32_t FTSR1;                       /*!< Falling Trigger selection register                                        */
    
    struct {
      __IOM uint32_t FT0        : 1;            /*!< Falling trigger event configuration of line 0                             */
      __IOM uint32_t FT1        : 1;            /*!< Falling trigger event configuration of line 1                             */
      __IOM uint32_t FT2        : 1;            /*!< Falling trigger event configuration of line 2                             */
      __IOM uint32_t FT3        : 1;            /*!< Falling trigger event configuration of line 3                             */
      __IOM uint32_t FT4        : 1;            /*!< Falling trigger event configuration of line 4                             */
      __IOM uint32_t FT5        : 1;            /*!< Falling trigger event configuration of line 5                             */
      __IOM uint32_t FT6        : 1;            /*!< Falling trigger event configuration of line 6                             */
      __IOM uint32_t FT7        : 1;            /*!< Falling trigger event configuration of line 7                             */
      __IOM uint32_t FT8        : 1;            /*!< Falling trigger event configuration of line 8                             */
      __IOM uint32_t FT9        : 1;            /*!< Falling trigger event configuration of line 9                             */
      __IOM uint32_t FT10       : 1;            /*!< Falling trigger event configuration of line 10                            */
      __IOM uint32_t FT11       : 1;            /*!< Falling trigger event configuration of line 11                            */
      __IOM uint32_t FT12       : 1;            /*!< Falling trigger event configuration of line 12                            */
      __IOM uint32_t FT13       : 1;            /*!< Falling trigger event configuration of line 13                            */
      __IOM uint32_t FT14       : 1;            /*!< Falling trigger event configuration of line 14                            */
      __IOM uint32_t FT15       : 1;            /*!< Falling trigger event configuration of line 15                            */
      __IOM uint32_t FT16       : 1;            /*!< Falling trigger event configuration of line 16                            */
            uint32_t            : 1;
      __IOM uint32_t FT18       : 1;            /*!< Falling trigger event configuration of line 18                            */
      __IOM uint32_t FT19       : 1;            /*!< Falling trigger event configuration of line 19                            */
      __IOM uint32_t FT20       : 1;            /*!< Falling trigger event configuration of line 20                            */
      __IOM uint32_t FT21       : 1;            /*!< Falling trigger event configuration of line 21                            */
      __IOM uint32_t FT22       : 1;            /*!< Falling trigger event configuration of line 22                            */
            uint32_t            : 9;
    } FTSR1_b;
  } ;
  
  union {
    __IOM uint32_t SWIER1;                      /*!< Software interrupt event register                                         */
    
