unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SWI0       : 1;            /*!< Software Interrupt on line 0                                              */
      __IOM uint32_t SWI1       : 1;            /*!< Software Interrupt on line 1                                              */
      __IOM uint32_t SWI2       : 1;            /*!< Software Interrupt on line 2                                              */
      __IOM uint32_t SWI3       : 1;            /*!< Software Interrupt on line 3                                              */
      __IOM uint32_t SWI4       : 1;            /*!< Software Interrupt on line 4                                              */
      __IOM uint32_t SWI5       : 1;            /*!< Software Interrupt on line 5                                              */
      __IOM uint32_t SWI6       : 1;            /*!< Software Interrupt on line 6                                              */
      __IOM uint32_t SWI7       : 1;            /*!< Software Interrupt on line 7                                              */
      __IOM uint32_t SWI8       : 1;            /*!< Software Interrupt on line 8                                              */
      __IOM uint32_t SWI9       : 1;            /*!< Software Interrupt on line 9                                              */
      __IOM uint32_t SWI10      : 1;            /*!< Software Interrupt on line 10                                             */
      __IOM uint32_t SWI11      : 1;            /*!< Software Interrupt on line 11                                             */
      __IOM uint32_t SWI12      : 1;            /*!< Software Interrupt on line 12                                             */
      __IOM uint32_t SWI13      : 1;            /*!< Software Interrupt on line 13                                             */
      __IOM uint32_t SWI14      : 1;            /*!< Software Interrupt on line 14                                             */
      __IOM uint32_t SWI15      : 1;            /*!< Software Interrupt on line 15                                             */
      __IOM uint32_t SWI16      : 1;            /*!< Software Interrupt on line 16                                             */
            uint32_t            : 1;
      __IOM uint32_t SWI18      : 1;            /*!< Software Interrupt on line 18                                             */
      __IOM uint32_t SWI19      : 1;            /*!< Software Interrupt on line 19                                             */
      __IOM uint32_t SWI20      : 1;            /*!< Software Interrupt on line 20                                             */
      __IOM uint32_t SWI21      : 1;            /*!< Software Interrupt on line 21                                             */
      __IOM uint32_t SWI22      : 1;            /*!< Software Interrupt on line 22                                             */
            uint32_t            : 9;
    } SWIER1_b;
  } ;
  
  union {
    __IOM uint32_t PR1;                         /*!< Pending register                                                          */
    
    struct {
      __IOM uint32_t PIF0       : 1;            /*!< Pending bit 0                                                             */
      __IOM uint32_t PIF1       : 1;            /*!< Pending bit 1                                                             */
      __IOM uint32_t PIF2       : 1;            /*!< Pending bit 2                                                             */
      __IOM uint32_t PIF3       : 1;            /*!< Pending bit 3                                                             */
      __IOM uint32_t PIF4       : 1;            /*!< Pending bit 4                                                             */
      __IOM uint32_t PIF5       : 1;            /*!< Pending bit 5                                                             */
      __IOM uint32_t PIF6       : 1;            /*!< Pending bit 6                                                             */
      __IOM uint32_t PIF7       : 1;            /*!< Pending bit 7                                                             */
      __IOM uint32_t PIF8       : 1;            /*!< Pending bit 8                                                             */
      __IOM uint32_t PIF9       : 1;            /*!< Pending bit 9                                                             */
      __IOM uint32_t PIF10      : 1;            /*!< Pending bit 10                                                            */
      __IOM uint32_t PIF11      : 1;            /*!< Pending bit 11                                                            */
      __IOM uint32_t PIF12      : 1;            /*!< Pending bit 12                                                            */
      __IOM uint32_t PIF13      : 1;            /*!< Pending bit 13                                                            */
      __IOM uint32_t PIF14      : 1;            /*!< Pending bit 14                                                            */
      __IOM uint32_t PIF15      : 1;            /*!< Pending bit 15                                                            */
      __IOM uint32_t PIF16      : 1;            /*!< Pending bit 16                                                            */
      __IOM uint32_t PIF17      : 1;            /*!< Pending bit 17                                                            */
      __IOM uint32_t PIF18      : 1;            /*!< Pending bit 18                                                            */
      __IOM uint32_t PIF19      : 1;            /*!< Pending bit 19                                                            */
      __IOM uint32_t PIF20      : 1;            /*!< Pending bit 20                                                            */
      __IOM uint32_t PIF21      : 1;            /*!< Pending bit 21                                                            */
      __IOM uint32_t PIF22      : 1;            /*!< Pending bit 22                                                            */
            uint32_t            : 6;
      __IOM uint32_t PIF29      : 1;            /*!< Pending bit 29                                                            */
      __IOM uint32_t PIF30      : 1;            /*!< Pending bit 30                                                            */
      __IOM uint32_t PIF31      : 1;            /*!< Pending bit 31                                                            */
    } PR1_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t IMR2;                        /*!< Interrupt mask register                                                   */
    
