unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t IM32       : 1;            /*!< Interrupt Mask on external/internal line 32                               */
      __IOM uint32_t IM33       : 1;            /*!< Interrupt Mask on external/internal line 33                               */
      __IOM uint32_t IM34       : 1;            /*!< Interrupt Mask on external/internal line 34                               */
      __IOM uint32_t IM35       : 1;            /*!< Interrupt Mask on external/internal line 35                               */
      __IOM uint32_t IM36       : 1;            /*!< Interrupt Mask on external/internal line 36                               */
      __IOM uint32_t IM37       : 1;            /*!< Interrupt Mask on external/internal line 37                               */
      __IOM uint32_t IM38       : 1;            /*!< Interrupt Mask on external/internal line 38                               */
      __IOM uint32_t IM39       : 1;            /*!< Interrupt Mask on external/internal line 39                               */
      __IOM uint32_t IM40       : 1;            /*!< Interrupt Mask on external/internal line 40                               */
      __IOM uint32_t IM41       : 1;            /*!< Interrupt Mask on external/internal line 41                               */
      __IOM uint32_t IM42       : 1;            /*!< Interrupt Mask on external/internal line 42                               */
      __IOM uint32_t IM43       : 1;            /*!< Interrupt Mask on external/internal line 43                               */
            uint32_t            : 20;
    } IMR2_b;
  } ;
  
  union {
    __IOM uint32_t EMR2;                        /*!< Event mask register                                                       */
    
    struct {
      __IOM uint32_t EM32       : 1;            /*!< Event mask on external/internal line 32                                   */
      __IOM uint32_t EM33       : 1;            /*!< Event mask on external/internal line 33                                   */
      __IOM uint32_t EM34       : 1;            /*!< Event mask on external/internal line 34                                   */
      __IOM uint32_t EM35       : 1;            /*!< Event mask on external/internal line 35                                   */
      __IOM uint32_t EM36       : 1;            /*!< Event mask on external/internal line 36                                   */
      __IOM uint32_t EM37       : 1;            /*!< Event mask on external/internal line 37                                   */
      __IOM uint32_t EM38       : 1;            /*!< Event mask on external/internal line 38                                   */
      __IOM uint32_t EM39       : 1;            /*!< Event mask on external/internal line 39                                   */
      __IOM uint32_t EM40       : 1;            /*!< Event mask on external/internal line 40                                   */
            uint32_t            : 23;
    } EMR2_b;
  } ;
  
  union {
    __IOM uint32_t RTSR2;                       /*!< Rising Trigger selection register                                         */
    
    struct {
      __IOM uint32_t RT32       : 1;            /*!< Rising trigger event configuration bit of line 32                         */
      __IOM uint32_t RT33       : 1;            /*!< Rising trigger event configuration bit of line 32                         */
            uint32_t            : 4;
      __IOM uint32_t RT38       : 1;            /*!< Rising trigger event configuration bit of line 38                         */
      __IOM uint32_t RT39       : 1;            /*!< Rising trigger event configuration bit of line 39                         */
      __IOM uint32_t RT40       : 1;            /*!< Rising trigger event configuration bit of line 40                         */
      __IOM uint32_t RT41       : 1;            /*!< Rising trigger event configuration bit of line 41                         */
            uint32_t            : 22;
    } RTSR2_b;
  } ;
  
  union {
    __IOM uint32_t FTSR2;                       /*!< Falling Trigger selection register                                        */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t FT35       : 1;            /*!< Falling trigger event configuration bit of line 35                        */
      __IOM uint32_t FT36       : 1;            /*!< Falling trigger event configuration bit of line 36                        */
      __IOM uint32_t FT37       : 1;            /*!< Falling trigger event configuration bit of line 37                        */
      __IOM uint32_t FT38       : 1;            /*!< Falling trigger event configuration bit of line 38                        */
            uint32_t            : 25;
    } FTSR2_b;
  } ;
  
  union {
    __IOM uint32_t SWIER2;                      /*!< Software interrupt event register                                         */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t SWI35      : 1;            /*!< Software interrupt on line 35                                             */
      __IOM uint32_t SWI36      : 1;            /*!< Software interrupt on line 36                                             */
      __IOM uint32_t SWI37      : 1;            /*!< Software interrupt on line 37                                             */
      __IOM uint32_t SWI38      : 1;            /*!< Software interrupt on line 38                                             */
            uint32_t            : 25;
    } SWIER2_b;
  } ;
  
  union {
    __IOM uint32_t PR2;                         /*!< Pending register                                                          */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t PIF35      : 1;            /*!< Pending interrupt flag on line 35                                         */
      __IOM uint32_t PIF36      : 1;            /*!< Pending interrupt flag on line 36                                         */
      __IOM uint32_t PIF37      : 1;            /*!< Pending interrupt flag on line 37                                         */
      __IOM uint32_t PIF38      : 1;            /*!< Pending interrupt flag on line 38                                         */
            uint32_t            : 25;
    } PR2_b;
  } ;
} EXTI_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */
  
  union {
    __IOM uint32_t TR;                          /*!< time register                                                             */
    
