unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SU         : 4;            /*!< Second units in BCD format                                                */
      __IOM uint32_t ST         : 3;            /*!< Second tens in BCD format                                                 */
            uint32_t            : 1;
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD format                                                */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD format                                                 */
            uint32_t            : 1;
      __IOM uint32_t HU         : 4;            /*!< Hour units in BCD format                                                  */
      __IOM uint32_t HT         : 2;            /*!< Hour tens in BCD format                                                   */
      __IOM uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
            uint32_t            : 9;
    } TR_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< date register                                                             */
    
    struct {
      __IOM uint32_t DU         : 4;            /*!< Date units in BCD format                                                  */
      __IOM uint32_t DT         : 2;            /*!< Date tens in BCD format                                                   */
            uint32_t            : 2;
      __IOM uint32_t MU         : 4;            /*!< Month units in BCD format                                                 */
      __IOM uint32_t MT         : 1;            /*!< Month tens in BCD format                                                  */
      __IOM uint32_t WDU        : 3;            /*!< Week day units                                                            */
      __IOM uint32_t YU         : 4;            /*!< Year units in BCD format                                                  */
      __IOM uint32_t YT         : 4;            /*!< Year tens in BCD format                                                   */
            uint32_t            : 8;
    } DR_b;
  } ;
  
  union {
    __IM  uint32_t SSR;                         /*!< sub second register                                                       */
    
    struct {
      __IM  uint32_t SS         : 16;           /*!< Sub second value                                                          */
            uint32_t            : 16;
    } SSR_b;
  } ;
  
  union {
    __IOM uint32_t ICSR;                        /*!< initialization and status register                                        */
    
    struct {
      __IM  uint32_t ALRAWF     : 1;            /*!< Alarm A write flag                                                        */
      __IM  uint32_t ALRBWF     : 1;            /*!< Alarm B write flag                                                        */
      __IM  uint32_t WUTWF      : 1;            /*!< Wakeup timer write flag                                                   */
      __IOM uint32_t SHPF       : 1;            /*!< Shift operation pending                                                   */
      __IM  uint32_t INITS      : 1;            /*!< Initialization status flag                                                */
      __IOM uint32_t RSF        : 1;            /*!< Registers synchronization flag                                            */
      __IM  uint32_t INITF      : 1;            /*!< Initialization flag                                                       */
      __IOM uint32_t INIT       : 1;            /*!< Initialization mode                                                       */
            uint32_t            : 8;
      __IM  uint32_t RECALPF    : 1;            /*!< Recalibration pending Flag                                                */
            uint32_t            : 15;
    } ICSR_b;
  } ;
  
  union {
    __IOM uint32_t PRER;                        /*!< prescaler register                                                        */
    
    struct {
      __IOM uint32_t PREDIV_S   : 15;           /*!< Synchronous prescaler factor                                              */
            uint32_t            : 1;
      __IOM uint32_t PREDIV_A   : 7;            /*!< Asynchronous prescaler factor                                             */
            uint32_t            : 9;
    } PRER_b;
  } ;
  
  union {
    __IOM uint32_t WUTR;                        /*!< wakeup timer register                                                     */
    
    struct {
      __IOM uint32_t WUT        : 16;           /*!< Wakeup auto-reload value bits                                             */
            uint32_t            : 16;
    } WUTR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< control register                                                          */
    
    struct {
      __IOM uint32_t WCKSEL     : 3;            /*!< Wakeup clock selection                                                    */
      __IOM uint32_t TSEDGE     : 1;            /*!< Time-stamp event active edge                                              */
      __IOM uint32_t REFCKON    : 1;            /*!< Reference clock detection enable (50 or 60 Hz)                            */
      __IOM uint32_t BYPSHAD    : 1;            /*!< Bypass the shadow registers                                               */
      __IOM uint32_t FMT        : 1;            /*!< Hour format                                                               */
            uint32_t            : 1;
      __IOM uint32_t ALRAE      : 1;            /*!< Alarm A enable                                                            */
      __IOM uint32_t ALRBE      : 1;            /*!< Alarm B enable                                                            */
      __IOM uint32_t WUTE       : 1;            /*!< Wakeup timer enable                                                       */
      __IOM uint32_t TSE        : 1;            /*!< Time stamp enable                                                         */
      __IOM uint32_t ALRAIE     : 1;            /*!< Alarm A interrupt enable                                                  */
      __IOM uint32_t ALRBIE     : 1;            /*!< Alarm B interrupt enable                                                  */
      __IOM uint32_t WUTIE      : 1;            /*!< Wakeup timer interrupt enable                                             */
      __IOM uint32_t TSIE       : 1;            /*!< Time-stamp interrupt enable                                               */
      __IOM uint32_t ADD1H      : 1;            /*!< Add 1 hour (summer time change)                                           */
      __IOM uint32_t SUB1H      : 1;            /*!< Subtract 1 hour (winter time change)                                      */
      __IOM uint32_t BKP        : 1;            /*!< Backup                                                                    */
      __IOM uint32_t COSEL      : 1;            /*!< Calibration output selection                                              */
      __IOM uint32_t POL        : 1;            /*!< Output polarity                                                           */
      __IOM uint32_t OSEL       : 2;            /*!< Output selection                                                          */
      __IOM uint32_t COE        : 1;            /*!< Calibration output enable                                                 */
      __IOM uint32_t ITSE       : 1;            /*!< timestamp on internal event enable                                        */
      __IOM uint32_t TAMPTS     : 1;            /*!< TAMPTS                                                                    */
      __IOM uint32_t TAMPOE     : 1;            /*!< TAMPOE                                                                    */
            uint32_t            : 2;
      __IOM uint32_t TAMPALRM_PU : 1;           /*!< TAMPALRM_PU                                                               */
      __IOM uint32_t TAMPALRM_TYPE : 1;         /*!< TAMPALRM_TYPE                                                             */
      __IOM uint32_t OUT2EN     : 1;            /*!< OUT2EN                                                                    */
    } CR_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __OM  uint32_t WPR;                         /*!< write protection register                                                 */
    
