unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t KEY        : 8;            /*!< Write protection key                                                      */
            uint32_t            : 24;
    } WPR_b;
  } ;
  
  union {
    __IOM uint32_t CALR;                        /*!< calibration register                                                      */
    
    struct {
      __IOM uint32_t CALM       : 9;            /*!< Calibration minus                                                         */
            uint32_t            : 4;
      __IOM uint32_t CALW16     : 1;            /*!< Use a 16-second calibration cycle period                                  */
      __IOM uint32_t CALW8      : 1;            /*!< Use an 8-second calibration cycle period                                  */
      __IOM uint32_t CALP       : 1;            /*!< Increase frequency of RTC by 488.5 ppm                                    */
            uint32_t            : 16;
    } CALR_b;
  } ;
  
  union {
    __OM  uint32_t SHIFTR;                      /*!< shift control register                                                    */
    
    struct {
      __OM  uint32_t SUBFS      : 15;           /*!< Subtract a fraction of a second                                           */
            uint32_t            : 16;
      __OM  uint32_t ADD1S      : 1;            /*!< Add one second                                                            */
    } SHIFTR_b;
  } ;
  
  union {
    __IM  uint32_t TSTR;                        /*!< time stamp time register                                                  */
    
    struct {
      __IM  uint32_t SU         : 4;            /*!< Second units in BCD format                                                */
      __IM  uint32_t ST         : 3;            /*!< Second tens in BCD format                                                 */
            uint32_t            : 1;
      __IM  uint32_t MNU        : 4;            /*!< Minute units in BCD format                                                */
      __IM  uint32_t MNT        : 3;            /*!< Minute tens in BCD format                                                 */
            uint32_t            : 1;
      __IM  uint32_t HU         : 4;            /*!< Hour units in BCD format                                                  */
      __IM  uint32_t HT         : 2;            /*!< Hour tens in BCD format                                                   */
      __IM  uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
            uint32_t            : 9;
    } TSTR_b;
  } ;
  
  union {
    __IM  uint32_t TSDR;                        /*!< time stamp date register                                                  */
    
    struct {
      __IM  uint32_t DU         : 4;            /*!< Date units in BCD format                                                  */
      __IM  uint32_t DT         : 2;            /*!< Date tens in BCD format                                                   */
            uint32_t            : 2;
      __IM  uint32_t MU         : 4;            /*!< Month units in BCD format                                                 */
      __IM  uint32_t MT         : 1;            /*!< Month tens in BCD format                                                  */
      __IM  uint32_t WDU        : 3;            /*!< Week day units                                                            */
            uint32_t            : 16;
    } TSDR_b;
  } ;
  
  union {
    __IM  uint32_t TSSSR;                       /*!< timestamp sub second register                                             */
    
    struct {
      __IM  uint32_t SS         : 16;           /*!< Sub second value                                                          */
            uint32_t            : 16;
    } TSSSR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t ALRMAR;                      /*!< alarm A register                                                          */
    
    struct {
      __IOM uint32_t SU         : 4;            /*!< Second units in BCD format                                                */
      __IOM uint32_t ST         : 3;            /*!< Second tens in BCD format                                                 */
      __IOM uint32_t MSK1       : 1;            /*!< Alarm A seconds mask                                                      */
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD format                                                */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD format                                                 */
      __IOM uint32_t MSK2       : 1;            /*!< Alarm A minutes mask                                                      */
      __IOM uint32_t HU         : 4;            /*!< Hour units in BCD format                                                  */
      __IOM uint32_t HT         : 2;            /*!< Hour tens in BCD format                                                   */
      __IOM uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
      __IOM uint32_t MSK3       : 1;            /*!< Alarm A hours mask                                                        */
      __IOM uint32_t DU         : 4;            /*!< Date units or day in BCD format                                           */
      __IOM uint32_t DT         : 2;            /*!< Date tens in BCD format                                                   */
      __IOM uint32_t WDSEL      : 1;            /*!< Week day selection                                                        */
      __IOM uint32_t MSK4       : 1;            /*!< Alarm A date mask                                                         */
    } ALRMAR_b;
  } ;
  
  union {
    __IOM uint32_t ALRMASSR;                    /*!< alarm A sub second register                                               */
    
