unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SS         : 15;           /*!< Sub seconds value                                                         */
            uint32_t            : 9;
      __IOM uint32_t MASKSS     : 4;            /*!< Mask the most-significant bits starting at this bit                       */
            uint32_t            : 4;
    } ALRMASSR_b;
  } ;
  
  union {
    __IOM uint32_t ALRMBR;                      /*!< alarm B register                                                          */
    
    struct {
      __IOM uint32_t SU         : 4;            /*!< Second units in BCD format                                                */
      __IOM uint32_t ST         : 3;            /*!< Second tens in BCD format                                                 */
      __IOM uint32_t MSK1       : 1;            /*!< Alarm B seconds mask                                                      */
      __IOM uint32_t MNU        : 4;            /*!< Minute units in BCD format                                                */
      __IOM uint32_t MNT        : 3;            /*!< Minute tens in BCD format                                                 */
      __IOM uint32_t MSK2       : 1;            /*!< Alarm B minutes mask                                                      */
      __IOM uint32_t HU         : 4;            /*!< Hour units in BCD format                                                  */
      __IOM uint32_t HT         : 2;            /*!< Hour tens in BCD format                                                   */
      __IOM uint32_t PM         : 1;            /*!< AM/PM notation                                                            */
      __IOM uint32_t MSK3       : 1;            /*!< Alarm B hours mask                                                        */
      __IOM uint32_t DU         : 4;            /*!< Date units or day in BCD format                                           */
      __IOM uint32_t DT         : 2;            /*!< Date tens in BCD format                                                   */
      __IOM uint32_t WDSEL      : 1;            /*!< Week day selection                                                        */
      __IOM uint32_t MSK4       : 1;            /*!< Alarm B date mask                                                         */
    } ALRMBR_b;
  } ;
  
  union {
    __IOM uint32_t ALRMBSSR;                    /*!< alarm B sub second register                                               */
    
    struct {
      __IOM uint32_t SS         : 15;           /*!< Sub seconds value                                                         */
            uint32_t            : 9;
      __IOM uint32_t MASKSS     : 4;            /*!< Mask the most-significant bits starting at this bit                       */
            uint32_t            : 4;
    } ALRMBSSR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IM  uint32_t ALRAF      : 1;            /*!< ALRAF                                                                     */
      __IM  uint32_t ALRBF      : 1;            /*!< ALRBF                                                                     */
      __IM  uint32_t WUTF       : 1;            /*!< WUTF                                                                      */
      __IM  uint32_t TSF        : 1;            /*!< TSF                                                                       */
      __IM  uint32_t TSOVF      : 1;            /*!< TSOVF                                                                     */
      __IM  uint32_t ITSF       : 1;            /*!< ITSF                                                                      */
            uint32_t            : 26;
    } SR_b;
  } ;
  
  union {
    __IM  uint32_t MISR;                        /*!< status register                                                           */
    
    struct {
      __IM  uint32_t ALRAMF     : 1;            /*!< ALRAMF                                                                    */
      __IM  uint32_t ALRBMF     : 1;            /*!< ALRBMF                                                                    */
      __IM  uint32_t WUTMF      : 1;            /*!< WUTMF                                                                     */
      __IM  uint32_t TSMF       : 1;            /*!< TSMF                                                                      */
      __IM  uint32_t TSOVMF     : 1;            /*!< TSOVMF                                                                    */
      __IM  uint32_t ITSMF      : 1;            /*!< ITSMF                                                                     */
            uint32_t            : 26;
    } MISR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __OM  uint32_t SCR;                         /*!< status register                                                           */
    
    struct {
      __OM  uint32_t CALRAF     : 1;            /*!< CALRAF                                                                    */
      __OM  uint32_t CALRBF     : 1;            /*!< CALRBF                                                                    */
      __OM  uint32_t CWUTF      : 1;            /*!< CWUTF                                                                     */
      __OM  uint32_t CTSF       : 1;            /*!< CTSF                                                                      */
      __OM  uint32_t CTSOVF     : 1;            /*!< CTSOVF                                                                    */
      __OM  uint32_t CITSF      : 1;            /*!< CITSF                                                                     */
            uint32_t            : 26;
    } SCR_b;
  } ;
} RTC_Type;                                     /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                            FMC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Flexible memory controller (FMC)
  */

