unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
      __IOM uint32_t CLKDIV     : 4;            /*!< CLKDIV                                                                    */
      __IOM uint32_t DATLAT     : 4;            /*!< DATLAT                                                                    */
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BTR2_b;
  } ;
  
  union {
    __IOM uint32_t BCR3;                        /*!< SRAM/NOR-Flash chip-select control register 3                             */
    
    struct {
      __IOM uint32_t MBKEN      : 1;            /*!< MBKEN                                                                     */
      __IOM uint32_t MUXEN      : 1;            /*!< MUXEN                                                                     */
      __IOM uint32_t MTYP       : 2;            /*!< MTYP                                                                      */
      __IOM uint32_t MWID       : 2;            /*!< MWID                                                                      */
      __IOM uint32_t FACCEN     : 1;            /*!< FACCEN                                                                    */
            uint32_t            : 1;
      __IOM uint32_t BURSTEN    : 1;            /*!< BURSTEN                                                                   */
      __IOM uint32_t WAITPOL    : 1;            /*!< WAITPOL                                                                   */
            uint32_t            : 1;
      __IOM uint32_t WAITCFG    : 1;            /*!< WAITCFG                                                                   */
      __IOM uint32_t WREN       : 1;            /*!< WREN                                                                      */
      __IOM uint32_t WAITEN     : 1;            /*!< WAITEN                                                                    */
      __IOM uint32_t EXTMOD     : 1;            /*!< EXTMOD                                                                    */
      __IOM uint32_t ASYNCWAIT  : 1;            /*!< ASYNCWAIT                                                                 */
      __IOM uint32_t CPSIZE     : 3;            /*!< CPSIZE                                                                    */
      __IOM uint32_t CBURSTRW   : 1;            /*!< CBURSTRW                                                                  */
      __IOM uint32_t CCLKEN     : 1;            /*!< CCLKEN                                                                    */
      __IOM uint32_t WFDIS      : 1;            /*!< WFDIS                                                                     */
      __IOM uint32_t NBLSET     : 2;            /*!< NBLSET                                                                    */
            uint32_t            : 8;
    } BCR3_b;
  } ;
  
  union {
    __IOM uint32_t BTR3;                        /*!< SRAM/NOR-Flash chip-select timing register 3                              */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
      __IOM uint32_t CLKDIV     : 4;            /*!< CLKDIV                                                                    */
      __IOM uint32_t DATLAT     : 4;            /*!< DATLAT                                                                    */
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BTR3_b;
  } ;
  
  union {
    __IOM uint32_t BCR4;                        /*!< SRAM/NOR-Flash chip-select control register 4                             */
    
    struct {
      __IOM uint32_t MBKEN      : 1;            /*!< MBKEN                                                                     */
      __IOM uint32_t MUXEN      : 1;            /*!< MUXEN                                                                     */
      __IOM uint32_t MTYP       : 2;            /*!< MTYP                                                                      */
      __IOM uint32_t MWID       : 2;            /*!< MWID                                                                      */
      __IOM uint32_t FACCEN     : 1;            /*!< FACCEN                                                                    */
            uint32_t            : 1;
      __IOM uint32_t BURSTEN    : 1;            /*!< BURSTEN                                                                   */
      __IOM uint32_t WAITPOL    : 1;            /*!< WAITPOL                                                                   */
            uint32_t            : 1;
      __IOM uint32_t WAITCFG    : 1;            /*!< WAITCFG                                                                   */
      __IOM uint32_t WREN       : 1;            /*!< WREN                                                                      */
      __IOM uint32_t WAITEN     : 1;            /*!< WAITEN                                                                    */
      __IOM uint32_t EXTMOD     : 1;            /*!< EXTMOD                                                                    */
      __IOM uint32_t ASYNCWAIT  : 1;            /*!< ASYNCWAIT                                                                 */
      __IOM uint32_t CPSIZE     : 3;            /*!< CPSIZE                                                                    */
      __IOM uint32_t CBURSTRW   : 1;            /*!< CBURSTRW                                                                  */
      __IOM uint32_t CCLKEN     : 1;            /*!< CCLKEN                                                                    */
      __IOM uint32_t WFDIS      : 1;            /*!< WFDIS                                                                     */
      __IOM uint32_t NBLSET     : 2;            /*!< NBLSET                                                                    */
            uint32_t            : 8;
    } BCR4_b;
  } ;
  
  union {
    __IOM uint32_t BTR4;                        /*!< SRAM/NOR-Flash chip-select timing register 4                              */
    
