unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
      __IOM uint32_t CLKDIV     : 4;            /*!< CLKDIV                                                                    */
      __IOM uint32_t DATLAT     : 4;            /*!< DATLAT                                                                    */
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BTR4_b;
  } ;
  
  union {
    __IOM uint32_t PCSCNTR;                     /*!< PSRAM chip select counter register                                        */
    
    struct {
      __IOM uint32_t CSCOUNT    : 16;           /*!< CSCOUNT                                                                   */
      __IOM uint32_t CNTB1EN    : 1;            /*!< CNTB1EN                                                                   */
      __IOM uint32_t CNTB2EN    : 1;            /*!< CNTB2EN                                                                   */
      __IOM uint32_t CNTB3EN    : 1;            /*!< CNTB3EN                                                                   */
      __IOM uint32_t CNTB4EN    : 1;            /*!< CNTB4EN                                                                   */
            uint32_t            : 12;
    } PCSCNTR_b;
  } ;
  __IM  uint32_t  RESERVED[23];
  
  union {
    __IOM uint32_t PCR;                         /*!< PC Card/NAND Flash control register 3                                     */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t PWAITEN    : 1;            /*!< PWAITEN                                                                   */
      __IOM uint32_t PBKEN      : 1;            /*!< PBKEN                                                                     */
      __IOM uint32_t PTYP       : 1;            /*!< PTYP                                                                      */
      __IOM uint32_t PWID       : 2;            /*!< PWID                                                                      */
      __IOM uint32_t ECCEN      : 1;            /*!< ECCEN                                                                     */
            uint32_t            : 2;
      __IOM uint32_t TCLR       : 4;            /*!< TCLR                                                                      */
      __IOM uint32_t TAR        : 4;            /*!< TAR                                                                       */
      __IOM uint32_t ECCPS      : 3;            /*!< ECCPS                                                                     */
            uint32_t            : 12;
    } PCR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< FIFO status and interrupt register 3                                      */
    
    struct {
      __IOM uint32_t IRS        : 1;            /*!< IRS                                                                       */
      __IOM uint32_t ILS        : 1;            /*!< ILS                                                                       */
      __IOM uint32_t IFS        : 1;            /*!< IFS                                                                       */
      __IOM uint32_t IREN       : 1;            /*!< IREN                                                                      */
      __IOM uint32_t ILEN       : 1;            /*!< ILEN                                                                      */
      __IOM uint32_t IFEN       : 1;            /*!< IFEN                                                                      */
      __IM  uint32_t FEMPT      : 1;            /*!< FEMPT                                                                     */
            uint32_t            : 25;
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t PMEM;                        /*!< Common memory space timing register 3                                     */
    
    struct {
      __IOM uint32_t MEMSETx    : 8;            /*!< MEMSETx                                                                   */
      __IOM uint32_t MEMWAITx   : 8;            /*!< MEMWAITx                                                                  */
      __IOM uint32_t MEMHOLDx   : 8;            /*!< MEMHOLDx                                                                  */
      __IOM uint32_t MEMHIZx    : 8;            /*!< MEMHIZx                                                                   */
    } PMEM_b;
  } ;
  
  union {
    __IOM uint32_t PATT;                        /*!< Attribute memory space timing register 3                                  */
    
    struct {
      __IOM uint32_t ATTSETx    : 8;            /*!< ATTSETx                                                                   */
      __IOM uint32_t ATTWAITx   : 8;            /*!< ATTWAITx                                                                  */
      __IOM uint32_t ATTHOLDx   : 8;            /*!< ATTHOLDx                                                                  */
      __IOM uint32_t ATTHIZx    : 8;            /*!< ATTHIZx                                                                   */
    } PATT_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t ECCR;                        /*!< ECC result register 3                                                     */
    
