unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t ECCx       : 32;           /*!< ECCx                                                                      */
    } ECCR_b;
  } ;
  __IM  uint32_t  RESERVED2[27];
  
  union {
    __IOM uint32_t BWTR1;                       /*!< SRAM/NOR-Flash write timing registers 1                                   */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
            uint32_t            : 8;
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BWTR1_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t BWTR2;                       /*!< SRAM/NOR-Flash write timing registers 2                                   */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
            uint32_t            : 8;
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BWTR2_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t BWTR3;                       /*!< SRAM/NOR-Flash write timing registers 3                                   */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
            uint32_t            : 8;
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BWTR3_b;
  } ;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t BWTR4;                       /*!< SRAM/NOR-Flash write timing registers 4                                   */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< ADDSET                                                                    */
      __IOM uint32_t ADDHLD     : 4;            /*!< ADDHLD                                                                    */
      __IOM uint32_t DATAST     : 8;            /*!< DATAST                                                                    */
      __IOM uint32_t BUSTURN    : 4;            /*!< BUSTURN                                                                   */
            uint32_t            : 8;
      __IOM uint32_t ACCMOD     : 2;            /*!< ACCMOD                                                                    */
      __IOM uint32_t DATAHLD    : 2;            /*!< DATAHLD                                                                   */
    } BWTR4_b;
  } ;
} FMC_Type;                                     /*!< Size = 288 (0x120)                                                        */



/* =========================================================================================================================== */
/* ================                                           DMA1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA1)
  */

typedef struct {                                /*!< DMA1 Structure                                                            */
  
  union {
    __IM  uint32_t ISR;                         /*!< interrupt status register                                                 */
    
    struct {
      __IM  uint32_t GIF1       : 1;            /*!< GIF1                                                                      */
      __IM  uint32_t TCIF1      : 1;            /*!< TCIF1                                                                     */
      __IM  uint32_t HTIF1      : 1;            /*!< HTIF1                                                                     */
      __IM  uint32_t TEIF1      : 1;            /*!< TEIF1                                                                     */
      __IM  uint32_t GIF2       : 1;            /*!< GIF2                                                                      */
      __IM  uint32_t TCIF2      : 1;            /*!< TCIF2                                                                     */
      __IM  uint32_t HTIF2      : 1;            /*!< HTIF2                                                                     */
      __IM  uint32_t TEIF2      : 1;            /*!< TEIF2                                                                     */
      __IM  uint32_t GIF3       : 1;            /*!< GIF3                                                                      */
      __IM  uint32_t TCIF3      : 1;            /*!< TCIF3                                                                     */
      __IM  uint32_t HTIF3      : 1;            /*!< HTIF3                                                                     */
      __IM  uint32_t TEIF3      : 1;            /*!< TEIF3                                                                     */
      __IM  uint32_t GIF4       : 1;            /*!< GIF4                                                                      */
      __IM  uint32_t TCIF4      : 1;            /*!< TCIF4                                                                     */
      __IM  uint32_t HTIF4      : 1;            /*!< HTIF4                                                                     */
      __IM  uint32_t TEIF4      : 1;            /*!< TEIF4                                                                     */
      __IM  uint32_t GIF5       : 1;            /*!< GIF5                                                                      */
      __IM  uint32_t TCIF5      : 1;            /*!< TCIF5                                                                     */
      __IM  uint32_t HTIF5      : 1;            /*!< HTIF5                                                                     */
      __IM  uint32_t TEIF5      : 1;            /*!< TEIF5                                                                     */
      __IM  uint32_t GIF6       : 1;            /*!< GIF6                                                                      */
      __IM  uint32_t TCIF6      : 1;            /*!< TCIF6                                                                     */
      __IM  uint32_t HTIF6      : 1;            /*!< HTIF6                                                                     */
      __IM  uint32_t TEIF6      : 1;            /*!< TEIF6                                                                     */
      __IM  uint32_t GIF7       : 1;            /*!< GIF7                                                                      */
      __IM  uint32_t TCIF7      : 1;            /*!< TCIF7                                                                     */
      __IM  uint32_t HTIF7      : 1;            /*!< HTIF7                                                                     */
      __IM  uint32_t TEIF7      : 1;            /*!< TEIF7                                                                     */
      __IM  uint32_t GIF8       : 1;            /*!< GIF8                                                                      */
      __IM  uint32_t TCIF8      : 1;            /*!< TCIF8                                                                     */
      __IM  uint32_t HTIF8      : 1;            /*!< HTIF8                                                                     */
      __IM  uint32_t TEIF8      : 1;            /*!< TEIF8                                                                     */
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t IFCR;                        /*!< DMA interrupt flag clear register                                         */
    
