unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t GIF1       : 1;            /*!< GIF1                                                                      */
      __OM  uint32_t TCIF1      : 1;            /*!< TCIF1                                                                     */
      __OM  uint32_t HTIF1      : 1;            /*!< HTIF1                                                                     */
      __OM  uint32_t TEIF1      : 1;            /*!< TEIF1                                                                     */
      __OM  uint32_t GIF2       : 1;            /*!< GIF2                                                                      */
      __OM  uint32_t TCIF2      : 1;            /*!< TCIF2                                                                     */
      __OM  uint32_t HTIF2      : 1;            /*!< HTIF2                                                                     */
      __OM  uint32_t TEIF2      : 1;            /*!< TEIF2                                                                     */
      __OM  uint32_t GIF3       : 1;            /*!< GIF3                                                                      */
      __OM  uint32_t TCIF3      : 1;            /*!< TCIF3                                                                     */
      __OM  uint32_t HTIF3      : 1;            /*!< HTIF3                                                                     */
      __OM  uint32_t TEIF3      : 1;            /*!< TEIF3                                                                     */
      __OM  uint32_t GIF4       : 1;            /*!< GIF4                                                                      */
      __OM  uint32_t TCIF4      : 1;            /*!< TCIF4                                                                     */
      __OM  uint32_t HTIF4      : 1;            /*!< HTIF4                                                                     */
      __OM  uint32_t TEIF4      : 1;            /*!< TEIF4                                                                     */
      __OM  uint32_t GIF5       : 1;            /*!< GIF5                                                                      */
      __OM  uint32_t TCIF5      : 1;            /*!< TCIF5                                                                     */
      __OM  uint32_t HTIF5      : 1;            /*!< HTIF5                                                                     */
      __OM  uint32_t TEIF5      : 1;            /*!< TEIF5                                                                     */
      __OM  uint32_t GIF6       : 1;            /*!< GIF6                                                                      */
      __OM  uint32_t TCIF6      : 1;            /*!< TCIF6                                                                     */
      __OM  uint32_t HTIF6      : 1;            /*!< HTIF6                                                                     */
      __OM  uint32_t TEIF6      : 1;            /*!< TEIF6                                                                     */
      __OM  uint32_t GIF7       : 1;            /*!< GIF7                                                                      */
      __OM  uint32_t TCIF7      : 1;            /*!< TCIF7                                                                     */
      __OM  uint32_t HTIF7      : 1;            /*!< HTIF7                                                                     */
      __OM  uint32_t TEIF7      : 1;            /*!< TEIF7                                                                     */
      __OM  uint32_t GIF8       : 1;            /*!< GIF8                                                                      */
      __OM  uint32_t TCIF8      : 1;            /*!< TCIF8                                                                     */
      __OM  uint32_t HTIF8      : 1;            /*!< HTIF8                                                                     */
      __OM  uint32_t TEIF8      : 1;            /*!< TEIF8                                                                     */
    } IFCR_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< DMA channel 1 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR1_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR1;                      /*!< channel x number of data to transfer register                             */
    
