unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR1_b;
  } ;
  
  union {
    __IOM uint32_t CPAR1;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR1_b;
  } ;
  
  union {
    __IOM uint32_t CMAR1;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR1_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CCR2;                        /*!< DMA channel 2 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR2_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR2;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR2_b;
  } ;
  
  union {
    __IOM uint32_t CPAR2;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR2_b;
  } ;
  
  union {
    __IOM uint32_t CMAR2;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR2_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t CCR3;                        /*!< DMA channel 3 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR3_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR3;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR3_b;
  } ;
  
  union {
    __IOM uint32_t CPAR3;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR3_b;
  } ;
  
  union {
    __IOM uint32_t CMAR3;                       /*!< DMA channel x memory address register                                     */
    
