unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR3_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t CCR4;                        /*!< DMA channel 3 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR4_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR4;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR4_b;
  } ;
  
  union {
    __IOM uint32_t CPAR4;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR4_b;
  } ;
  
  union {
    __IOM uint32_t CMAR4;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR4_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t CCR5;                        /*!< DMA channel 4 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR5_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR5;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR5_b;
  } ;
  
  union {
    __IOM uint32_t CPAR5;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR5_b;
  } ;
  
  union {
    __IOM uint32_t CMAR5;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR5_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t CCR6;                        /*!< DMA channel 5 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR6_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR6;                      /*!< channel x number of data to transfer register                             */
    
