unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR6_b;
  } ;
  
  union {
    __IOM uint32_t CPAR6;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR6_b;
  } ;
  
  union {
    __IOM uint32_t CMAR6;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR6_b;
  } ;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t CCR7;                        /*!< DMA channel 6 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR7_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR7;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR7_b;
  } ;
  
  union {
    __IOM uint32_t CPAR7;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR7_b;
  } ;
  
  union {
    __IOM uint32_t CMAR7;                       /*!< DMA channel x memory address register                                     */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR7_b;
  } ;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t CCR8;                        /*!< DMA channel 7 configuration register                                      */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< channel enable                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< TCIE                                                                      */
      __IOM uint32_t HTIE       : 1;            /*!< HTIE                                                                      */
      __IOM uint32_t TEIE       : 1;            /*!< TEIE                                                                      */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
      __IOM uint32_t CIRC       : 1;            /*!< CIRC                                                                      */
      __IOM uint32_t PINC       : 1;            /*!< PINC                                                                      */
      __IOM uint32_t MINC       : 1;            /*!< MINC                                                                      */
      __IOM uint32_t PSIZE      : 2;            /*!< PSIZE                                                                     */
      __IOM uint32_t MSIZE      : 2;            /*!< MSIZE                                                                     */
      __IOM uint32_t PL         : 2;            /*!< PL                                                                        */
      __IOM uint32_t MEM2MEM    : 1;            /*!< MEM2MEM                                                                   */
            uint32_t            : 17;
    } CCR8_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR8;                      /*!< channel x number of data to transfer register                             */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< Number of data items to transfer                                          */
            uint32_t            : 16;
    } CNDTR8_b;
  } ;
  
  union {
    __IOM uint32_t CPAR8;                       /*!< DMA channel x peripheral address register                                 */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< Peripheral address                                                        */
    } CPAR8_b;
  } ;
  
  union {
    __IOM uint32_t CMAR8;                       /*!< DMA channel x memory address register                                     */
    
