unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t MA         : 32;           /*!< Memory 1 address (used in case of Double buffer mode)                     */
    } CMAR8_b;
  } ;
} DMA1_Type;                                    /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief DMAMUX (DMAMUX)
  */

typedef struct {                                /*!< DMAMUX Structure                                                          */
  
  union {
    __IOM uint32_t C0CR;                        /*!< DMAMux - DMA request line multiplexer channel x control register          */
    
    struct {
      __IOM uint32_t DMAREQ_ID  : 7;            /*!< Input DMA request line selected                                           */
            uint32_t            : 1;
      __IOM uint32_t SOIE       : 1;            /*!< Interrupt enable at synchronization event overrun                         */
      __IOM uint32_t EGE        : 1;            /*!< Event generation enable/disable                                           */
            uint32_t            : 6;
      __IOM uint32_t SE         : 1;            /*!< Synchronous operating mode enable/disable                                 */
      __IOM uint32_t SPOL       : 2;            /*!< Synchronization event type selector Defines the synchronization
                                                     event on the selected synchronization input:                              */
      __IOM uint32_t NBREQ      : 5;            /*!< Number of DMA requests to forward Defines the number of DMA
                                                     requests forwarded before output event is generated. In
                                                     synchronous mode, it also defines the number of DMA requests
                                                     to forward after a synchronization event, then stop forwarding.
                                                     The actual number of DMA requests forwarded is NBREQ+1.
                                                     Note: This field can only be written when both SE and EGE
                                                     bits are reset.                                                           */
      __IOM uint32_t SYNC_ID    : 5;            /*!< Synchronization input selected                                            */
            uint32_t            : 3;
    } C0CR_b;
  } ;
  
  union {
    __IOM uint32_t C1CR;                        /*!< DMAMux - DMA request line multiplexer channel x control register          */
    
    struct {
      __IOM uint32_t DMAREQ_ID  : 7;            /*!< Input DMA request line selected                                           */
            uint32_t            : 1;
      __IOM uint32_t SOIE       : 1;            /*!< Interrupt enable at synchronization event overrun                         */
      __IOM uint32_t EGE        : 1;            /*!< Event generation enable/disable                                           */
            uint32_t            : 6;
      __IOM uint32_t SE         : 1;            /*!< Synchronous operating mode enable/disable                                 */
      __IOM uint32_t SPOL       : 2;            /*!< Synchronization event type selector Defines the synchronization
                                                     event on the selected synchronization input:                              */
      __IOM uint32_t NBREQ      : 5;            /*!< Number of DMA requests to forward Defines the number of DMA
                                                     requests forwarded before output event is generated. In
                                                     synchronous mode, it also defines the number of DMA requests
                                                     to forward after a synchronization event, then stop forwarding.
                                                     The actual number of DMA requests forwarded is NBREQ+1.
                                                     Note: This field can only be written when both SE and EGE
                                                     bits are reset.                                                           */
      __IOM uint32_t SYNC_ID    : 5;            /*!< Synchronization input selected                                            */
            uint32_t            : 3;
    } C1CR_b;
  } ;
  
  union {
    __IOM uint32_t C2CR;                        /*!< DMAMux - DMA request line multiplexer channel x control register          */
    
    struct {
      __IOM uint32_t DMAREQ_ID  : 7;            /*!< Input DMA request line selected                                           */
            uint32_t            : 1;
      __IOM uint32_t SOIE       : 1;            /*!< Interrupt enable at synchronization event overrun                         */
      __IOM uint32_t EGE        : 1;            /*!< Event generation enable/disable                                           */
            uint32_t            : 6;
      __IOM uint32_t SE         : 1;            /*!< Synchronous operating mode enable/disable                                 */
      __IOM uint32_t SPOL       : 2;            /*!< Synchronization event type selector Defines the synchronization
                                                     event on the selected synchronization input:                              */
      __IOM uint32_t NBREQ      : 5;            /*!< Number of DMA requests to forward Defines the number of DMA
                                                     requests forwarded before output event is generated. In
                                                     synchronous mode, it also defines the number of DMA requests
                                                     to forward after a synchronization event, then stop forwarding.
                                                     The actual number of DMA requests forwarded is NBREQ+1.
                                                     Note: This field can only be written when both SE and EGE
                                                     bits are reset.                                                           */
      __IOM uint32_t SYNC_ID    : 5;            /*!< Synchronization input selected                                            */
            uint32_t            : 3;
    } C2CR_b;
  } ;
  
  union {
    __IOM uint32_t C3CR;                        /*!< DMAMux - DMA request line multiplexer channel x control register          */
    
