unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DMAREQ_ID  : 7;            /*!< Input DMA request line selected                                           */
            uint32_t            : 1;
      __IOM uint32_t SOIE       : 1;            /*!< Interrupt enable at synchronization event overrun                         */
      __IOM uint32_t EGE        : 1;            /*!< Event generation enable/disable                                           */
            uint32_t            : 6;
      __IOM uint32_t SE         : 1;            /*!< Synchronous operating mode enable/disable                                 */
      __IOM uint32_t SPOL       : 2;            /*!< Synchronization event type selector Defines the synchronization
                                                     event on the selected synchronization input:                              */
      __IOM uint32_t NBREQ      : 5;            /*!< Number of DMA requests to forward Defines the number of DMA
                                                     requests forwarded before output event is generated. In
                                                     synchronous mode, it also defines the number of DMA requests
                                                     to forward after a synchronization event, then stop forwarding.
                                                     The actual number of DMA requests forwarded is NBREQ+1.
                                                     Note: This field can only be written when both SE and EGE
                                                     bits are reset.                                                           */
      __IOM uint32_t SYNC_ID    : 5;            /*!< Synchronization input selected                                            */
            uint32_t            : 3;
    } C15CR_b;
  } ;
  __IM  uint32_t  RESERVED[16];
  
  union {
    __IM  uint32_t CSR;                         /*!< DMAMUX request line multiplexer interrupt channel status register         */
    
    struct {
      __IM  uint32_t SOF        : 16;           /*!< Synchronization overrun event flag                                        */
            uint32_t            : 16;
    } CSR_b;
  } ;
  
  union {
    __OM  uint32_t CFR;                         /*!< DMAMUX request line multiplexer interrupt clear flag register             */
    
    struct {
      __OM  uint32_t CSOF       : 16;           /*!< Clear synchronization overrun event flag                                  */
            uint32_t            : 16;
    } CFR_b;
  } ;
  __IM  uint32_t  RESERVED1[30];
  
  union {
    __IOM uint32_t RG0CR;                       /*!< DMAMux - DMA request generator channel x control register                 */
    
    struct {
      __IOM uint32_t SIG_ID     : 5;            /*!< DMA request trigger input selected                                        */
            uint32_t            : 3;
      __IOM uint32_t OIE        : 1;            /*!< Interrupt enable at trigger event overrun                                 */
            uint32_t            : 7;
      __IOM uint32_t GE         : 1;            /*!< DMA request generator channel enable/disable                              */
      __IOM uint32_t GPOL       : 2;            /*!< DMA request generator trigger event type selection Defines the
                                                     trigger event on the selected DMA request trigger input                   */
      __IOM uint32_t GNBREQ     : 5;            /*!< Number of DMA requests to generate Defines the number of DMA
                                                     requests generated after a trigger event, then stop generating.
                                                     The actual number of generated DMA requests is GNBREQ+1.
                                                     Note: This field can only be written when GE bit is reset.                */
            uint32_t            : 8;
    } RG0CR_b;
  } ;
  
  union {
    __IOM uint32_t RG1CR;                       /*!< DMAMux - DMA request generator channel x control register                 */
    
    struct {
      __IOM uint32_t SIG_ID     : 5;            /*!< DMA request trigger input selected                                        */
            uint32_t            : 3;
      __IOM uint32_t OIE        : 1;            /*!< Interrupt enable at trigger event overrun                                 */
            uint32_t            : 7;
      __IOM uint32_t GE         : 1;            /*!< DMA request generator channel enable/disable                              */
      __IOM uint32_t GPOL       : 2;            /*!< DMA request generator trigger event type selection Defines the
                                                     trigger event on the selected DMA request trigger input                   */
      __IOM uint32_t GNBREQ     : 5;            /*!< Number of DMA requests to generate Defines the number of DMA
                                                     requests generated after a trigger event, then stop generating.
                                                     The actual number of generated DMA requests is GNBREQ+1.
                                                     Note: This field can only be written when GE bit is reset.                */
            uint32_t            : 8;
    } RG1CR_b;
  } ;
  
  union {
    __IOM uint32_t RG2CR;                       /*!< DMAMux - DMA request generator channel x control register                 */
    
    struct {
      __IOM uint32_t SIG_ID     : 5;            /*!< DMA request trigger input selected                                        */
            uint32_t            : 3;
      __IOM uint32_t OIE        : 1;            /*!< Interrupt enable at trigger event overrun                                 */
            uint32_t            : 7;
      __IOM uint32_t GE         : 1;            /*!< DMA request generator channel enable/disable                              */
      __IOM uint32_t GPOL       : 2;            /*!< DMA request generator trigger event type selection Defines the
                                                     trigger event on the selected DMA request trigger input                   */
      __IOM uint32_t GNBREQ     : 5;            /*!< Number of DMA requests to generate Defines the number of DMA
                                                     requests generated after a trigger event, then stop generating.
                                                     The actual number of generated DMA requests is GNBREQ+1.
                                                     Note: This field can only be written when GE bit is reset.                */
            uint32_t            : 8;
    } RG2CR_b;
  } ;
  
  union {
    __IOM uint32_t RG3CR;                       /*!< DMAMux - DMA request generator channel x control register                 */
    
