unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SIG_ID     : 5;            /*!< DMA request trigger input selected                                        */
            uint32_t            : 3;
      __IOM uint32_t OIE        : 1;            /*!< Interrupt enable at trigger event overrun                                 */
            uint32_t            : 7;
      __IOM uint32_t GE         : 1;            /*!< DMA request generator channel enable/disable                              */
      __IOM uint32_t GPOL       : 2;            /*!< DMA request generator trigger event type selection Defines the
                                                     trigger event on the selected DMA request trigger input                   */
      __IOM uint32_t GNBREQ     : 5;            /*!< Number of DMA requests to generate Defines the number of DMA
                                                     requests generated after a trigger event, then stop generating.
                                                     The actual number of generated DMA requests is GNBREQ+1.
                                                     Note: This field can only be written when GE bit is reset.                */
            uint32_t            : 8;
    } RG3CR_b;
  } ;
  __IM  uint32_t  RESERVED2[12];
  
  union {
    __IM  uint32_t RGSR;                        /*!< DMAMux - DMA request generator status register                            */
    
    struct {
      __IM  uint32_t OF         : 4;            /*!< Trigger event overrun flag The flag is set when a trigger event
                                                     occurs on DMA request generator channel x, while the DMA
                                                     request generator counter value is lower than GNBREQ. The
                                                     flag is cleared by writing 1 to the corresponding COFx
                                                     bit in DMAMUX_RGCFR register.                                             */
            uint32_t            : 28;
    } RGSR_b;
  } ;
  
  union {
    __OM  uint32_t RGCFR;                       /*!< DMAMux - DMA request generator clear flag register                        */
    
    struct {
      __OM  uint32_t COF        : 4;            /*!< Clear trigger event overrun flag Upon setting, this bit clears
                                                     the corresponding overrun flag OFx in the DMAMUX_RGCSR
                                                     register.                                                                 */
            uint32_t            : 28;
    } RGCFR_b;
  } ;
} DMAMUX_Type;                                  /*!< Size = 328 (0x148)                                                        */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< SYSCFG Structure                                                          */
  
  union {
    __IOM uint32_t MEMRMP;                      /*!< Remap Memory register                                                     */
    
    struct {
      __IOM uint32_t MEM_MODE   : 3;            /*!< Memory mapping selection                                                  */
            uint32_t            : 5;
      __IOM uint32_t FB_mode    : 1;            /*!< User Flash Bank mode                                                      */
            uint32_t            : 23;
    } MEMRMP_b;
  } ;
  
  union {
    __IOM uint32_t CFGR1;                       /*!< peripheral mode configuration register                                    */
    
    struct {
            uint32_t            : 8;
      __IOM uint32_t BOOSTEN    : 1;            /*!< BOOSTEN                                                                   */
      __IOM uint32_t ANASWVDD   : 1;            /*!< GPIO analog switch control voltage selection                              */
            uint32_t            : 6;
      __IOM uint32_t I2C_PB6_FMP : 1;           /*!< FM+ drive capability on PB6                                               */
      __IOM uint32_t I2C_PB7_FMP : 1;           /*!< FM+ drive capability on PB6                                               */
      __IOM uint32_t I2C_PB8_FMP : 1;           /*!< FM+ drive capability on PB6                                               */
      __IOM uint32_t I2C_PB9_FMP : 1;           /*!< FM+ drive capability on PB6                                               */
      __IOM uint32_t I2C1_FMP   : 1;            /*!< I2C1 FM+ drive capability enable                                          */
      __IOM uint32_t I2C2_FMP   : 1;            /*!< I2C1 FM+ drive capability enable                                          */
      __IOM uint32_t I2C3_FMP   : 1;            /*!< I2C1 FM+ drive capability enable                                          */
      __IOM uint32_t I2C4_FMP   : 1;            /*!< I2C1 FM+ drive capability enable                                          */
            uint32_t            : 2;
      __IOM uint32_t FPU_IE     : 6;            /*!< FPU Interrupts Enable                                                     */
    } CFGR1_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR1;                     /*!< external interrupt configuration register 1                               */
    
    struct {
      __IOM uint32_t EXTI0      : 4;            /*!< EXTI x configuration (x = 0 to 3)                                         */
      __IOM uint32_t EXTI1      : 4;            /*!< EXTI x configuration (x = 0 to 3)                                         */
      __IOM uint32_t EXTI2      : 4;            /*!< EXTI x configuration (x = 0 to 3)                                         */
      __IOM uint32_t EXTI3      : 4;            /*!< EXTI x configuration (x = 0 to 3)                                         */
            uint32_t            : 16;
    } EXTICR1_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR2;                     /*!< external interrupt configuration register 2                               */
    
