unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EXTI4      : 4;            /*!< EXTI x configuration (x = 4 to 7)                                         */
      __IOM uint32_t EXTI5      : 4;            /*!< EXTI x configuration (x = 4 to 7)                                         */
      __IOM uint32_t EXTI6      : 4;            /*!< EXTI x configuration (x = 4 to 7)                                         */
      __IOM uint32_t EXTI7      : 4;            /*!< EXTI x configuration (x = 4 to 7)                                         */
            uint32_t            : 16;
    } EXTICR2_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR3;                     /*!< external interrupt configuration register 3                               */
    
    struct {
      __IOM uint32_t EXTI8      : 4;            /*!< EXTI x configuration (x = 8 to 11)                                        */
      __IOM uint32_t EXTI9      : 4;            /*!< EXTI x configuration (x = 8 to 11)                                        */
      __IOM uint32_t EXTI10     : 4;            /*!< EXTI10                                                                    */
      __IOM uint32_t EXTI11     : 4;            /*!< EXTI x configuration (x = 8 to 11)                                        */
            uint32_t            : 16;
    } EXTICR3_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR4;                     /*!< external interrupt configuration register 4                               */
    
    struct {
      __IOM uint32_t EXTI12     : 4;            /*!< EXTI x configuration (x = 12 to 15)                                       */
      __IOM uint32_t EXTI13     : 4;            /*!< EXTI x configuration (x = 12 to 15)                                       */
      __IOM uint32_t EXTI14     : 4;            /*!< EXTI x configuration (x = 12 to 15)                                       */
      __IOM uint32_t EXTI15     : 4;            /*!< EXTI x configuration (x = 12 to 15)                                       */
            uint32_t            : 16;
    } EXTICR4_b;
  } ;
  
  union {
    __IOM uint32_t SCSR;                        /*!< CCM SRAM control and status register                                      */
    
    struct {
      __IOM uint32_t CCMER      : 1;            /*!< CCM SRAM Erase                                                            */
      __IM  uint32_t CCMBSY     : 1;            /*!< CCM SRAM busy by erase operation                                          */
            uint32_t            : 30;
    } SCSR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR2;                       /*!< configuration register 2                                                  */
    
    struct {
      __IOM uint32_t CLL        : 1;            /*!< Core Lockup Lock                                                          */
      __IOM uint32_t SPL        : 1;            /*!< SRAM Parity Lock                                                          */
      __IOM uint32_t PVDL       : 1;            /*!< PVD Lock                                                                  */
      __IOM uint32_t ECCL       : 1;            /*!< ECC Lock                                                                  */
            uint32_t            : 4;
      __IOM uint32_t SPF        : 1;            /*!< SRAM Parity Flag                                                          */
            uint32_t            : 23;
    } CFGR2_b;
  } ;
  
  union {
    __IOM uint32_t SWPR;                        /*!< SRAM Write protection register 1                                          */
    
    struct {
      __IOM uint32_t Page0_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page1_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page2_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page3_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page4_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page5_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page6_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page7_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page8_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page9_WP   : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page10_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page11_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page12_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page13_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page14_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page15_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page16_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page17_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page18_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page19_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page20_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page21_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page22_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page23_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page24_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page25_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page26_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page27_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page28_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page29_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page30_WP  : 1;            /*!< Write protection                                                          */
      __IOM uint32_t Page31_WP  : 1;            /*!< Write protection                                                          */
    } SWPR_b;
  } ;
  
  union {
    __OM  uint32_t SKR;                         /*!< SRAM2 Key Register                                                        */
    
