unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t KEY        : 8;            /*!< SRAM2 Key for software erase                                              */
            uint32_t            : 24;
    } SKR_b;
  } ;
} SYSCFG_Type;                                  /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                          VREFBUF                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage reference buffer (VREFBUF)
  */

typedef struct {                                /*!< VREFBUF Structure                                                         */
  
  union {
    __IOM uint32_t VREFBUF_CSR;                 /*!< VREF_BUF Control and Status Register                                      */
    
    struct {
      __IOM uint32_t ENVR       : 1;            /*!< Enable Voltage Reference                                                  */
      __IOM uint32_t HIZ        : 1;            /*!< High impedence mode for the VREF_BUF                                      */
            uint32_t            : 1;
      __IM  uint32_t VRR        : 1;            /*!< Voltage reference buffer ready                                            */
      __IOM uint32_t VRS        : 2;            /*!< Voltage reference scale                                                   */
            uint32_t            : 26;
    } VREFBUF_CSR_b;
  } ;
  
  union {
    __IOM uint32_t VREFBUF_CCR;                 /*!< VREF_BUF Calibration Control Register                                     */
    
    struct {
      __IOM uint32_t TRIM       : 6;            /*!< Trimming code                                                             */
            uint32_t            : 26;
    } VREFBUF_CCR_b;
  } ;
} VREFBUF_Type;                                 /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator control and status register (COMP)
  */

typedef struct {                                /*!< COMP Structure                                                            */
  
  union {
    __IOM uint32_t COMP_C1CSR;                  /*!< Comparator control/status register                                        */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C1CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C2CSR;                  /*!< Comparator control/status register                                        */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C2CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C3CSR;                  /*!< Comparator control/status register                                        */
    
