unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C3CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C4CSR;                  /*!< Comparator control/status register                                        */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C4CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C5CSR;                  /*!< Comparator control/status register                                        */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C5CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C6CSR;                  /*!< Comparator control/status register                                        */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C6CSR_b;
  } ;
  
  union {
    __IOM uint32_t COMP_C7CSR;                  /*!< Comparator control/status register                                        */
    
