unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< EN                                                                        */
            uint32_t            : 3;
      __IOM uint32_t INMSEL     : 3;            /*!< INMSEL                                                                    */
            uint32_t            : 1;
      __IOM uint32_t INPSEL     : 1;            /*!< INPSEL                                                                    */
            uint32_t            : 6;
      __IOM uint32_t POL        : 1;            /*!< POL                                                                       */
      __IOM uint32_t HYST       : 3;            /*!< HYST                                                                      */
      __IOM uint32_t BLANKSEL   : 3;            /*!< BLANKSEL                                                                  */
      __IOM uint32_t BRGEN      : 1;            /*!< BRGEN                                                                     */
      __IOM uint32_t SCALEN     : 1;            /*!< SCALEN                                                                    */
            uint32_t            : 6;
      __IM  uint32_t VALUE      : 1;            /*!< VALUE                                                                     */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } COMP_C7CSR_b;
  } ;
} COMP_Type;                                    /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           OPAMP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Operational amplifiers (OPAMP)
  */

typedef struct {                                /*!< OPAMP Structure                                                           */
  
  union {
    __IOM uint32_t OPAMP1_CSR;                  /*!< OPAMP1 control/status register                                            */
    
    struct {
      __IOM uint32_t OPAEN      : 1;            /*!< Operational amplifier Enable                                              */
      __IOM uint32_t FORCE_VP   : 1;            /*!< FORCE_VP                                                                  */
      __IOM uint32_t VP_SEL     : 2;            /*!< VP_SEL                                                                    */
      __IOM uint32_t USERTRIM   : 1;            /*!< USERTRIM                                                                  */
      __IOM uint32_t VM_SEL     : 2;            /*!< VM_SEL                                                                    */
      __IOM uint32_t OPAHSM     : 1;            /*!< OPAHSM                                                                    */
      __IOM uint32_t OPAINTOEN  : 1;            /*!< OPAINTOEN                                                                 */
            uint32_t            : 2;
      __IOM uint32_t CALON      : 1;            /*!< CALON                                                                     */
      __IOM uint32_t CALSEL     : 2;            /*!< CALSEL                                                                    */
      __IOM uint32_t PGA_GAIN   : 5;            /*!< PGA_GAIN                                                                  */
      __IOM uint32_t TRIMOFFSETP : 5;           /*!< TRIMOFFSETP                                                               */
      __IOM uint32_t TRIMOFFSETN : 5;           /*!< TRIMOFFSETN                                                               */
            uint32_t            : 1;
      __IOM uint32_t CALOUT     : 1;            /*!< CALOUT                                                                    */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP1_CSR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP2_CSR;                  /*!< OPAMP2 control/status register                                            */
    
    struct {
      __IOM uint32_t OPAEN      : 1;            /*!< Operational amplifier Enable                                              */
      __IOM uint32_t FORCE_VP   : 1;            /*!< FORCE_VP                                                                  */
      __IOM uint32_t VP_SEL     : 2;            /*!< VP_SEL                                                                    */
      __IOM uint32_t USERTRIM   : 1;            /*!< USERTRIM                                                                  */
      __IOM uint32_t VM_SEL     : 2;            /*!< VM_SEL                                                                    */
      __IOM uint32_t OPAHSM     : 1;            /*!< OPAHSM                                                                    */
      __IOM uint32_t OPAINTOEN  : 1;            /*!< OPAINTOEN                                                                 */
            uint32_t            : 2;
      __IOM uint32_t CALON      : 1;            /*!< CALON                                                                     */
      __IOM uint32_t CALSEL     : 2;            /*!< CALSEL                                                                    */
      __IOM uint32_t PGA_GAIN   : 5;            /*!< PGA_GAIN                                                                  */
      __IOM uint32_t TRIMOFFSETP : 5;           /*!< TRIMOFFSETP                                                               */
      __IOM uint32_t TRIMOFFSETN : 5;           /*!< TRIMOFFSETN                                                               */
            uint32_t            : 1;
      __IOM uint32_t CALOUT     : 1;            /*!< CALOUT                                                                    */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP2_CSR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP3_CSR;                  /*!< OPAMP3 control/status register                                            */
    
