unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t OPAEN      : 1;            /*!< Operational amplifier Enable                                              */
      __IOM uint32_t FORCE_VP   : 1;            /*!< FORCE_VP                                                                  */
      __IOM uint32_t VP_SEL     : 2;            /*!< VP_SEL                                                                    */
      __IOM uint32_t USERTRIM   : 1;            /*!< USERTRIM                                                                  */
      __IOM uint32_t VM_SEL     : 2;            /*!< VM_SEL                                                                    */
      __IOM uint32_t OPAHSM     : 1;            /*!< OPAHSM                                                                    */
      __IOM uint32_t OPAINTOEN  : 1;            /*!< OPAINTOEN                                                                 */
            uint32_t            : 2;
      __IOM uint32_t CALON      : 1;            /*!< CALON                                                                     */
      __IOM uint32_t CALSEL     : 2;            /*!< CALSEL                                                                    */
      __IOM uint32_t PGA_GAIN   : 5;            /*!< PGA_GAIN                                                                  */
      __IOM uint32_t TRIMOFFSETP : 5;           /*!< TRIMOFFSETP                                                               */
      __IOM uint32_t TRIMOFFSETN : 5;           /*!< TRIMOFFSETN                                                               */
            uint32_t            : 1;
      __IOM uint32_t CALOUT     : 1;            /*!< CALOUT                                                                    */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP3_CSR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP4_CSR;                  /*!< OPAMP4 control/status register                                            */
    
    struct {
      __IOM uint32_t OPAEN      : 1;            /*!< Operational amplifier Enable                                              */
      __IOM uint32_t FORCE_VP   : 1;            /*!< FORCE_VP                                                                  */
      __IOM uint32_t VP_SEL     : 2;            /*!< VP_SEL                                                                    */
      __IOM uint32_t USERTRIM   : 1;            /*!< USERTRIM                                                                  */
      __IOM uint32_t VM_SEL     : 2;            /*!< VM_SEL                                                                    */
      __IOM uint32_t OPAHSM     : 1;            /*!< OPAHSM                                                                    */
      __IOM uint32_t OPAINTOEN  : 1;            /*!< OPAINTOEN                                                                 */
            uint32_t            : 2;
      __IOM uint32_t CALON      : 1;            /*!< CALON                                                                     */
      __IOM uint32_t CALSEL     : 2;            /*!< CALSEL                                                                    */
      __IOM uint32_t PGA_GAIN   : 5;            /*!< PGA_GAIN                                                                  */
      __IOM uint32_t TRIMOFFSETP : 5;           /*!< TRIMOFFSETP                                                               */
      __IOM uint32_t TRIMOFFSETN : 5;           /*!< TRIMOFFSETN                                                               */
            uint32_t            : 1;
      __IOM uint32_t CALOUT     : 1;            /*!< CALOUT                                                                    */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP4_CSR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP5_CSR;                  /*!< OPAMP5 control/status register                                            */
    
    struct {
      __IOM uint32_t OPAEN      : 1;            /*!< Operational amplifier Enable                                              */
      __IOM uint32_t FORCE_VP   : 1;            /*!< FORCE_VP                                                                  */
      __IOM uint32_t VP_SEL     : 2;            /*!< VP_SEL                                                                    */
      __IOM uint32_t USERTRIM   : 1;            /*!< USERTRIM                                                                  */
      __IOM uint32_t VM_SEL     : 2;            /*!< VM_SEL                                                                    */
      __IOM uint32_t OPAHSM     : 1;            /*!< OPAHSM                                                                    */
      __IOM uint32_t OPAINTOEN  : 1;            /*!< OPAINTOEN                                                                 */
            uint32_t            : 2;
      __IOM uint32_t CALON      : 1;            /*!< CALON                                                                     */
      __IOM uint32_t CALSEL     : 2;            /*!< CALSEL                                                                    */
      __IOM uint32_t PGA_GAIN   : 5;            /*!< PGA_GAIN                                                                  */
      __IOM uint32_t TRIMOFFSETP : 5;           /*!< TRIMOFFSETP                                                               */
      __IOM uint32_t TRIMOFFSETN : 5;           /*!< TRIMOFFSETN                                                               */
            uint32_t            : 1;
      __IOM uint32_t CALOUT     : 1;            /*!< CALOUT                                                                    */
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP5_CSR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP6_CSR;                  /*!< OPAMP6 control/status register                                            */
    
