unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t VMS_SEL    : 1;            /*!< VMS_SEL                                                                   */
      __IOM uint32_t VPS_SEL    : 2;            /*!< VPS_SEL                                                                   */
      __IOM uint32_t T1CM_EN    : 1;            /*!< T1CM_EN                                                                   */
      __IOM uint32_t T8CM_EN    : 1;            /*!< T8CM_EN                                                                   */
      __IOM uint32_t T20CM_EN   : 1;            /*!< T20CM_EN                                                                  */
            uint32_t            : 25;
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP5_TCMR_b;
  } ;
  
  union {
    __IOM uint32_t OPAMP6_TCMR;                 /*!< OPAMP6 control/status register                                            */
    
    struct {
      __IOM uint32_t VMS_SEL    : 1;            /*!< VMS_SEL                                                                   */
      __IOM uint32_t VPS_SEL    : 2;            /*!< VPS_SEL                                                                   */
      __IOM uint32_t T1CM_EN    : 1;            /*!< T1CM_EN                                                                   */
      __IOM uint32_t T8CM_EN    : 1;            /*!< T8CM_EN                                                                   */
      __IOM uint32_t T20CM_EN   : 1;            /*!< T20CM_EN                                                                  */
            uint32_t            : 25;
      __IOM uint32_t LOCK       : 1;            /*!< LOCK                                                                      */
    } OPAMP6_TCMR_b;
  } ;
} OPAMP_Type;                                   /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                       HRTIM_Master                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief High Resolution Timer: Master       Timers (HRTIM_Master)
  */

typedef struct {                                /*!< HRTIM_Master Structure                                                    */
  
  union {
    __IOM uint32_t MCR;                         /*!< Master Timer Control Register                                             */
    
    struct {
      __IOM uint32_t CK_PSC     : 3;            /*!< HRTIM Master Clock prescaler                                              */
      __IOM uint32_t CONT       : 1;            /*!< Master Continuous mode                                                    */
      __IOM uint32_t RETRIG     : 1;            /*!< Master Re-triggerable mode                                                */
      __IOM uint32_t HALF       : 1;            /*!< Half mode enable                                                          */
      __IOM uint32_t INTLVD     : 2;            /*!< Interleaved mode                                                          */
      __IOM uint32_t SYNC_IN    : 2;            /*!< synchronization input                                                     */
      __IOM uint32_t SYNCRSTM   : 1;            /*!< Synchronization Resets Master                                             */
      __IOM uint32_t SYNCSTRTM  : 1;            /*!< Synchronization Starts Master                                             */
      __IOM uint32_t SYNC_OUT   : 2;            /*!< Synchronization output                                                    */
      __IOM uint32_t SYNC_SRC   : 2;            /*!< Synchronization source                                                    */
      __IOM uint32_t MCEN       : 1;            /*!< Master Counter enable                                                     */
      __IOM uint32_t TACEN      : 1;            /*!< Timer A counter enable                                                    */
      __IOM uint32_t TBCEN      : 1;            /*!< Timer B counter enable                                                    */
      __IOM uint32_t TCCEN      : 1;            /*!< Timer C counter enable                                                    */
      __IOM uint32_t TDCEN      : 1;            /*!< Timer D counter enable                                                    */
      __IOM uint32_t TECEN      : 1;            /*!< Timer E counter enable                                                    */
      __IOM uint32_t TFCEN      : 1;            /*!< Timer F counter enable                                                    */
            uint32_t            : 2;
      __IOM uint32_t DACSYNC    : 2;            /*!< AC Synchronization                                                        */
      __IOM uint32_t PREEN      : 1;            /*!< Preload enable                                                            */
            uint32_t            : 1;
      __IOM uint32_t MREPU      : 1;            /*!< Master Timer Repetition update                                            */
      __IOM uint32_t BRSTDMA    : 2;            /*!< Burst DMA Update                                                          */
    } MCR_b;
  } ;
  
  union {
    __IM  uint32_t MISR;                        /*!< Master Timer Interrupt Status Register                                    */
    
    struct {
      __IM  uint32_t MCMP1      : 1;            /*!< Master Compare 1 Interrupt Flag                                           */
      __IM  uint32_t MCMP2      : 1;            /*!< Master Compare 2 Interrupt Flag                                           */
      __IM  uint32_t MCMP3      : 1;            /*!< Master Compare 3 Interrupt Flag                                           */
      __IM  uint32_t MCMP4      : 1;            /*!< Master Compare 4 Interrupt Flag                                           */
      __IM  uint32_t MREP       : 1;            /*!< Master Repetition Interrupt Flag                                          */
      __IM  uint32_t SYNC       : 1;            /*!< Sync Input Interrupt Flag                                                 */
      __IM  uint32_t MUPD       : 1;            /*!< Master Update Interrupt Flag                                              */
            uint32_t            : 25;
    } MISR_b;
  } ;
  
  union {
    __OM  uint32_t MICR;                        /*!< Master Timer Interrupt Clear Register                                     */
    
