unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t MCMP1C     : 1;            /*!< Master Compare 1 Interrupt flag clear                                     */
      __OM  uint32_t MCMP2C     : 1;            /*!< Master Compare 2 Interrupt flag clear                                     */
      __OM  uint32_t MCMP3C     : 1;            /*!< Master Compare 3 Interrupt flag clear                                     */
      __OM  uint32_t MCMP4C     : 1;            /*!< Master Compare 4 Interrupt flag clear                                     */
      __OM  uint32_t MREPC      : 1;            /*!< Repetition Interrupt flag clear                                           */
      __OM  uint32_t SYNCC      : 1;            /*!< Sync Input Interrupt flag clear                                           */
      __OM  uint32_t MUPDC      : 1;            /*!< Master update Interrupt flag clear                                        */
            uint32_t            : 25;
    } MICR_b;
  } ;
  
  union {
    __IOM uint32_t MDIER;                       /*!< HRTIM Master Timer DMA / Interrupt Enable Register                        */
    
    struct {
      __IOM uint32_t MCMP1IE    : 1;            /*!< MCMP1IE                                                                   */
      __IOM uint32_t MCMP2IE    : 1;            /*!< MCMP2IE                                                                   */
      __IOM uint32_t MCMP3IE    : 1;            /*!< MCMP3IE                                                                   */
      __IOM uint32_t MCMP4IE    : 1;            /*!< MCMP4IE                                                                   */
      __IOM uint32_t MREPIE     : 1;            /*!< MREPIE                                                                    */
      __IOM uint32_t SYNCIE     : 1;            /*!< SYNCIE                                                                    */
      __IOM uint32_t MUPDIE     : 1;            /*!< MUPDIE                                                                    */
            uint32_t            : 9;
      __IOM uint32_t MCMP1DE    : 1;            /*!< MCMP1DE                                                                   */
      __IOM uint32_t MCMP2DE    : 1;            /*!< MCMP2DE                                                                   */
      __IOM uint32_t MCMP3DE    : 1;            /*!< MCMP3DE                                                                   */
      __IOM uint32_t MCMP4DE    : 1;            /*!< MCMP4DE                                                                   */
      __IOM uint32_t MREPDE     : 1;            /*!< MREPDE                                                                    */
      __IOM uint32_t SYNCDE     : 1;            /*!< SYNCDE                                                                    */
      __IOM uint32_t MUPDDE     : 1;            /*!< MUPDDE                                                                    */
            uint32_t            : 9;
    } MDIER_b;
  } ;
  
  union {
    __IOM uint32_t MCNTR;                       /*!< Master Timer Counter Register                                             */
    
    struct {
      __IOM uint32_t MCNT       : 16;           /*!< Counter value                                                             */
            uint32_t            : 16;
    } MCNTR_b;
  } ;
  
  union {
    __IOM uint32_t MPER;                        /*!< Master Timer Period Register                                              */
    
    struct {
      __IOM uint32_t MPER       : 16;           /*!< Master Timer Period value                                                 */
            uint32_t            : 16;
    } MPER_b;
  } ;
  
  union {
    __IOM uint32_t MREP;                        /*!< Master Timer Repetition Register                                          */
    
    struct {
      __IOM uint32_t MREP       : 8;            /*!< Master Timer Repetition counter value                                     */
            uint32_t            : 24;
    } MREP_b;
  } ;
  
  union {
    __IOM uint32_t MCMP1R;                      /*!< Master Timer Compare 1 Register                                           */
    
    struct {
      __IOM uint32_t MCMP1      : 16;           /*!< Master Timer Compare 1 value                                              */
            uint32_t            : 16;
    } MCMP1R_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t MCMP2R;                      /*!< Master Timer Compare 2 Register                                           */
    
    struct {
      __IOM uint32_t MCMP2      : 16;           /*!< Master Timer Compare 2 value                                              */
            uint32_t            : 16;
    } MCMP2R_b;
  } ;
  
  union {
    __IOM uint32_t MCMP3R;                      /*!< Master Timer Compare 3 Register                                           */
    
    struct {
      __IOM uint32_t MCMP3      : 16;           /*!< Master Timer Compare 3 value                                              */
            uint32_t            : 16;
    } MCMP3R_b;
  } ;
  
  union {
    __IOM uint32_t MCMP4R;                      /*!< Master Timer Compare 4 Register                                           */
    
    struct {
      __IOM uint32_t MCMP4      : 16;           /*!< Master Timer Compare 4 value                                              */
            uint32_t            : 16;
    } MCMP4R_b;
  } ;
} HRTIM_Master_Type;                            /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                        HRTIM_TIMA                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief High Resolution Timer: TIMA (HRTIM_TIMA)
  */

typedef struct {                                /*!< HRTIM_TIMA Structure                                                      */
  
  union {
    __IOM uint32_t TIMACR;                      /*!< Timerx Control Register                                                   */
    
