unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CMP3x      : 16;           /*!< Timerx Compare 3 value                                                    */
            uint32_t            : 16;
    } CMP3AR_b;
  } ;
  
  union {
    __IOM uint32_t CMP4AR;                      /*!< Timerx Compare 4 Register                                                 */
    
    struct {
      __IOM uint32_t CMP4x      : 16;           /*!< Timerx Compare 4 value                                                    */
            uint32_t            : 16;
    } CMP4AR_b;
  } ;
  
  union {
    __IM  uint32_t CPT1AR;                      /*!< Timerx Capture 1 Register                                                 */
    
    struct {
      __IM  uint32_t CPT1x      : 16;           /*!< Timerx Capture 1 value                                                    */
      __IM  uint32_t DIR        : 1;            /*!< Timerx Capture 1 Direction status                                         */
            uint32_t            : 15;
    } CPT1AR_b;
  } ;
  
  union {
    __IM  uint32_t CPT2AR;                      /*!< Timerx Capture 2 Register                                                 */
    
    struct {
      __IM  uint32_t CPT2x      : 16;           /*!< Timerx Capture 2 value                                                    */
      __IM  uint32_t DIR        : 1;            /*!< Timerx Capture 1 Direction status                                         */
            uint32_t            : 15;
    } CPT2AR_b;
  } ;
  
  union {
    __IOM uint32_t DTAR;                        /*!< Timerx Deadtime Register                                                  */
    
    struct {
      __IOM uint32_t DTRx       : 9;            /*!< Deadtime Rising value                                                     */
      __IOM uint32_t SDTRx      : 1;            /*!< Sign Deadtime Rising value                                                */
      __IOM uint32_t DTPRSC     : 3;            /*!< Deadtime Prescaler                                                        */
            uint32_t            : 1;
      __IOM uint32_t DTRSLKx    : 1;            /*!< Deadtime Rising Sign Lock                                                 */
      __IOM uint32_t DTRLKx     : 1;            /*!< Deadtime Rising Lock                                                      */
      __IOM uint32_t DTFx       : 9;            /*!< Deadtime Falling value                                                    */
      __IOM uint32_t SDTFx      : 1;            /*!< Sign Deadtime Falling value                                               */
            uint32_t            : 4;
      __IOM uint32_t DTFSLKx    : 1;            /*!< Deadtime Falling Sign Lock                                                */
      __IOM uint32_t DTFLKx     : 1;            /*!< Deadtime Falling Lock                                                     */
    } DTAR_b;
  } ;
  
  union {
    __IOM uint32_t SETA1R;                      /*!< Timerx Output1 Set Register                                               */
    
    struct {
      __IOM uint32_t SST        : 1;            /*!< Software Set trigger                                                      */
      __IOM uint32_t RESYNC     : 1;            /*!< Timer A resynchronizaton                                                  */
      __IOM uint32_t PER        : 1;            /*!< Timer A Period                                                            */
      __IOM uint32_t CMP1       : 1;            /*!< Timer A compare 1                                                         */
      __IOM uint32_t CMP2       : 1;            /*!< Timer A compare 2                                                         */
      __IOM uint32_t CMP3       : 1;            /*!< Timer A compare 3                                                         */
      __IOM uint32_t CMP4       : 1;            /*!< Timer A compare 4                                                         */
      __IOM uint32_t MSTPER     : 1;            /*!< Master Period                                                             */
      __IOM uint32_t MSTCMP1    : 1;            /*!< Master Compare 1                                                          */
      __IOM uint32_t MSTCMP2    : 1;            /*!< Master Compare 2                                                          */
      __IOM uint32_t MSTCMP3    : 1;            /*!< Master Compare 3                                                          */
      __IOM uint32_t MSTCMP4    : 1;            /*!< Master Compare 4                                                          */
      __IOM uint32_t TIMEVNT1   : 1;            /*!< Timer Event 1                                                             */
      __IOM uint32_t TIMEVNT2   : 1;            /*!< Timer Event 2                                                             */
      __IOM uint32_t TIMEVNT3   : 1;            /*!< Timer Event 3                                                             */
      __IOM uint32_t TIMEVNT4   : 1;            /*!< Timer Event 4                                                             */
      __IOM uint32_t TIMEVNT5   : 1;            /*!< Timer Event 5                                                             */
      __IOM uint32_t TIMEVNT6   : 1;            /*!< Timer Event 6                                                             */
      __IOM uint32_t TIMEVNT7   : 1;            /*!< Timer Event 7                                                             */
      __IOM uint32_t TIMEVNT8   : 1;            /*!< Timer Event 8                                                             */
      __IOM uint32_t TIMEVNT9   : 1;            /*!< Timer Event 9                                                             */
      __IOM uint32_t EXTEVNT1   : 1;            /*!< External Event 1                                                          */
      __IOM uint32_t EXTEVNT2   : 1;            /*!< External Event 2                                                          */
      __IOM uint32_t EXTEVNT3   : 1;            /*!< External Event 3                                                          */
      __IOM uint32_t EXTEVNT4   : 1;            /*!< External Event 4                                                          */
      __IOM uint32_t EXTEVNT5   : 1;            /*!< External Event 5                                                          */
      __IOM uint32_t EXTEVNT6   : 1;            /*!< External Event 6                                                          */
      __IOM uint32_t EXTEVNT7   : 1;            /*!< External Event 7                                                          */
      __IOM uint32_t EXTEVNT8   : 1;            /*!< External Event 8                                                          */
      __IOM uint32_t EXTEVNT9   : 1;            /*!< External Event 9                                                          */
      __IOM uint32_t EXTEVNT10  : 1;            /*!< External Event 10                                                         */
      __IOM uint32_t UPDATE     : 1;            /*!< Registers update (transfer preload to active)                             */
    } SETA1R_b;
  } ;
  
  union {
    __IOM uint32_t RSTA1R;                      /*!< Timerx Output1 Reset Register                                             */
    
