unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SRT        : 1;            /*!< SRT                                                                       */
      __IOM uint32_t RESYNC     : 1;            /*!< RESYNC                                                                    */
      __IOM uint32_t PER        : 1;            /*!< PER                                                                       */
      __IOM uint32_t CMP1       : 1;            /*!< CMP1                                                                      */
      __IOM uint32_t CMP2       : 1;            /*!< CMP2                                                                      */
      __IOM uint32_t CMP3       : 1;            /*!< CMP3                                                                      */
      __IOM uint32_t CMP4       : 1;            /*!< CMP4                                                                      */
      __IOM uint32_t MSTPER     : 1;            /*!< MSTPER                                                                    */
      __IOM uint32_t MSTCMP1    : 1;            /*!< MSTCMP1                                                                   */
      __IOM uint32_t MSTCMP2    : 1;            /*!< MSTCMP2                                                                   */
      __IOM uint32_t MSTCMP3    : 1;            /*!< MSTCMP3                                                                   */
      __IOM uint32_t MSTCMP4    : 1;            /*!< MSTCMP4                                                                   */
      __IOM uint32_t TIMEVNT1   : 1;            /*!< TIMEVNT1                                                                  */
      __IOM uint32_t TIMEVNT2   : 1;            /*!< TIMEVNT2                                                                  */
      __IOM uint32_t TIMEVNT3   : 1;            /*!< TIMEVNT3                                                                  */
      __IOM uint32_t TIMEVNT4   : 1;            /*!< TIMEVNT4                                                                  */
      __IOM uint32_t TIMEVNT5   : 1;            /*!< TIMEVNT5                                                                  */
      __IOM uint32_t TIMEVNT6   : 1;            /*!< TIMEVNT6                                                                  */
      __IOM uint32_t TIMEVNT7   : 1;            /*!< TIMEVNT7                                                                  */
      __IOM uint32_t TIMEVNT8   : 1;            /*!< TIMEVNT8                                                                  */
      __IOM uint32_t TIMEVNT9   : 1;            /*!< TIMEVNT9                                                                  */
      __IOM uint32_t EXTEVNT1   : 1;            /*!< EXTEVNT1                                                                  */
      __IOM uint32_t EXTEVNT2   : 1;            /*!< EXTEVNT2                                                                  */
      __IOM uint32_t EXTEVNT3   : 1;            /*!< EXTEVNT3                                                                  */
      __IOM uint32_t EXTEVNT4   : 1;            /*!< EXTEVNT4                                                                  */
      __IOM uint32_t EXTEVNT5   : 1;            /*!< EXTEVNT5                                                                  */
      __IOM uint32_t EXTEVNT6   : 1;            /*!< EXTEVNT6                                                                  */
      __IOM uint32_t EXTEVNT7   : 1;            /*!< EXTEVNT7                                                                  */
      __IOM uint32_t EXTEVNT8   : 1;            /*!< EXTEVNT8                                                                  */
      __IOM uint32_t EXTEVNT9   : 1;            /*!< EXTEVNT9                                                                  */
      __IOM uint32_t EXTEVNT10  : 1;            /*!< EXTEVNT10                                                                 */
      __IOM uint32_t UPDATE     : 1;            /*!< UPDATE                                                                    */
    } RSTA1R_b;
  } ;
  
  union {
    __IOM uint32_t SETA2R;                      /*!< Timerx Output2 Set Register                                               */
    
    struct {
      __IOM uint32_t SST        : 1;            /*!< SST                                                                       */
      __IOM uint32_t RESYNC     : 1;            /*!< RESYNC                                                                    */
      __IOM uint32_t PER        : 1;            /*!< PER                                                                       */
      __IOM uint32_t CMP1       : 1;            /*!< CMP1                                                                      */
      __IOM uint32_t CMP2       : 1;            /*!< CMP2                                                                      */
      __IOM uint32_t CMP3       : 1;            /*!< CMP3                                                                      */
      __IOM uint32_t CMP4       : 1;            /*!< CMP4                                                                      */
      __IOM uint32_t MSTPER     : 1;            /*!< MSTPER                                                                    */
      __IOM uint32_t MSTCMP1    : 1;            /*!< MSTCMP1                                                                   */
      __IOM uint32_t MSTCMP2    : 1;            /*!< MSTCMP2                                                                   */
      __IOM uint32_t MSTCMP3    : 1;            /*!< MSTCMP3                                                                   */
      __IOM uint32_t MSTCMP4    : 1;            /*!< MSTCMP4                                                                   */
      __IOM uint32_t TIMEVNT1   : 1;            /*!< TIMEVNT1                                                                  */
      __IOM uint32_t TIMEVNT2   : 1;            /*!< TIMEVNT2                                                                  */
      __IOM uint32_t TIMEVNT3   : 1;            /*!< TIMEVNT3                                                                  */
      __IOM uint32_t TIMEVNT4   : 1;            /*!< TIMEVNT4                                                                  */
      __IOM uint32_t TIMEVNT5   : 1;            /*!< TIMEVNT5                                                                  */
      __IOM uint32_t TIMEVNT6   : 1;            /*!< TIMEVNT6                                                                  */
      __IOM uint32_t TIMEVNT7   : 1;            /*!< TIMEVNT7                                                                  */
      __IOM uint32_t TIMEVNT8   : 1;            /*!< TIMEVNT8                                                                  */
      __IOM uint32_t TIMEVNT9   : 1;            /*!< TIMEVNT9                                                                  */
      __IOM uint32_t EXTEVNT1   : 1;            /*!< EXTEVNT1                                                                  */
      __IOM uint32_t EXTEVNT2   : 1;            /*!< EXTEVNT2                                                                  */
      __IOM uint32_t EXTEVNT3   : 1;            /*!< EXTEVNT3                                                                  */
      __IOM uint32_t EXTEVNT4   : 1;            /*!< EXTEVNT4                                                                  */
      __IOM uint32_t EXTEVNT5   : 1;            /*!< EXTEVNT5                                                                  */
      __IOM uint32_t EXTEVNT6   : 1;            /*!< EXTEVNT6                                                                  */
      __IOM uint32_t EXTEVNT7   : 1;            /*!< EXTEVNT7                                                                  */
      __IOM uint32_t EXTEVNT8   : 1;            /*!< EXTEVNT8                                                                  */
      __IOM uint32_t EXTEVNT9   : 1;            /*!< EXTEVNT9                                                                  */
      __IOM uint32_t EXTEVNT10  : 1;            /*!< EXTEVNT10                                                                 */
      __IOM uint32_t UPDATE     : 1;            /*!< UPDATE                                                                    */
    } SETA2R_b;
  } ;
  
  union {
    __IOM uint32_t RSTA2R;                      /*!< Timerx Output2 Reset Register                                             */
    
