unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CHPFRQ     : 4;            /*!< Timerx carrier frequency value                                            */
      __IOM uint32_t CHPDTY     : 3;            /*!< Timerx chopper duty cycle value                                           */
      __IOM uint32_t STRTPW     : 4;            /*!< STRTPW                                                                    */
            uint32_t            : 21;
    } CHPAR_b;
  } ;
  
  union {
    __IOM uint32_t CPT1ACR;                     /*!< Timerx Capture 2 Control Register                                         */
    
    struct {
      __IOM uint32_t SWCPT      : 1;            /*!< Software Capture                                                          */
      __IOM uint32_t UDPCPT     : 1;            /*!< Update Capture                                                            */
      __IOM uint32_t EXEV1CPT   : 1;            /*!< External Event 1 Capture                                                  */
      __IOM uint32_t EXEV2CPT   : 1;            /*!< External Event 2 Capture                                                  */
      __IOM uint32_t EXEV3CPT   : 1;            /*!< External Event 3 Capture                                                  */
      __IOM uint32_t EXEV4CPT   : 1;            /*!< External Event 4 Capture                                                  */
      __IOM uint32_t EXEV5CPT   : 1;            /*!< External Event 5 Capture                                                  */
      __IOM uint32_t EXEV6CPT   : 1;            /*!< External Event 6 Capture                                                  */
      __IOM uint32_t EXEV7CPT   : 1;            /*!< External Event 7 Capture                                                  */
      __IOM uint32_t EXEV8CPT   : 1;            /*!< External Event 8 Capture                                                  */
      __IOM uint32_t EXEV9CPT   : 1;            /*!< External Event 9 Capture                                                  */
      __IOM uint32_t EXEV10CPT  : 1;            /*!< External Event 10 Capture                                                 */
      __IOM uint32_t TF1SET     : 1;            /*!< TF1SET                                                                    */
      __IOM uint32_t TF1RST     : 1;            /*!< TF1RST                                                                    */
      __IOM uint32_t TFCMP1     : 1;            /*!< TFCMP1                                                                    */
      __IOM uint32_t TFCMP2     : 1;            /*!< TFCMP2                                                                    */
      __IOM uint32_t TB1SET     : 1;            /*!< Timer B output 1 Set                                                      */
      __IOM uint32_t TB1RST     : 1;            /*!< Timer B output 1 Reset                                                    */
      __IOM uint32_t TBCMP1     : 1;            /*!< Timer B Compare 1                                                         */
      __IOM uint32_t TBCMP2     : 1;            /*!< Timer B Compare 2                                                         */
      __IOM uint32_t TC1SET     : 1;            /*!< Timer C output 1 Set                                                      */
      __IOM uint32_t TC1RST     : 1;            /*!< Timer C output 1 Reset                                                    */
      __IOM uint32_t TCCMP1     : 1;            /*!< Timer C Compare 1                                                         */
      __IOM uint32_t TCCMP2     : 1;            /*!< Timer C Compare 2                                                         */
      __IOM uint32_t TD1SET     : 1;            /*!< Timer D output 1 Set                                                      */
      __IOM uint32_t TD1RST     : 1;            /*!< Timer D output 1 Reset                                                    */
      __IOM uint32_t TDCMP1     : 1;            /*!< Timer D Compare 1                                                         */
      __IOM uint32_t TDCMP2     : 1;            /*!< Timer D Compare 2                                                         */
      __IOM uint32_t TE1SET     : 1;            /*!< Timer E output 1 Set                                                      */
      __IOM uint32_t TE1RST     : 1;            /*!< Timer E output 1 Reset                                                    */
      __IOM uint32_t TECMP1     : 1;            /*!< Timer E Compare 1                                                         */
      __IOM uint32_t TECMP2     : 1;            /*!< Timer E Compare 2                                                         */
    } CPT1ACR_b;
  } ;
  
  union {
    __IOM uint32_t CPT2ACR;                     /*!< CPT2xCR                                                                   */
    
    struct {
      __IOM uint32_t SWCPT      : 1;            /*!< Software Capture                                                          */
      __IOM uint32_t UDPCPT     : 1;            /*!< Update Capture                                                            */
      __IOM uint32_t EXEV1CPT   : 1;            /*!< External Event 1 Capture                                                  */
      __IOM uint32_t EXEV2CPT   : 1;            /*!< External Event 2 Capture                                                  */
      __IOM uint32_t EXEV3CPT   : 1;            /*!< External Event 3 Capture                                                  */
      __IOM uint32_t EXEV4CPT   : 1;            /*!< External Event 4 Capture                                                  */
      __IOM uint32_t EXEV5CPT   : 1;            /*!< External Event 5 Capture                                                  */
      __IOM uint32_t EXEV6CPT   : 1;            /*!< External Event 6 Capture                                                  */
      __IOM uint32_t EXEV7CPT   : 1;            /*!< External Event 7 Capture                                                  */
      __IOM uint32_t EXEV8CPT   : 1;            /*!< External Event 8 Capture                                                  */
      __IOM uint32_t EXEV9CPT   : 1;            /*!< External Event 9 Capture                                                  */
      __IOM uint32_t EXEV10CPT  : 1;            /*!< External Event 10 Capture                                                 */
      __IOM uint32_t TF1SET     : 1;            /*!< TF1SET                                                                    */
      __IOM uint32_t TF1RST     : 1;            /*!< TF1RST                                                                    */
      __IOM uint32_t TFCMP1     : 1;            /*!< TFCMP1                                                                    */
      __IOM uint32_t TFCMP2     : 1;            /*!< TFCMP2                                                                    */
      __IOM uint32_t TB1SET     : 1;            /*!< Timer B output 1 Set                                                      */
      __IOM uint32_t TB1RST     : 1;            /*!< Timer B output 1 Reset                                                    */
      __IOM uint32_t TBCMP1     : 1;            /*!< Timer B Compare 1                                                         */
      __IOM uint32_t TBCMP2     : 1;            /*!< Timer B Compare 2                                                         */
      __IOM uint32_t TC1SET     : 1;            /*!< Timer C output 1 Set                                                      */
      __IOM uint32_t TC1RST     : 1;            /*!< Timer C output 1 Reset                                                    */
      __IOM uint32_t TCCMP1     : 1;            /*!< Timer C Compare 1                                                         */
      __IOM uint32_t TCCMP2     : 1;            /*!< Timer C Compare 2                                                         */
      __IOM uint32_t TD1SET     : 1;            /*!< Timer D output 1 Set                                                      */
      __IOM uint32_t TD1RST     : 1;            /*!< Timer D output 1 Reset                                                    */
      __IOM uint32_t TDCMP1     : 1;            /*!< Timer D Compare 1                                                         */
      __IOM uint32_t TDCMP2     : 1;            /*!< Timer D Compare 2                                                         */
      __IOM uint32_t TE1SET     : 1;            /*!< Timer E output 1 Set                                                      */
      __IOM uint32_t TE1RST     : 1;            /*!< Timer E output 1 Reset                                                    */
      __IOM uint32_t TECMP1     : 1;            /*!< Timer E Compare 1                                                         */
      __IOM uint32_t TECMP2     : 1;            /*!< Timer E Compare 2                                                         */
    } CPT2ACR_b;
  } ;
  
  union {
    __IOM uint32_t OUTAR;                       /*!< Timerx Output Register                                                    */
    
