unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CK_PSCx    : 3;            /*!< HRTIM Timer x Clock prescaler                                             */
      __IOM uint32_t CONT       : 1;            /*!< Continuous mode                                                           */
      __IOM uint32_t RETRIG     : 1;            /*!< Re-triggerable mode                                                       */
      __IOM uint32_t HALF       : 1;            /*!< Half mode enable                                                          */
      __IOM uint32_t PSHPLL     : 1;            /*!< Push-Pull mode enable                                                     */
      __IOM uint32_t INTLVD     : 2;            /*!< Interleaved mode                                                          */
      __IOM uint32_t RSYNCU     : 1;            /*!< Re-Synchronized Update                                                    */
      __IOM uint32_t SYNCRSTx   : 1;            /*!< Synchronization Resets Timer x                                            */
      __IOM uint32_t SYNCSTRTx  : 1;            /*!< Synchronization Starts Timer x                                            */
      __IOM uint32_t DELCMP2    : 2;            /*!< Delayed CMP2 mode                                                         */
      __IOM uint32_t DELCMP4    : 2;            /*!< Delayed CMP4 mode                                                         */
      __IOM uint32_t TFU        : 1;            /*!< TFU                                                                       */
      __IOM uint32_t TxREPU     : 1;            /*!< Timer x Repetition update                                                 */
      __IOM uint32_t TxRSTU     : 1;            /*!< Timerx reset update                                                       */
      __IOM uint32_t TAU        : 1;            /*!< TAU                                                                       */
      __IOM uint32_t TBU        : 1;            /*!< TBU                                                                       */
            uint32_t            : 1;
      __IOM uint32_t TDU        : 1;            /*!< TDU                                                                       */
      __IOM uint32_t TEU        : 1;            /*!< TEU                                                                       */
      __IOM uint32_t MSTU       : 1;            /*!< Master Timer update                                                       */
      __IOM uint32_t DACSYNC    : 2;            /*!< AC Synchronization                                                        */
      __IOM uint32_t PREEN      : 1;            /*!< Preload enable                                                            */
      __IOM uint32_t UPDGAT     : 4;            /*!< Update Gating                                                             */
    } TIMCCR_b;
  } ;
  
  union {
    __IM  uint32_t TIMCISR;                     /*!< Timerx Interrupt Status Register                                          */
    
    struct {
      __IM  uint32_t CMP1       : 1;            /*!< Compare 1 Interrupt Flag                                                  */
      __IM  uint32_t CMP2       : 1;            /*!< Compare 2 Interrupt Flag                                                  */
      __IM  uint32_t CMP3       : 1;            /*!< Compare 3 Interrupt Flag                                                  */
      __IM  uint32_t CMP4       : 1;            /*!< Compare 4 Interrupt Flag                                                  */
      __IM  uint32_t REP        : 1;            /*!< Repetition Interrupt Flag                                                 */
            uint32_t            : 1;
      __IM  uint32_t UPD        : 1;            /*!< Update Interrupt Flag                                                     */
      __IM  uint32_t CPT1       : 1;            /*!< Capture1 Interrupt Flag                                                   */
      __IM  uint32_t CPT2       : 1;            /*!< Capture2 Interrupt Flag                                                   */
      __IM  uint32_t SETx1      : 1;            /*!< Output 1 Set Interrupt Flag                                               */
      __IM  uint32_t RSTx1      : 1;            /*!< Output 1 Reset Interrupt Flag                                             */
      __IM  uint32_t SETx2      : 1;            /*!< Output 2 Set Interrupt Flag                                               */
      __IM  uint32_t RSTx2      : 1;            /*!< Output 2 Reset Interrupt Flag                                             */
      __IM  uint32_t RST        : 1;            /*!< Reset Interrupt Flag                                                      */
      __IM  uint32_t DLYPRT     : 1;            /*!< Delayed Protection Flag                                                   */
            uint32_t            : 1;
      __IM  uint32_t CPPSTAT    : 1;            /*!< Current Push Pull Status                                                  */
      __IM  uint32_t IPPSTAT    : 1;            /*!< Idle Push Pull Status                                                     */
      __IM  uint32_t O1STAT     : 1;            /*!< Output 1 State                                                            */
      __IM  uint32_t O2STAT     : 1;            /*!< Output 2 State                                                            */
      __IM  uint32_t O1CPY      : 1;            /*!< Output 1 Copy                                                             */
      __IM  uint32_t O2CPY      : 1;            /*!< Output 2 Copy                                                             */
            uint32_t            : 10;
    } TIMCISR_b;
  } ;
  
  union {
    __OM  uint32_t TIMCICR;                     /*!< Timerx Interrupt Clear Register                                           */
    
    struct {
      __OM  uint32_t CMP1C      : 1;            /*!< Compare 1 Interrupt flag Clear                                            */
      __OM  uint32_t CMP2C      : 1;            /*!< Compare 2 Interrupt flag Clear                                            */
      __OM  uint32_t CMP3C      : 1;            /*!< Compare 3 Interrupt flag Clear                                            */
      __OM  uint32_t CMP4C      : 1;            /*!< Compare 4 Interrupt flag Clear                                            */
      __OM  uint32_t REPC       : 1;            /*!< Repetition Interrupt flag Clear                                           */
            uint32_t            : 1;
      __OM  uint32_t UPDC       : 1;            /*!< Update Interrupt flag Clear                                               */
      __OM  uint32_t CPT1C      : 1;            /*!< Capture1 Interrupt flag Clear                                             */
      __OM  uint32_t CPT2C      : 1;            /*!< Capture2 Interrupt flag Clear                                             */
      __OM  uint32_t SET1xC     : 1;            /*!< Output 1 Set flag Clear                                                   */
      __OM  uint32_t RSTx1C     : 1;            /*!< Output 1 Reset flag Clear                                                 */
      __OM  uint32_t SET2xC     : 1;            /*!< Output 2 Set flag Clear                                                   */
      __OM  uint32_t RSTx2C     : 1;            /*!< Output 2 Reset flag Clear                                                 */
      __OM  uint32_t RSTC       : 1;            /*!< Reset Interrupt flag Clear                                                */
      __OM  uint32_t DLYPRTC    : 1;            /*!< Delayed Protection Flag Clear                                             */
            uint32_t            : 17;
    } TIMCICR_b;
  } ;
  
  union {
    __IOM uint32_t TIMCDIER;                    /*!< TIMxDIER                                                                  */
    
