unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CMP1IE     : 1;            /*!< CMP1IE                                                                    */
      __IOM uint32_t CMP2IE     : 1;            /*!< CMP2IE                                                                    */
      __IOM uint32_t CMP3IE     : 1;            /*!< CMP3IE                                                                    */
      __IOM uint32_t CMP4IE     : 1;            /*!< CMP4IE                                                                    */
      __IOM uint32_t REPIE      : 1;            /*!< REPIE                                                                     */
            uint32_t            : 1;
      __IOM uint32_t UPDIE      : 1;            /*!< UPDIE                                                                     */
      __IOM uint32_t CPT1IE     : 1;            /*!< CPT1IE                                                                    */
      __IOM uint32_t CPT2IE     : 1;            /*!< CPT2IE                                                                    */
      __IOM uint32_t SET1xIE    : 1;            /*!< SET1xIE                                                                   */
      __IOM uint32_t RSTx1IE    : 1;            /*!< RSTx1IE                                                                   */
      __IOM uint32_t SETx2IE    : 1;            /*!< SETx2IE                                                                   */
      __IOM uint32_t RSTx2IE    : 1;            /*!< RSTx2IE                                                                   */
      __IOM uint32_t RSTIE      : 1;            /*!< RSTIE                                                                     */
      __IOM uint32_t DLYPRTIE   : 1;            /*!< DLYPRTIE                                                                  */
            uint32_t            : 1;
      __IOM uint32_t CMP1DE     : 1;            /*!< CMP1DE                                                                    */
      __IOM uint32_t CMP2DE     : 1;            /*!< CMP2DE                                                                    */
      __IOM uint32_t CMP3DE     : 1;            /*!< CMP3DE                                                                    */
      __IOM uint32_t CMP4DE     : 1;            /*!< CMP4DE                                                                    */
      __IOM uint32_t REPDE      : 1;            /*!< REPDE                                                                     */
            uint32_t            : 1;
      __IOM uint32_t UPDDE      : 1;            /*!< UPDDE                                                                     */
      __IOM uint32_t CPT1DE     : 1;            /*!< CPT1DE                                                                    */
      __IOM uint32_t CPT2DE     : 1;            /*!< CPT2DE                                                                    */
      __IOM uint32_t SET1xDE    : 1;            /*!< SET1xDE                                                                   */
      __IOM uint32_t RSTx1DE    : 1;            /*!< RSTx1DE                                                                   */
      __IOM uint32_t SETx2DE    : 1;            /*!< SETx2DE                                                                   */
      __IOM uint32_t RSTx2DE    : 1;            /*!< RSTx2DE                                                                   */
      __IOM uint32_t RSTDE      : 1;            /*!< RSTDE                                                                     */
      __IOM uint32_t DLYPRTDE   : 1;            /*!< DLYPRTDE                                                                  */
            uint32_t            : 1;
    } TIMCDIER_b;
  } ;
  
  union {
    __IOM uint32_t CNTCR;                       /*!< Timerx Counter Register                                                   */
    
    struct {
      __IOM uint32_t CNTx       : 16;           /*!< Timerx Counter value                                                      */
            uint32_t            : 16;
    } CNTCR_b;
  } ;
  
  union {
    __IOM uint32_t PERCR;                       /*!< Timerx Period Register                                                    */
    
    struct {
      __IOM uint32_t PERx       : 16;           /*!< Timerx Period value                                                       */
            uint32_t            : 16;
    } PERCR_b;
  } ;
  
  union {
    __IOM uint32_t REPCR;                       /*!< Timerx Repetition Register                                                */
    
    struct {
      __IOM uint32_t REPx       : 8;            /*!< Timerx Repetition counter value                                           */
            uint32_t            : 24;
    } REPCR_b;
  } ;
  
  union {
    __IOM uint32_t CMP1CR;                      /*!< Timerx Compare 1 Register                                                 */
    
    struct {
      __IOM uint32_t CMP1x      : 16;           /*!< Timerx Compare 1 value                                                    */
            uint32_t            : 16;
    } CMP1CR_b;
  } ;
  
  union {
    __IOM uint32_t CMP1CCR;                     /*!< Timerx Compare 1 Compound Register                                        */
    
    struct {
      __IOM uint32_t CMP1x      : 16;           /*!< Timerx Compare 1 value                                                    */
      __IOM uint32_t REPx       : 8;            /*!< Timerx Repetition value (aliased from HRTIM_REPx register)                */
            uint32_t            : 8;
    } CMP1CCR_b;
  } ;
  
  union {
    __IOM uint32_t CMP2CR;                      /*!< Timerx Compare 2 Register                                                 */
    
    struct {
      __IOM uint32_t CMP2x      : 16;           /*!< Timerx Compare 2 value                                                    */
            uint32_t            : 16;
    } CMP2CR_b;
  } ;
  
  union {
    __IOM uint32_t CMP3CR;                      /*!< Timerx Compare 3 Register                                                 */
    
