unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EE6LTCH    : 1;            /*!< External Event 6 latch                                                    */
      __IOM uint32_t EE6FLTR    : 4;            /*!< External Event 6 filter                                                   */
            uint32_t            : 1;
      __IOM uint32_t EE7LTCH    : 1;            /*!< External Event 7 latch                                                    */
      __IOM uint32_t EE7FLTR    : 4;            /*!< External Event 7 filter                                                   */
            uint32_t            : 1;
      __IOM uint32_t EE8LTCH    : 1;            /*!< External Event 8 latch                                                    */
      __IOM uint32_t EE8FLTR    : 4;            /*!< External Event 8 filter                                                   */
            uint32_t            : 1;
      __IOM uint32_t EE9LTCH    : 1;            /*!< External Event 9 latch                                                    */
      __IOM uint32_t EE9FLTR    : 4;            /*!< External Event 9 filter                                                   */
            uint32_t            : 1;
      __IOM uint32_t EE10LTCH   : 1;            /*!< External Event 10 latch                                                   */
      __IOM uint32_t EE10FLTR   : 4;            /*!< External Event 10 filter                                                  */
            uint32_t            : 3;
    } EEFCR2_b;
  } ;
  
  union {
    __IOM uint32_t RSTCR;                       /*!< TimerA Reset Register                                                     */
    
    struct {
      __IOM uint32_t TIMFCMP1   : 1;            /*!< Timer A Update reset                                                      */
      __IOM uint32_t UPDT       : 1;            /*!< Timer A Update reset                                                      */
      __IOM uint32_t CMP2       : 1;            /*!< Timer A compare 2 reset                                                   */
      __IOM uint32_t CMP4       : 1;            /*!< Timer A compare 4 reset                                                   */
      __IOM uint32_t MSTPER     : 1;            /*!< Master timer Period                                                       */
      __IOM uint32_t MSTCMP1    : 1;            /*!< Master compare 1                                                          */
      __IOM uint32_t MSTCMP2    : 1;            /*!< Master compare 2                                                          */
      __IOM uint32_t MSTCMP3    : 1;            /*!< Master compare 3                                                          */
      __IOM uint32_t MSTCMP4    : 1;            /*!< Master compare 4                                                          */
      __IOM uint32_t EXTEVNT1   : 1;            /*!< External Event 1                                                          */
      __IOM uint32_t EXTEVNT2   : 1;            /*!< External Event 2                                                          */
      __IOM uint32_t EXTEVNT3   : 1;            /*!< External Event 3                                                          */
      __IOM uint32_t EXTEVNT4   : 1;            /*!< External Event 4                                                          */
      __IOM uint32_t EXTEVNT5   : 1;            /*!< External Event 5                                                          */
      __IOM uint32_t EXTEVNT6   : 1;            /*!< External Event 6                                                          */
      __IOM uint32_t EXTEVNT7   : 1;            /*!< External Event 7                                                          */
      __IOM uint32_t EXTEVNT8   : 1;            /*!< External Event 8                                                          */
      __IOM uint32_t EXTEVNT9   : 1;            /*!< External Event 9                                                          */
      __IOM uint32_t EXTEVNT10  : 1;            /*!< External Event 10                                                         */
      __IOM uint32_t TIMACMP1   : 1;            /*!< Timer A Compare 1                                                         */
      __IOM uint32_t TIMACMP2   : 1;            /*!< Timer A Compare 2                                                         */
      __IOM uint32_t TIMACMP4   : 1;            /*!< Timer A Compare 4                                                         */
      __IOM uint32_t TIMBCMP1   : 1;            /*!< Timer B Compare 1                                                         */
      __IOM uint32_t TIMBCMP2   : 1;            /*!< Timer B Compare 2                                                         */
      __IOM uint32_t TIMBCMP4   : 1;            /*!< Timer B Compare 4                                                         */
      __IOM uint32_t TIMDCMP1   : 1;            /*!< Timer D Compare 1                                                         */
      __IOM uint32_t TIMDCMP2   : 1;            /*!< Timer D Compare 2                                                         */
      __IOM uint32_t TIMDCMP4   : 1;            /*!< Timer D Compare 4                                                         */
      __IOM uint32_t TIMECMP1   : 1;            /*!< Timer E Compare 1                                                         */
      __IOM uint32_t TIMECMP2   : 1;            /*!< Timer E Compare 2                                                         */
      __IOM uint32_t TIMECMP4   : 1;            /*!< Timer E Compare 4                                                         */
      __IOM uint32_t TIMFCPM2   : 1;            /*!< Timer F Compare 2                                                         */
    } RSTCR_b;
  } ;
  
  union {
    __IOM uint32_t CHPCR;                       /*!< Timerx Chopper Register                                                   */
    
