unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t POL1       : 1;            /*!< Output 1 polarity                                                         */
      __IOM uint32_t IDLEM1     : 1;            /*!< Output 1 Idle mode                                                        */
      __IOM uint32_t IDLES1     : 1;            /*!< Output 1 Idle State                                                       */
      __IOM uint32_t FAULT1     : 2;            /*!< Output 1 Fault state                                                      */
      __IOM uint32_t CHP1       : 1;            /*!< Output 1 Chopper enable                                                   */
      __IOM uint32_t DIDL1      : 1;            /*!< Output 1 Deadtime upon burst mode Idle entry                              */
      __IOM uint32_t DTEN       : 1;            /*!< Deadtime enable                                                           */
      __IOM uint32_t DLYPRTEN   : 1;            /*!< Delayed Protection Enable                                                 */
      __IOM uint32_t DLYPRT     : 3;            /*!< Delayed Protection                                                        */
            uint32_t            : 1;
      __IOM uint32_t BIAR       : 1;            /*!< Balanced Idle Automatic Resume                                            */
            uint32_t            : 2;
      __IOM uint32_t POL2       : 1;            /*!< Output 2 polarity                                                         */
      __IOM uint32_t IDLEM2     : 1;            /*!< Output 2 Idle mode                                                        */
      __IOM uint32_t IDLES2     : 1;            /*!< Output 2 Idle State                                                       */
      __IOM uint32_t FAULT2     : 2;            /*!< Output 2 Fault state                                                      */
      __IOM uint32_t CHP2       : 1;            /*!< Output 2 Chopper enable                                                   */
      __IOM uint32_t DIDL2      : 1;            /*!< Output 2 Deadtime upon burst mode Idle entry                              */
            uint32_t            : 8;
    } OUTCR_b;
  } ;
  
  union {
    __IOM uint32_t FLTCR;                       /*!< Timerx Fault Register                                                     */
    
    struct {
      __IOM uint32_t FLT1EN     : 1;            /*!< Fault 1 enable                                                            */
      __IOM uint32_t FLT2EN     : 1;            /*!< Fault 2 enable                                                            */
      __IOM uint32_t FLT3EN     : 1;            /*!< Fault 3 enable                                                            */
      __IOM uint32_t FLT4EN     : 1;            /*!< Fault 4 enable                                                            */
      __IOM uint32_t FLT5EN     : 1;            /*!< Fault 5 enable                                                            */
      __IOM uint32_t FLT6EN     : 1;            /*!< Fault 6 enable                                                            */
            uint32_t            : 25;
      __IOM uint32_t FLTLCK     : 1;            /*!< Fault sources Lock                                                        */
    } FLTCR_b;
  } ;
  
  union {
    __IOM uint32_t TIMCCR2;                     /*!< HRTIM Timerx Control Register 2                                           */
    
    struct {
      __IOM uint32_t DCDE       : 1;            /*!< Dual Channel DAC trigger enable                                           */
      __IOM uint32_t DCDS       : 1;            /*!< Dual Channel DAC Step trigger                                             */
      __IOM uint32_t DCDR       : 1;            /*!< Dual Channel DAC Reset trigger                                            */
            uint32_t            : 1;
      __IOM uint32_t UDM        : 1;            /*!< Up-Down Mode                                                              */
            uint32_t            : 1;
      __IOM uint32_t ROM        : 2;            /*!< Roll-Over Mode                                                            */
      __IOM uint32_t OUTROM     : 2;            /*!< Output Roll-Over Mode                                                     */
      __IOM uint32_t ADROM      : 2;            /*!< ADC Roll-Over Mode                                                        */
      __IOM uint32_t BMROM      : 2;            /*!< Burst Mode Roll-Over Mode                                                 */
      __IOM uint32_t FEROM      : 2;            /*!< Fault and Event Roll-Over Mode                                            */
      __IOM uint32_t GTCMP1     : 1;            /*!< Greater than Compare 1 PWM mode                                           */
      __IOM uint32_t GTCMP3     : 1;            /*!< Greater than Compare 3 PWM mode                                           */
            uint32_t            : 2;
      __IOM uint32_t TRGHLF     : 1;            /*!< Triggered-half mode                                                       */
            uint32_t            : 11;
    } TIMCCR2_b;
  } ;
  
  union {
    __IOM uint32_t CEEFR3;                      /*!< HRTIM Timerx External Event Filtering Register 3                          */
    
    struct {
      __IOM uint32_t EEVACE     : 1;            /*!< External Event A Counter Enable                                           */
      __IOM uint32_t EEVACRES   : 1;            /*!< External Event A Counter Reset                                            */
      __IOM uint32_t EEVARSTM   : 1;            /*!< External Event A Reset Mode                                               */
            uint32_t            : 1;
      __IOM uint32_t EEVASEL    : 4;            /*!< External Event A Selection                                                */
      __IOM uint32_t EEVACNT    : 6;            /*!< External Event A counter                                                  */
            uint32_t            : 18;
    } CEEFR3_b;
  } ;
} HRTIM_TIMC_Type;                              /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                        HRTIM_TIMD                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief High Resolution Timer: TIMD (HRTIM_TIMD)
  */

