unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t CMP1C      : 1;            /*!< Compare 1 Interrupt flag Clear                                            */
      __OM  uint32_t CMP2C      : 1;            /*!< Compare 2 Interrupt flag Clear                                            */
      __OM  uint32_t CMP3C      : 1;            /*!< Compare 3 Interrupt flag Clear                                            */
      __OM  uint32_t CMP4C      : 1;            /*!< Compare 4 Interrupt flag Clear                                            */
      __OM  uint32_t REPC       : 1;            /*!< Repetition Interrupt flag Clear                                           */
            uint32_t            : 1;
      __OM  uint32_t UPDC       : 1;            /*!< Update Interrupt flag Clear                                               */
      __OM  uint32_t CPT1C      : 1;            /*!< Capture1 Interrupt flag Clear                                             */
      __OM  uint32_t CPT2C      : 1;            /*!< Capture2 Interrupt flag Clear                                             */
      __OM  uint32_t SET1xC     : 1;            /*!< Output 1 Set flag Clear                                                   */
      __OM  uint32_t RSTx1C     : 1;            /*!< Output 1 Reset flag Clear                                                 */
      __OM  uint32_t SET2xC     : 1;            /*!< Output 2 Set flag Clear                                                   */
      __OM  uint32_t RSTx2C     : 1;            /*!< Output 2 Reset flag Clear                                                 */
      __OM  uint32_t RSTC       : 1;            /*!< Reset Interrupt flag Clear                                                */
      __OM  uint32_t DLYPRTC    : 1;            /*!< Delayed Protection Flag Clear                                             */
            uint32_t            : 17;
    } TIMEICR_b;
  } ;
  
  union {
    __IOM uint32_t TIMEDIER;                    /*!< TIMxDIER                                                                  */
    
    struct {
      __IOM uint32_t CMP1IE     : 1;            /*!< CMP1IE                                                                    */
      __IOM uint32_t CMP2IE     : 1;            /*!< CMP2IE                                                                    */
      __IOM uint32_t CMP3IE     : 1;            /*!< CMP3IE                                                                    */
      __IOM uint32_t CMP4IE     : 1;            /*!< CMP4IE                                                                    */
      __IOM uint32_t REPIE      : 1;            /*!< REPIE                                                                     */
            uint32_t            : 1;
      __IOM uint32_t UPDIE      : 1;            /*!< UPDIE                                                                     */
      __IOM uint32_t CPT1IE     : 1;            /*!< CPT1IE                                                                    */
      __IOM uint32_t CPT2IE     : 1;            /*!< CPT2IE                                                                    */
      __IOM uint32_t SET1xIE    : 1;            /*!< SET1xIE                                                                   */
      __IOM uint32_t RSTx1IE    : 1;            /*!< RSTx1IE                                                                   */
      __IOM uint32_t SETx2IE    : 1;            /*!< SETx2IE                                                                   */
      __IOM uint32_t RSTx2IE    : 1;            /*!< RSTx2IE                                                                   */
      __IOM uint32_t RSTIE      : 1;            /*!< RSTIE                                                                     */
      __IOM uint32_t DLYPRTIE   : 1;            /*!< DLYPRTIE                                                                  */
            uint32_t            : 1;
      __IOM uint32_t CMP1DE     : 1;            /*!< CMP1DE                                                                    */
      __IOM uint32_t CMP2DE     : 1;            /*!< CMP2DE                                                                    */
      __IOM uint32_t CMP3DE     : 1;            /*!< CMP3DE                                                                    */
      __IOM uint32_t CMP4DE     : 1;            /*!< CMP4DE                                                                    */
      __IOM uint32_t REPDE      : 1;            /*!< REPDE                                                                     */
            uint32_t            : 1;
      __IOM uint32_t UPDDE      : 1;            /*!< UPDDE                                                                     */
      __IOM uint32_t CPT1DE     : 1;            /*!< CPT1DE                                                                    */
      __IOM uint32_t CPT2DE     : 1;            /*!< CPT2DE                                                                    */
      __IOM uint32_t SET1xDE    : 1;            /*!< SET1xDE                                                                   */
      __IOM uint32_t RSTx1DE    : 1;            /*!< RSTx1DE                                                                   */
      __IOM uint32_t SETx2DE    : 1;            /*!< SETx2DE                                                                   */
      __IOM uint32_t RSTx2DE    : 1;            /*!< RSTx2DE                                                                   */
      __IOM uint32_t RSTDE      : 1;            /*!< RSTDE                                                                     */
      __IOM uint32_t DLYPRTDE   : 1;            /*!< DLYPRTDE                                                                  */
            uint32_t            : 1;
    } TIMEDIER_b;
  } ;
  
  union {
    __IOM uint32_t CNTER;                       /*!< Timerx Counter Register                                                   */
    
