unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t MUDIS      : 1;            /*!< Master Update Disable                                                     */
      __IOM uint32_t TAUDIS     : 1;            /*!< Timer A Update Disable                                                    */
      __IOM uint32_t TBUDIS     : 1;            /*!< Timer B Update Disable                                                    */
      __IOM uint32_t TCUDIS     : 1;            /*!< Timer C Update Disable                                                    */
      __IOM uint32_t TDUDIS     : 1;            /*!< Timer D Update Disable                                                    */
      __IOM uint32_t TEUDIS     : 1;            /*!< Timer E Update Disable                                                    */
      __IOM uint32_t TFUDIS     : 1;            /*!< Timer f Update Disable                                                    */
            uint32_t            : 9;
      __IOM uint32_t AD1USRC    : 3;            /*!< ADC Trigger 1 Update Source                                               */
      __IOM uint32_t AD2USRC    : 3;            /*!< ADC Trigger 2 Update Source                                               */
      __IOM uint32_t AD3USRC    : 3;            /*!< ADC Trigger 3 Update Source                                               */
      __IOM uint32_t AD4USRC    : 3;            /*!< ADC Trigger 4 Update Source                                               */
            uint32_t            : 4;
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< Control Register 2                                                        */
    
    struct {
      __IOM uint32_t MSWU       : 1;            /*!< Master Timer Software update                                              */
      __IOM uint32_t TASWU      : 1;            /*!< Timer A Software update                                                   */
      __IOM uint32_t TBSWU      : 1;            /*!< Timer B Software Update                                                   */
      __IOM uint32_t TCSWU      : 1;            /*!< Timer C Software Update                                                   */
      __IOM uint32_t TDSWU      : 1;            /*!< Timer D Software Update                                                   */
      __IOM uint32_t TESWU      : 1;            /*!< Timer E Software Update                                                   */
      __IOM uint32_t TFSWU      : 1;            /*!< Timer f Software Update                                                   */
            uint32_t            : 1;
      __IOM uint32_t MRST       : 1;            /*!< Master Counter software reset                                             */
      __IOM uint32_t TARST      : 1;            /*!< Timer A counter software reset                                            */
      __IOM uint32_t TBRST      : 1;            /*!< Timer B counter software reset                                            */
      __IOM uint32_t TCRST      : 1;            /*!< Timer C counter software reset                                            */
      __IOM uint32_t TDRST      : 1;            /*!< Timer D counter software reset                                            */
      __IOM uint32_t TERST      : 1;            /*!< Timer E counter software reset                                            */
      __IOM uint32_t TFRST      : 1;            /*!< Timer f counter software reset                                            */
            uint32_t            : 1;
      __IOM uint32_t SWPA       : 1;            /*!< Swap Timer A outputs                                                      */
      __IOM uint32_t SWPB       : 1;            /*!< Swap Timer B outputs                                                      */
      __IOM uint32_t SWPC       : 1;            /*!< Swap Timer C outputs                                                      */
      __IOM uint32_t SWPD       : 1;            /*!< Swap Timer D outputs                                                      */
      __IOM uint32_t SWPE       : 1;            /*!< Swap Timer E outputs                                                      */
      __IOM uint32_t SWPF       : 1;            /*!< Swap Timer F outputs                                                      */
            uint32_t            : 10;
    } CR2_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< Interrupt Status Register                                                 */
    
    struct {
      __IM  uint32_t FLT1       : 1;            /*!< Fault 1 Interrupt Flag                                                    */
      __IM  uint32_t FLT2       : 1;            /*!< Fault 2 Interrupt Flag                                                    */
      __IM  uint32_t FLT3       : 1;            /*!< Fault 3 Interrupt Flag                                                    */
      __IM  uint32_t FLT4       : 1;            /*!< Fault 4 Interrupt Flag                                                    */
      __IM  uint32_t FLT5       : 1;            /*!< Fault 5 Interrupt Flag                                                    */
      __IM  uint32_t SYSFLT     : 1;            /*!< System Fault Interrupt Flag                                               */
      __IM  uint32_t FLT6       : 1;            /*!< Fault 6 Interrupt Flag                                                    */
            uint32_t            : 9;
      __IM  uint32_t DLLRDY     : 1;            /*!< DLL Ready Interrupt Flag                                                  */
      __IM  uint32_t BMPER      : 1;            /*!< Burst mode Period Interrupt Flag                                          */
            uint32_t            : 14;
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< Interrupt Clear Register                                                  */
    
