unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t FLT1C      : 1;            /*!< Fault 1 Interrupt Flag Clear                                              */
      __OM  uint32_t FLT2C      : 1;            /*!< Fault 2 Interrupt Flag Clear                                              */
      __OM  uint32_t FLT3C      : 1;            /*!< Fault 3 Interrupt Flag Clear                                              */
      __OM  uint32_t FLT4C      : 1;            /*!< Fault 4 Interrupt Flag Clear                                              */
      __OM  uint32_t FLT5C      : 1;            /*!< Fault 5 Interrupt Flag Clear                                              */
      __OM  uint32_t SYSFLTC    : 1;            /*!< System Fault Interrupt Flag Clear                                         */
      __OM  uint32_t FLT6C      : 1;            /*!< Fault 6 Interrupt Flag Clear                                              */
            uint32_t            : 9;
      __OM  uint32_t DLLRDYC    : 1;            /*!< DLL Ready Interrupt flag Clear                                            */
      __OM  uint32_t BMPERC     : 1;            /*!< Burst mode period flag Clear                                              */
            uint32_t            : 14;
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< Interrupt Enable Register                                                 */
    
    struct {
      __IOM uint32_t FLT1IE     : 1;            /*!< Fault 1 Interrupt Enable                                                  */
      __IOM uint32_t FLT2IE     : 1;            /*!< Fault 2 Interrupt Enable                                                  */
      __IOM uint32_t FLT3IE     : 1;            /*!< Fault 3 Interrupt Enable                                                  */
      __IOM uint32_t FLT4IE     : 1;            /*!< Fault 4 Interrupt Enable                                                  */
      __IOM uint32_t FLT5IE     : 1;            /*!< Fault 5 Interrupt Enable                                                  */
      __IOM uint32_t SYSFLTE    : 1;            /*!< System Fault Interrupt Enable                                             */
      __IOM uint32_t FLT6IE     : 1;            /*!< Fault 6 Interrupt Enable                                                  */
            uint32_t            : 9;
      __IOM uint32_t DLLRDYIE   : 1;            /*!< DLL Ready Interrupt Enable                                                */
      __IOM uint32_t BMPERIE    : 1;            /*!< Burst mode period Interrupt Enable                                        */
            uint32_t            : 14;
    } IER_b;
  } ;
  
  union {
    __IOM uint32_t OENR;                        /*!< Output Enable Register                                                    */
    
    struct {
      __IOM uint32_t TA1OEN     : 1;            /*!< Timer A Output 1 Enable                                                   */
      __IOM uint32_t TA2OEN     : 1;            /*!< Timer A Output 2 Enable                                                   */
      __IOM uint32_t TB1OEN     : 1;            /*!< Timer B Output 1 Enable                                                   */
      __IOM uint32_t TB2OEN     : 1;            /*!< Timer B Output 2 Enable                                                   */
      __IOM uint32_t TC1OEN     : 1;            /*!< Timer C Output 1 Enable                                                   */
      __IOM uint32_t TC2OEN     : 1;            /*!< Timer C Output 2 Enable                                                   */
      __IOM uint32_t TD1OEN     : 1;            /*!< Timer D Output 1 Enable                                                   */
      __IOM uint32_t TD2OEN     : 1;            /*!< Timer D Output 2 Enable                                                   */
      __IOM uint32_t TE1OEN     : 1;            /*!< Timer E Output 1 Enable                                                   */
      __IOM uint32_t TE2OEN     : 1;            /*!< Timer E Output 2 Enable                                                   */
      __IOM uint32_t TF1OEN     : 1;            /*!< Timer F Output 1 Enable                                                   */
      __IOM uint32_t TF2OEN     : 1;            /*!< Timer F Output 2 Enable                                                   */
            uint32_t            : 20;
    } OENR_b;
  } ;
  
  union {
    __OM  uint32_t ODISR;                       /*!< ODISR                                                                     */
    
    struct {
      __OM  uint32_t TA1ODIS    : 1;            /*!< TA1ODIS                                                                   */
      __OM  uint32_t TA2ODIS    : 1;            /*!< TA2ODIS                                                                   */
      __OM  uint32_t TB1ODIS    : 1;            /*!< TB1ODIS                                                                   */
      __OM  uint32_t TB2ODIS    : 1;            /*!< TB2ODIS                                                                   */
      __OM  uint32_t TC1ODIS    : 1;            /*!< TC1ODIS                                                                   */
      __OM  uint32_t TC2ODIS    : 1;            /*!< TC2ODIS                                                                   */
      __OM  uint32_t TD1ODIS    : 1;            /*!< TD1ODIS                                                                   */
      __OM  uint32_t TD2ODIS    : 1;            /*!< TD2ODIS                                                                   */
      __OM  uint32_t TE1ODIS    : 1;            /*!< TE1ODIS                                                                   */
      __OM  uint32_t TE2ODIS    : 1;            /*!< TE2ODIS                                                                   */
      __OM  uint32_t TF1ODIS    : 1;            /*!< TF1ODIS                                                                   */
      __OM  uint32_t TF2ODIS    : 1;            /*!< TF2ODIS                                                                   */
            uint32_t            : 20;
    } ODISR_b;
  } ;
  
  union {
    __IM  uint32_t ODSR;                        /*!< Output Disable Status Register                                            */
    
