unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t TA1ODS     : 1;            /*!< Timer A Output 1 disable status                                           */
      __IM  uint32_t TA2ODS     : 1;            /*!< Timer A Output 2 disable status                                           */
      __IM  uint32_t TB1ODS     : 1;            /*!< Timer B Output 1 disable status                                           */
      __IM  uint32_t TB2ODS     : 1;            /*!< Timer B Output 2 disable status                                           */
      __IM  uint32_t TC1ODS     : 1;            /*!< Timer C Output 1 disable status                                           */
      __IM  uint32_t TC2ODS     : 1;            /*!< Timer C Output 2 disable status                                           */
      __IM  uint32_t TD1ODS     : 1;            /*!< Timer D Output 1 disable status                                           */
      __IM  uint32_t TD2ODS     : 1;            /*!< Timer D Output 2 disable status                                           */
      __IM  uint32_t TE1ODS     : 1;            /*!< Timer E Output 1 disable status                                           */
      __IM  uint32_t TE2ODS     : 1;            /*!< Timer E Output 2 disable status                                           */
      __IM  uint32_t TF1ODS     : 1;            /*!< TF1ODS                                                                    */
      __IM  uint32_t TF2ODS     : 1;            /*!< TF2ODS                                                                    */
            uint32_t            : 20;
    } ODSR_b;
  } ;
  
  union {
    __IOM uint32_t BMCR;                        /*!< Burst Mode Control Register                                               */
    
    struct {
      __IOM uint32_t BME        : 1;            /*!< Burst Mode enable                                                         */
      __IOM uint32_t BMOM       : 1;            /*!< Burst Mode operating mode                                                 */
      __IOM uint32_t BMCLK      : 4;            /*!< Burst Mode Clock source                                                   */
      __IOM uint32_t BMPRSC     : 4;            /*!< Burst Mode Prescaler                                                      */
      __IOM uint32_t BMPREN     : 1;            /*!< Burst Mode Preload Enable                                                 */
            uint32_t            : 5;
      __IOM uint32_t MTBM       : 1;            /*!< Master Timer Burst Mode                                                   */
      __IOM uint32_t TABM       : 1;            /*!< Timer A Burst Mode                                                        */
      __IOM uint32_t TBBM       : 1;            /*!< Timer B Burst Mode                                                        */
      __IOM uint32_t TCBM       : 1;            /*!< Timer C Burst Mode                                                        */
      __IOM uint32_t TDBM       : 1;            /*!< Timer D Burst Mode                                                        */
      __IOM uint32_t TEBM       : 1;            /*!< Timer E Burst Mode                                                        */
      __IOM uint32_t TFBM       : 1;            /*!< Timer f Burst Mode                                                        */
            uint32_t            : 8;
      __IOM uint32_t BMSTAT     : 1;            /*!< Burst Mode Status                                                         */
    } BMCR_b;
  } ;
  
  union {
    __IOM uint32_t BMTRG;                       /*!< BMTRG                                                                     */
    
    struct {
      __IOM uint32_t SW         : 1;            /*!< SW                                                                        */
      __IOM uint32_t MSTRST     : 1;            /*!< MSTRST                                                                    */
      __IOM uint32_t MSTREP     : 1;            /*!< MSTREP                                                                    */
      __IOM uint32_t MSTCMP1    : 1;            /*!< MSTCMP1                                                                   */
      __IOM uint32_t MSTCMP2    : 1;            /*!< MSTCMP2                                                                   */
      __IOM uint32_t MSTCMP3    : 1;            /*!< MSTCMP3                                                                   */
      __IOM uint32_t MSTCMP4    : 1;            /*!< MSTCMP4                                                                   */
      __IOM uint32_t TARST      : 1;            /*!< TARST                                                                     */
      __IOM uint32_t TAREP      : 1;            /*!< TAREP                                                                     */
      __IOM uint32_t TACMP1     : 1;            /*!< TACMP1                                                                    */
      __IOM uint32_t TACMP2     : 1;            /*!< TACMP2                                                                    */
      __IOM uint32_t TBRST      : 1;            /*!< TBRST                                                                     */
      __IOM uint32_t TBREP      : 1;            /*!< TBREP                                                                     */
      __IOM uint32_t TBCMP1     : 1;            /*!< TBCMP1                                                                    */
      __IOM uint32_t TBCMP2     : 1;            /*!< TBCMP2                                                                    */
      __IOM uint32_t TCRST      : 1;            /*!< TCRST                                                                     */
      __IOM uint32_t TCREP      : 1;            /*!< TCREP                                                                     */
      __IOM uint32_t TCCMP1     : 1;            /*!< TCCMP1                                                                    */
      __IOM uint32_t TCCMP2     : 1;            /*!< TCCMP2                                                                    */
      __IOM uint32_t TDRST      : 1;            /*!< TDRST                                                                     */
      __IOM uint32_t TDREP      : 1;            /*!< TDREP                                                                     */
      __IOM uint32_t TDCMP1     : 1;            /*!< TDCMP1                                                                    */
      __IOM uint32_t TDCMP2     : 1;            /*!< TDCMP2                                                                    */
      __IOM uint32_t TERST      : 1;            /*!< TERST                                                                     */
      __IOM uint32_t TEREP      : 1;            /*!< TEREP                                                                     */
      __IOM uint32_t TECMP1     : 1;            /*!< TECMP1                                                                    */
      __IOM uint32_t TECMP2     : 1;            /*!< TECMP2                                                                    */
      __IOM uint32_t TDEEV7     : 1;            /*!< TDEEV7                                                                    */
      __IOM uint32_t TDEEV8     : 1;            /*!< TDEEV8                                                                    */
      __IOM uint32_t EEV7       : 1;            /*!< EEV7                                                                      */
      __IOM uint32_t EEV8       : 1;            /*!< EEV8                                                                      */
      __IOM uint32_t OCHPEV     : 1;            /*!< OCHPEV                                                                    */
    } BMTRG_b;
  } ;
  
  union {
    __IOM uint32_t BMCMPR;                      /*!< BMCMPR                                                                    */
    
