unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t BMCMP      : 16;           /*!< BMCMP                                                                     */
            uint32_t            : 16;
    } BMCMPR_b;
  } ;
  
  union {
    __IOM uint32_t BMPER;                       /*!< Burst Mode Period Register                                                */
    
    struct {
      __IOM uint32_t BMPER      : 16;           /*!< Burst mode Period                                                         */
            uint32_t            : 16;
    } BMPER_b;
  } ;
  
  union {
    __IOM uint32_t EECR1;                       /*!< Timer External Event Control Register 1                                   */
    
    struct {
      __IOM uint32_t EE1SRC     : 2;            /*!< External Event 1 Source                                                   */
      __IOM uint32_t EE1POL     : 1;            /*!< External Event 1 Polarity                                                 */
      __IOM uint32_t EE1SNS     : 2;            /*!< External Event 1 Sensitivity                                              */
      __IOM uint32_t EE1FAST    : 1;            /*!< External Event 1 Fast mode                                                */
      __IOM uint32_t EE2SRC     : 2;            /*!< External Event 2 Source                                                   */
      __IOM uint32_t EE2POL     : 1;            /*!< External Event 2 Polarity                                                 */
      __IOM uint32_t EE2SNS     : 2;            /*!< External Event 2 Sensitivity                                              */
      __IOM uint32_t EE2FAST    : 1;            /*!< External Event 2 Fast mode                                                */
      __IOM uint32_t EE3SRC     : 2;            /*!< External Event 3 Source                                                   */
      __IOM uint32_t EE3POL     : 1;            /*!< External Event 3 Polarity                                                 */
      __IOM uint32_t EE3SNS     : 2;            /*!< External Event 3 Sensitivity                                              */
      __IOM uint32_t EE3FAST    : 1;            /*!< External Event 3 Fast mode                                                */
      __IOM uint32_t EE4SRC     : 2;            /*!< External Event 4 Source                                                   */
      __IOM uint32_t EE4POL     : 1;            /*!< External Event 4 Polarity                                                 */
      __IOM uint32_t EE4SNS     : 2;            /*!< External Event 4 Sensitivity                                              */
      __IOM uint32_t EE4FAST    : 1;            /*!< External Event 4 Fast mode                                                */
      __IOM uint32_t EE5SRC     : 2;            /*!< External Event 5 Source                                                   */
      __IOM uint32_t EE5POL     : 1;            /*!< External Event 5 Polarity                                                 */
      __IOM uint32_t EE5SNS     : 2;            /*!< External Event 5 Sensitivity                                              */
      __IOM uint32_t EE5FAST    : 1;            /*!< External Event 5 Fast mode                                                */
            uint32_t            : 2;
    } EECR1_b;
  } ;
  
  union {
    __IOM uint32_t EECR2;                       /*!< Timer External Event Control Register 2                                   */
    
    struct {
      __IOM uint32_t EE6SRC     : 2;            /*!< EE6SRC                                                                    */
      __IOM uint32_t EE6POL     : 1;            /*!< EE6POL                                                                    */
      __IOM uint32_t EE6SNS     : 2;            /*!< EE6SNS                                                                    */
            uint32_t            : 1;
      __IOM uint32_t EE7SRC     : 2;            /*!< EE7SRC                                                                    */
      __IOM uint32_t EE7POL     : 1;            /*!< EE7POL                                                                    */
      __IOM uint32_t EE7SNS     : 2;            /*!< EE7SNS                                                                    */
            uint32_t            : 1;
      __IOM uint32_t EE8SRC     : 2;            /*!< EE8SRC                                                                    */
      __IOM uint32_t EE8POL     : 1;            /*!< EE8POL                                                                    */
      __IOM uint32_t EE8SNS     : 2;            /*!< EE8SNS                                                                    */
            uint32_t            : 1;
      __IOM uint32_t EE9SRC     : 2;            /*!< EE9SRC                                                                    */
      __IOM uint32_t EE9POL     : 1;            /*!< EE9POL                                                                    */
      __IOM uint32_t EE9SNS     : 2;            /*!< EE9SNS                                                                    */
            uint32_t            : 1;
      __IOM uint32_t EE10SRC    : 2;            /*!< EE10SRC                                                                   */
      __IOM uint32_t EE10POL    : 1;            /*!< EE10POL                                                                   */
      __IOM uint32_t EE10SNS    : 2;            /*!< EE10SNS                                                                   */
            uint32_t            : 3;
    } EECR2_b;
  } ;
  
  union {
    __IOM uint32_t EECR3;                       /*!< Timer External Event Control Register 3                                   */
    
    struct {
      __IOM uint32_t EE6F       : 4;            /*!< EE6F                                                                      */
            uint32_t            : 2;
      __IOM uint32_t EE7F       : 4;            /*!< EE7F                                                                      */
            uint32_t            : 2;
      __IOM uint32_t EE8F       : 4;            /*!< EE8F                                                                      */
            uint32_t            : 2;
      __IOM uint32_t EE9F       : 4;            /*!< EE9F                                                                      */
            uint32_t            : 2;
      __IOM uint32_t EE10F      : 4;            /*!< EE10F                                                                     */
            uint32_t            : 2;
      __IOM uint32_t EEVSD      : 2;            /*!< EEVSD                                                                     */
    } EECR3_b;
  } ;
  
  union {
    __IOM uint32_t ADC1R;                       /*!< ADC Trigger 1 Register                                                    */
    
