unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t AD1MC1     : 1;            /*!< ADC trigger 1 on Master Compare 1                                         */
      __IOM uint32_t AD1MC2     : 1;            /*!< ADC trigger 1 on Master Compare 2                                         */
      __IOM uint32_t AD1MC3     : 1;            /*!< ADC trigger 1 on Master Compare 3                                         */
      __IOM uint32_t AD1MC4     : 1;            /*!< ADC trigger 1 on Master Compare 4                                         */
      __IOM uint32_t AD1MPER    : 1;            /*!< ADC trigger 1 on Master Period                                            */
      __IOM uint32_t AD1EEV1    : 1;            /*!< ADC trigger 1 on External Event 1                                         */
      __IOM uint32_t AD1EEV2    : 1;            /*!< ADC trigger 1 on External Event 2                                         */
      __IOM uint32_t AD1EEV3    : 1;            /*!< ADC trigger 1 on External Event 3                                         */
      __IOM uint32_t AD1EEV4    : 1;            /*!< ADC trigger 1 on External Event 4                                         */
      __IOM uint32_t AD1EEV5    : 1;            /*!< ADC trigger 1 on External Event 5                                         */
      __IOM uint32_t AD1TAC2    : 1;            /*!< ADC trigger 1 on Timer A compare 2                                        */
      __IOM uint32_t AD1TAC3    : 1;            /*!< ADC trigger 1 on Timer A compare 3                                        */
      __IOM uint32_t AD1TAC4    : 1;            /*!< ADC trigger 1 on Timer A compare 4                                        */
      __IOM uint32_t AD1TAPER   : 1;            /*!< ADC trigger 1 on Timer A Period                                           */
      __IOM uint32_t AD1TARST   : 1;            /*!< ADC trigger 1 on Timer A Reset                                            */
      __IOM uint32_t AD1TBC2    : 1;            /*!< ADC trigger 1 on Timer B compare 2                                        */
      __IOM uint32_t AD1TBC3    : 1;            /*!< ADC trigger 1 on Timer B compare 3                                        */
      __IOM uint32_t AD1TBC4    : 1;            /*!< ADC trigger 1 on Timer B compare 4                                        */
      __IOM uint32_t AD1TBPER   : 1;            /*!< ADC trigger 1 on Timer B Period                                           */
      __IOM uint32_t AD1TBRST   : 1;            /*!< ADC trigger 1 on Timer B Reset                                            */
      __IOM uint32_t AD1TCC2    : 1;            /*!< ADC trigger 1 on Timer C compare 2                                        */
      __IOM uint32_t AD1TCC3    : 1;            /*!< ADC trigger 1 on Timer C compare 3                                        */
      __IOM uint32_t AD1TCC4    : 1;            /*!< ADC trigger 1 on Timer C compare 4                                        */
      __IOM uint32_t AD1TCPER   : 1;            /*!< ADC trigger 1 on Timer C Period                                           */
      __IOM uint32_t AD1TDC2    : 1;            /*!< ADC trigger 1 on Timer D compare 2                                        */
      __IOM uint32_t AD1TDC3    : 1;            /*!< ADC trigger 1 on Timer D compare 3                                        */
      __IOM uint32_t AD1TDC4    : 1;            /*!< ADC trigger 1 on Timer D compare 4                                        */
      __IOM uint32_t AD1TDPER   : 1;            /*!< ADC trigger 1 on Timer D Period                                           */
      __IOM uint32_t AD1TEC2    : 1;            /*!< ADC trigger 1 on Timer E compare 2                                        */
      __IOM uint32_t AD1TEC3    : 1;            /*!< ADC trigger 1 on Timer E compare 3                                        */
      __IOM uint32_t AD1TEC4    : 1;            /*!< ADC trigger 1 on Timer E compare 4                                        */
      __IOM uint32_t AD1TEPER   : 1;            /*!< ADC trigger 1 on Timer E Period                                           */
    } ADC1R_b;
  } ;
  
  union {
    __IOM uint32_t ADC2R;                       /*!< ADC Trigger 2 Register                                                    */
    
    struct {
      __IOM uint32_t AD2MC1     : 1;            /*!< ADC trigger 2 on Master Compare 1                                         */
      __IOM uint32_t AD2MC2     : 1;            /*!< ADC trigger 2 on Master Compare 2                                         */
      __IOM uint32_t AD2MC3     : 1;            /*!< ADC trigger 2 on Master Compare 3                                         */
      __IOM uint32_t AD2MC4     : 1;            /*!< ADC trigger 2 on Master Compare 4                                         */
      __IOM uint32_t AD2MPER    : 1;            /*!< ADC trigger 2 on Master Period                                            */
      __IOM uint32_t AD2EEV6    : 1;            /*!< ADC trigger 2 on External Event 6                                         */
      __IOM uint32_t AD2EEV7    : 1;            /*!< ADC trigger 2 on External Event 7                                         */
      __IOM uint32_t AD2EEV8    : 1;            /*!< ADC trigger 2 on External Event 8                                         */
      __IOM uint32_t AD2EEV9    : 1;            /*!< ADC trigger 2 on External Event 9                                         */
      __IOM uint32_t AD2EEV10   : 1;            /*!< ADC trigger 2 on External Event 10                                        */
      __IOM uint32_t AD2TAC2    : 1;            /*!< ADC trigger 2 on Timer A compare 2                                        */
      __IOM uint32_t AD2TAC3    : 1;            /*!< ADC trigger 2 on Timer A compare 3                                        */
      __IOM uint32_t AD2TAC4    : 1;            /*!< ADC trigger 2 on Timer A compare 4                                        */
      __IOM uint32_t AD2TAPER   : 1;            /*!< ADC trigger 2 on Timer A Period                                           */
      __IOM uint32_t AD2TBC2    : 1;            /*!< ADC trigger 2 on Timer B compare 2                                        */
      __IOM uint32_t AD2TBC3    : 1;            /*!< ADC trigger 2 on Timer B compare 3                                        */
      __IOM uint32_t AD2TBC4    : 1;            /*!< ADC trigger 2 on Timer B compare 4                                        */
      __IOM uint32_t AD2TBPER   : 1;            /*!< ADC trigger 2 on Timer B Period                                           */
      __IOM uint32_t AD2TCC2    : 1;            /*!< ADC trigger 2 on Timer C compare 2                                        */
      __IOM uint32_t AD2TCC3    : 1;            /*!< ADC trigger 2 on Timer C compare 3                                        */
      __IOM uint32_t AD2TCC4    : 1;            /*!< ADC trigger 2 on Timer C compare 4                                        */
      __IOM uint32_t AD2TCPER   : 1;            /*!< ADC trigger 2 on Timer C Period                                           */
      __IOM uint32_t AD2TCRST   : 1;            /*!< ADC trigger 2 on Timer C Reset                                            */
      __IOM uint32_t AD2TDC2    : 1;            /*!< ADC trigger 2 on Timer D compare 2                                        */
      __IOM uint32_t AD2TDC3    : 1;            /*!< ADC trigger 2 on Timer D compare 3                                        */
      __IOM uint32_t AD2TDC4    : 1;            /*!< ADC trigger 2 on Timer D compare 4                                        */
      __IOM uint32_t AD2TDPER   : 1;            /*!< ADC trigger 2 on Timer D Period                                           */
      __IOM uint32_t AD2TDRST   : 1;            /*!< ADC trigger 2 on Timer D Reset                                            */
      __IOM uint32_t AD2TEC2    : 1;            /*!< ADC trigger 2 on Timer E compare 2                                        */
      __IOM uint32_t AD2TEC3    : 1;            /*!< ADC trigger 2 on Timer E compare 3                                        */
      __IOM uint32_t AD2TEC4    : 1;            /*!< ADC trigger 2 on Timer E compare 4                                        */
      __IOM uint32_t AD2TERST   : 1;            /*!< ADC trigger 2 on Timer E Reset                                            */
    } ADC2R_b;
  } ;
  
  union {
    __IOM uint32_t ADC3R;                       /*!< ADC Trigger 3 Register                                                    */
    
