unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t AD1MC1     : 1;            /*!< AD1MC1                                                                    */
      __IOM uint32_t AD1MC2     : 1;            /*!< AD1MC2                                                                    */
      __IOM uint32_t AD1MC3     : 1;            /*!< AD1MC3                                                                    */
      __IOM uint32_t AD1MC4     : 1;            /*!< AD1MC4                                                                    */
      __IOM uint32_t AD1MPER    : 1;            /*!< AD1MPER                                                                   */
      __IOM uint32_t AD1EEV1    : 1;            /*!< AD1EEV1                                                                   */
      __IOM uint32_t AD1EEV2    : 1;            /*!< AD1EEV2                                                                   */
      __IOM uint32_t AD1EEV3    : 1;            /*!< AD1EEV3                                                                   */
      __IOM uint32_t AD1EEV4    : 1;            /*!< AD1EEV4                                                                   */
      __IOM uint32_t AD1EEV5    : 1;            /*!< AD1EEV5                                                                   */
      __IOM uint32_t AD1TAC2    : 1;            /*!< AD1TAC2                                                                   */
      __IOM uint32_t AD1TAC3    : 1;            /*!< AD1TAC3                                                                   */
      __IOM uint32_t AD1TAC4    : 1;            /*!< AD1TAC4                                                                   */
      __IOM uint32_t AD1TAPER   : 1;            /*!< AD1TAPER                                                                  */
      __IOM uint32_t AD1TARST   : 1;            /*!< AD1TARST                                                                  */
      __IOM uint32_t AD1TBC2    : 1;            /*!< AD1TBC2                                                                   */
      __IOM uint32_t AD1TBC3    : 1;            /*!< AD1TBC3                                                                   */
      __IOM uint32_t AD1TBC4    : 1;            /*!< AD1TBC4                                                                   */
      __IOM uint32_t AD1TBPER   : 1;            /*!< AD1TBPER                                                                  */
      __IOM uint32_t AD1TBRST   : 1;            /*!< AD1TBRST                                                                  */
      __IOM uint32_t AD1TCC2    : 1;            /*!< AD1TCC2                                                                   */
      __IOM uint32_t AD1TCC3    : 1;            /*!< AD1TCC3                                                                   */
      __IOM uint32_t AD1TCC4    : 1;            /*!< AD1TCC4                                                                   */
      __IOM uint32_t AD1TCPER   : 1;            /*!< AD1TCPER                                                                  */
      __IOM uint32_t AD1TDC2    : 1;            /*!< AD1TDC2                                                                   */
      __IOM uint32_t AD1TDC3    : 1;            /*!< AD1TDC3                                                                   */
      __IOM uint32_t AD1TDC4    : 1;            /*!< AD1TDC4                                                                   */
      __IOM uint32_t AD1TDPER   : 1;            /*!< AD1TDPER                                                                  */
      __IOM uint32_t AD1TEC2    : 1;            /*!< AD1TEC2                                                                   */
      __IOM uint32_t AD1TEC3    : 1;            /*!< AD1TEC3                                                                   */
      __IOM uint32_t AD1TEC4    : 1;            /*!< AD1TEC4                                                                   */
      __IOM uint32_t AD1TEPER   : 1;            /*!< AD1TEPER                                                                  */
    } ADC3R_b;
  } ;
  
  union {
    __IOM uint32_t ADC4R;                       /*!< ADC Trigger 4 Register                                                    */
    
    struct {
      __IOM uint32_t AD2MC1     : 1;            /*!< AD2MC1                                                                    */
      __IOM uint32_t AD2MC2     : 1;            /*!< AD2MC2                                                                    */
      __IOM uint32_t AD2MC3     : 1;            /*!< AD2MC3                                                                    */
      __IOM uint32_t AD2MC4     : 1;            /*!< AD2MC4                                                                    */
      __IOM uint32_t AD2MPER    : 1;            /*!< AD2MPER                                                                   */
      __IOM uint32_t AD2EEV6    : 1;            /*!< AD2EEV6                                                                   */
      __IOM uint32_t AD2EEV7    : 1;            /*!< AD2EEV7                                                                   */
      __IOM uint32_t AD2EEV8    : 1;            /*!< AD2EEV8                                                                   */
      __IOM uint32_t AD2EEV9    : 1;            /*!< AD2EEV9                                                                   */
      __IOM uint32_t AD2EEV10   : 1;            /*!< AD2EEV10                                                                  */
      __IOM uint32_t AD2TAC2    : 1;            /*!< AD2TAC2                                                                   */
      __IOM uint32_t AD2TAC3    : 1;            /*!< AD2TAC3                                                                   */
      __IOM uint32_t AD2TAC4    : 1;            /*!< AD2TAC4                                                                   */
      __IOM uint32_t AD2TAPER   : 1;            /*!< AD2TAPER                                                                  */
      __IOM uint32_t AD2TBC2    : 1;            /*!< AD2TBC2                                                                   */
      __IOM uint32_t AD2TBC3    : 1;            /*!< AD2TBC3                                                                   */
      __IOM uint32_t AD2TBC4    : 1;            /*!< AD2TBC4                                                                   */
      __IOM uint32_t AD2TBPER   : 1;            /*!< AD2TBPER                                                                  */
      __IOM uint32_t AD2TCC2    : 1;            /*!< AD2TCC2                                                                   */
      __IOM uint32_t AD2TCC3    : 1;            /*!< AD2TCC3                                                                   */
      __IOM uint32_t AD2TCC4    : 1;            /*!< AD2TCC4                                                                   */
      __IOM uint32_t AD2TCPER   : 1;            /*!< AD2TCPER                                                                  */
      __IOM uint32_t AD2TCRST   : 1;            /*!< AD2TCRST                                                                  */
      __IOM uint32_t AD2TDC2    : 1;            /*!< AD2TDC2                                                                   */
      __IOM uint32_t AD2TDC3    : 1;            /*!< AD2TDC3                                                                   */
      __IOM uint32_t AD2TDC4    : 1;            /*!< AD2TDC4                                                                   */
      __IOM uint32_t AD2TDPER   : 1;            /*!< AD2TDPER                                                                  */
      __IOM uint32_t AD2TDRST   : 1;            /*!< AD2TDRST                                                                  */
      __IOM uint32_t AD2TEC2    : 1;            /*!< AD2TEC2                                                                   */
      __IOM uint32_t AD2TEC3    : 1;            /*!< AD2TEC3                                                                   */
      __IOM uint32_t AD2TEC4    : 1;            /*!< AD2TEC4                                                                   */
      __IOM uint32_t AD2TERST   : 1;            /*!< AD2TERST                                                                  */
    } ADC4R_b;
  } ;
  
  union {
    __IOM uint32_t DLLCR;                       /*!< DLL Control Register                                                      */
    
