unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CAL        : 1;            /*!< DLL Calibration Start                                                     */
      __IOM uint32_t CALEN      : 1;            /*!< DLL Calibration Enable                                                    */
      __IOM uint32_t CALRTE     : 2;            /*!< DLL Calibration rate                                                      */
            uint32_t            : 28;
    } DLLCR_b;
  } ;
  
  union {
    __IOM uint32_t FLTINR1;                     /*!< HRTIM Fault Input Register 1                                              */
    
    struct {
      __IOM uint32_t FLT1E      : 1;            /*!< FLT1E                                                                     */
      __IOM uint32_t FLT1P      : 1;            /*!< FLT1P                                                                     */
      __IOM uint32_t FLT1SRC    : 1;            /*!< FLT1SRC                                                                   */
      __IOM uint32_t FLT1F      : 4;            /*!< FLT1F                                                                     */
      __IOM uint32_t FLT1LCK    : 1;            /*!< FLT1LCK                                                                   */
      __IOM uint32_t FLT2E      : 1;            /*!< FLT2E                                                                     */
      __IOM uint32_t FLT2P      : 1;            /*!< FLT2P                                                                     */
      __IOM uint32_t FLT2SRC    : 1;            /*!< FLT2SRC                                                                   */
      __IOM uint32_t FLT2F      : 4;            /*!< FLT2F                                                                     */
      __IOM uint32_t FLT2LCK    : 1;            /*!< FLT2LCK                                                                   */
      __IOM uint32_t FLT3E      : 1;            /*!< FLT3E                                                                     */
      __IOM uint32_t FLT3P      : 1;            /*!< FLT3P                                                                     */
      __IOM uint32_t FLT3SRC    : 1;            /*!< FLT3SRC                                                                   */
      __IOM uint32_t FLT3F      : 4;            /*!< FLT3F                                                                     */
      __IOM uint32_t FLT3LCK    : 1;            /*!< FLT3LCK                                                                   */
      __IOM uint32_t FLT4E      : 1;            /*!< FLT4E                                                                     */
      __IOM uint32_t FLT4P      : 1;            /*!< FLT4P                                                                     */
      __IOM uint32_t FLT4SRC    : 1;            /*!< FLT4SRC                                                                   */
      __IOM uint32_t FLT4F      : 4;            /*!< FLT4F                                                                     */
      __IOM uint32_t FLT4LCK    : 1;            /*!< FLT4LCK                                                                   */
    } FLTINR1_b;
  } ;
  
  union {
    __IOM uint32_t FLTINR2;                     /*!< HRTIM Fault Input Register 2                                              */
    
    struct {
      __IOM uint32_t FLT5E      : 1;            /*!< FLT5E                                                                     */
      __IOM uint32_t FLT5P      : 1;            /*!< FLT5P                                                                     */
      __IOM uint32_t FLT5SRC    : 1;            /*!< FLT5SRC                                                                   */
      __IOM uint32_t FLT5F      : 4;            /*!< FLT5F                                                                     */
      __IOM uint32_t FLT5LCK    : 1;            /*!< FLT5LCK                                                                   */
      __IOM uint32_t FLT6E      : 1;            /*!< FLT6E                                                                     */
      __IOM uint32_t FLT6P      : 1;            /*!< FLT6P                                                                     */
      __IOM uint32_t FLT6SRC_0  : 1;            /*!< FLT6F                                                                     */
      __IOM uint32_t FLT6F      : 4;            /*!< FLT6F                                                                     */
      __IOM uint32_t FLT6LCK    : 1;            /*!< FLT6LCK                                                                   */
      __IOM uint32_t FLT1SRC_1  : 1;            /*!< FLT1SRC_1                                                                 */
      __IOM uint32_t FLT2SRC_1  : 1;            /*!< FLT2SRC_1                                                                 */
      __IOM uint32_t FLT3SRC_1  : 1;            /*!< FLT3SRC_1                                                                 */
      __IOM uint32_t FLT4SRC_1  : 1;            /*!< FLT4SRC_1                                                                 */
      __IOM uint32_t FLT5SRC_1  : 1;            /*!< FLT5SRC_1                                                                 */
      __IOM uint32_t FLT6SRC_1  : 1;            /*!< FLT6SRC                                                                   */
            uint32_t            : 2;
      __IOM uint32_t FLTSD      : 2;            /*!< FLTSD                                                                     */
            uint32_t            : 6;
    } FLTINR2_b;
  } ;
  
  union {
    __IOM uint32_t BDMUPDR;                     /*!< BDMUPDR                                                                   */
    
    struct {
      __IOM uint32_t MCR        : 1;            /*!< MCR                                                                       */
      __IOM uint32_t MICR       : 1;            /*!< MICR                                                                      */
      __IOM uint32_t MDIER      : 1;            /*!< MDIER                                                                     */
      __IOM uint32_t MCNT       : 1;            /*!< MCNT                                                                      */
      __IOM uint32_t MPER       : 1;            /*!< MPER                                                                      */
      __IOM uint32_t MREP       : 1;            /*!< MREP                                                                      */
      __IOM uint32_t MCMP1      : 1;            /*!< MCMP1                                                                     */
      __IOM uint32_t MCMP2      : 1;            /*!< MCMP2                                                                     */
      __IOM uint32_t MCMP3      : 1;            /*!< MCMP3                                                                     */
      __IOM uint32_t MCMP4      : 1;            /*!< MCMP4                                                                     */
            uint32_t            : 22;
    } BDMUPDR_b;
  } ;
  
  union {
    __IOM uint32_t BDTAUPR;                     /*!< Burst DMA Timerx update Register                                          */
    
