unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TIMxCR     : 1;            /*!< HRTIM_TIMxCR register update enable                                       */
      __IOM uint32_t TIMxICR    : 1;            /*!< HRTIM_TIMxICR register update enable                                      */
      __IOM uint32_t TIMxDIER   : 1;            /*!< HRTIM_TIMxDIER register update enable                                     */
      __IOM uint32_t TIMxCNT    : 1;            /*!< HRTIM_CNTxR register update enable                                        */
      __IOM uint32_t TIMxPER    : 1;            /*!< HRTIM_PERxR register update enable                                        */
      __IOM uint32_t TIMxREP    : 1;            /*!< HRTIM_REPxR register update enable                                        */
      __IOM uint32_t TIMxCMP1   : 1;            /*!< HRTIM_CMP1xR register update enable                                       */
      __IOM uint32_t TIMxCMP2   : 1;            /*!< HRTIM_CMP2xR register update enable                                       */
      __IOM uint32_t TIMxCMP3   : 1;            /*!< HRTIM_CMP3xR register update enable                                       */
      __IOM uint32_t TIMxCMP4   : 1;            /*!< HRTIM_CMP4xR register update enable                                       */
      __IOM uint32_t TIMx_DTxR  : 1;            /*!< HRTIM_DTxR register update enable                                         */
      __IOM uint32_t TIMxSET1R  : 1;            /*!< HRTIM_SET1xR register update enable                                       */
      __IOM uint32_t TIMxRST1R  : 1;            /*!< HRTIM_RST1xR register update enable                                       */
      __IOM uint32_t TIMxSET2R  : 1;            /*!< HRTIM_SET2xR register update enable                                       */
      __IOM uint32_t TIMxRST2R  : 1;            /*!< HRTIM_RST2xR register update enable                                       */
      __IOM uint32_t TIMxEEFR1  : 1;            /*!< HRTIM_EEFxR1 register update enable                                       */
      __IOM uint32_t TIMxEEFR2  : 1;            /*!< HRTIM_EEFxR2 register update enable                                       */
      __IOM uint32_t TIMxRSTR   : 1;            /*!< HRTIM_RSTxR register update enable                                        */
      __IOM uint32_t TIMxCHPR   : 1;            /*!< HRTIM_CHPxR register update enable                                        */
      __IOM uint32_t TIMxOUTR   : 1;            /*!< HRTIM_OUTxR register update enable                                        */
      __IOM uint32_t TIMxFLTR   : 1;            /*!< HRTIM_FLTxR register update enable                                        */
      __IOM uint32_t TIMxCR2    : 1;            /*!< TIMxCR2                                                                   */
      __IOM uint32_t TIMxEEFR3  : 1;            /*!< TIMxEEFR3                                                                 */
            uint32_t            : 9;
    } BDTEUPR_b;
  } ;
  
  union {
    __OM  uint32_t BDMADR;                      /*!< Burst DMA Data Register                                                   */
    
    struct {
      __OM  uint32_t BDMADR     : 32;           /*!< Burst DMA Data register                                                   */
    } BDMADR_b;
  } ;
  
  union {
    __IOM uint32_t BDTFUPR;                     /*!< Burst DMA Timerx update Register                                          */
    
    struct {
      __IOM uint32_t TIMxCR     : 1;            /*!< HRTIM_TIMxCR register update enable                                       */
      __IOM uint32_t TIMxICR    : 1;            /*!< HRTIM_TIMxICR register update enable                                      */
      __IOM uint32_t TIMxDIER   : 1;            /*!< HRTIM_TIMxDIER register update enable                                     */
      __IOM uint32_t TIMxCNT    : 1;            /*!< HRTIM_CNTxR register update enable                                        */
      __IOM uint32_t TIMxPER    : 1;            /*!< HRTIM_PERxR register update enable                                        */
      __IOM uint32_t TIMxREP    : 1;            /*!< HRTIM_REPxR register update enable                                        */
      __IOM uint32_t TIMxCMP1   : 1;            /*!< HRTIM_CMP1xR register update enable                                       */
      __IOM uint32_t TIMxCMP2   : 1;            /*!< HRTIM_CMP2xR register update enable                                       */
      __IOM uint32_t TIMxCMP3   : 1;            /*!< HRTIM_CMP3xR register update enable                                       */
      __IOM uint32_t TIMxCMP4   : 1;            /*!< HRTIM_CMP4xR register update enable                                       */
      __IOM uint32_t TIMx_DTxR  : 1;            /*!< HRTIM_DTxR register update enable                                         */
      __IOM uint32_t TIMxSET1R  : 1;            /*!< HRTIM_SET1xR register update enable                                       */
      __IOM uint32_t TIMxRST1R  : 1;            /*!< HRTIM_RST1xR register update enable                                       */
      __IOM uint32_t TIMxSET2R  : 1;            /*!< HRTIM_SET2xR register update enable                                       */
      __IOM uint32_t TIMxRST2R  : 1;            /*!< HRTIM_RST2xR register update enable                                       */
      __IOM uint32_t TIMxEEFR1  : 1;            /*!< HRTIM_EEFxR1 register update enable                                       */
      __IOM uint32_t TIMxEEFR2  : 1;            /*!< HRTIM_EEFxR2 register update enable                                       */
      __IOM uint32_t TIMxRSTR   : 1;            /*!< HRTIM_RSTxR register update enable                                        */
      __IOM uint32_t TIMxCHPR   : 1;            /*!< HRTIM_CHPxR register update enable                                        */
      __IOM uint32_t TIMxOUTR   : 1;            /*!< HRTIM_OUTxR register update enable                                        */
      __IOM uint32_t TIMxFLTR   : 1;            /*!< HRTIM_FLTxR register update enable                                        */
      __IOM uint32_t TIMxCR2    : 1;            /*!< TIMxCR2                                                                   */
      __IOM uint32_t TIMxEEFR3  : 1;            /*!< TIMxEEFR3                                                                 */
            uint32_t            : 9;
    } BDTFUPR_b;
  } ;
  
  union {
    __IOM uint32_t ADCER;                       /*!< HRTIM ADC Extended Trigger Register                                       */
    
