unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ADC5TRG    : 5;            /*!< ADC5TRG                                                                   */
      __IOM uint32_t ADC6TRG    : 5;            /*!< ADC6TRG                                                                   */
      __IOM uint32_t ADC7TRG    : 5;            /*!< ADC7TRG                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC8TRG    : 5;            /*!< ADC8TRG                                                                   */
      __IOM uint32_t ADC9TRG    : 5;            /*!< ADC9TRG                                                                   */
      __IOM uint32_t ADC10TRG   : 5;            /*!< ADC10TRG                                                                  */
            uint32_t            : 1;
    } ADCER_b;
  } ;
  
  union {
    __IOM uint32_t ADCUR;                       /*!< HRTIM ADC Trigger Update Register                                         */
    
    struct {
      __IOM uint32_t AD5USRC    : 3;            /*!< AD5USRC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t AD6USRC    : 3;            /*!< AD6USRC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t AD7USRC    : 3;            /*!< AD7USRC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t AD8USRC    : 3;            /*!< AD8USRC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t AD9USRC    : 3;            /*!< AD9USRC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t AD10USRC   : 3;            /*!< AD10USRC                                                                  */
            uint32_t            : 9;
    } ADCUR_b;
  } ;
  
  union {
    __IOM uint32_t ADCPS1;                      /*!< HRTIM ADC Post Scaler Register 1                                          */
    
    struct {
      __IOM uint32_t ADC1PSC    : 5;            /*!< ADC1PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC2PSC    : 5;            /*!< ADC2PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC3PSC    : 5;            /*!< ADC3PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC4PSC    : 5;            /*!< ADC4PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC5PSC    : 5;            /*!< ADC5PSC                                                                   */
            uint32_t            : 3;
    } ADCPS1_b;
  } ;
  
  union {
    __IOM uint32_t ADCPS2;                      /*!< HRTIM ADC Post Scaler Register 2                                          */
    
    struct {
      __IOM uint32_t ADC6PSC    : 5;            /*!< ADC6PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC7PSC    : 5;            /*!< ADC7PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC8PSC    : 5;            /*!< ADC8PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC9PSC    : 5;            /*!< ADC9PSC                                                                   */
            uint32_t            : 1;
      __IOM uint32_t ADC10PSC   : 5;            /*!< ADC10PSC                                                                  */
            uint32_t            : 3;
    } ADCPS2_b;
  } ;
  
  union {
    __IOM uint32_t FLTINR3;                     /*!< HRTIM Fault Input Register 3                                              */
    
    struct {
      __IOM uint32_t FLT1BLKE   : 1;            /*!< FLT1BLKE                                                                  */
      __IOM uint32_t FLT1BLKS   : 1;            /*!< FLT1BLKS                                                                  */
      __IOM uint32_t FLT1CNT    : 4;            /*!< FLT1CNT                                                                   */
      __IOM uint32_t FLT1CRES   : 1;            /*!< FLT1CRES                                                                  */
      __IOM uint32_t FLT1RSTM   : 1;            /*!< FLT1RSTM                                                                  */
      __IOM uint32_t FLT2BLKE   : 1;            /*!< FLT2BLKE                                                                  */
      __IOM uint32_t FLT2BLKS   : 1;            /*!< FLT2BLKS                                                                  */
      __IOM uint32_t FLT2CNT    : 4;            /*!< FLT2CNT                                                                   */
      __IOM uint32_t FLT2CRES   : 1;            /*!< FLT2CRES                                                                  */
      __IOM uint32_t FLT2RSTM   : 1;            /*!< FLT2RSTM                                                                  */
      __IOM uint32_t FLT3BLKE   : 1;            /*!< FLT3BLKE                                                                  */
      __IOM uint32_t FLT3BLKS   : 1;            /*!< FLT3BLKS                                                                  */
      __IOM uint32_t FLT3CNT    : 4;            /*!< FLT3CNT                                                                   */
      __IOM uint32_t FLT3CRES   : 1;            /*!< FLT3CRES                                                                  */
      __IOM uint32_t FLT3RSTM   : 1;            /*!< FLT3RSTM                                                                  */
      __IOM uint32_t FLT4BLKE   : 1;            /*!< FLT4BLKE                                                                  */
      __IOM uint32_t FLT4BLKS   : 1;            /*!< FLT4BLKS                                                                  */
      __IOM uint32_t FLT4CNT    : 4;            /*!< FLT4CNT                                                                   */
      __IOM uint32_t FLT4CRES   : 1;            /*!< FLT4CRES                                                                  */
      __IOM uint32_t FLT4RSTM   : 1;            /*!< FLT4RSTM                                                                  */
    } FLTINR3_b;
  } ;
  
  union {
    __IOM uint32_t FLTINR4;                     /*!< HRTIM Fault Input Register 4                                              */
    
