unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t FLT5BLKE   : 1;            /*!< FLT5BLKE                                                                  */
      __IOM uint32_t FLT5BLKS   : 1;            /*!< FLT5BLKS                                                                  */
      __IOM uint32_t FLT5CNT    : 4;            /*!< FLT5CNT                                                                   */
      __IOM uint32_t FLT5CRES   : 1;            /*!< FLT5CRES                                                                  */
      __IOM uint32_t FLT5RSTM   : 1;            /*!< FLT5RSTM                                                                  */
      __IOM uint32_t FLT6BLKE   : 1;            /*!< FLT6BLKE                                                                  */
      __IOM uint32_t FLT6BLKS   : 1;            /*!< FLT6BLKS                                                                  */
      __IOM uint32_t FLT6CNT    : 4;            /*!< FLT6CNT                                                                   */
      __IOM uint32_t FLT6CRES   : 1;            /*!< FLT6CRES                                                                  */
      __IOM uint32_t FLT6RSTM   : 1;            /*!< FLT6RSTM                                                                  */
            uint32_t            : 16;
    } FLTINR4_b;
  } ;
} HRTIM_Common_Type;                            /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                          QUADSPI                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief QuadSPI interface (QUADSPI)
  */

typedef struct {                                /*!< QUADSPI Structure                                                         */
  
  union {
    __IOM uint32_t CR;                          /*!< control register                                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable                                                                    */
      __IOM uint32_t ABORT      : 1;            /*!< Abort request                                                             */
      __IOM uint32_t DMAEN      : 1;            /*!< DMA enable                                                                */
      __IOM uint32_t TCEN       : 1;            /*!< Timeout counter enable                                                    */
      __IOM uint32_t SSHIFT     : 1;            /*!< Sample shift                                                              */
            uint32_t            : 1;
      __IOM uint32_t DFM        : 1;            /*!< DFM                                                                       */
      __IOM uint32_t FSEL       : 1;            /*!< FSEL                                                                      */
      __IOM uint32_t FTHRES     : 5;            /*!< IFO threshold level                                                       */
            uint32_t            : 3;
      __IOM uint32_t TEIE       : 1;            /*!< Transfer error interrupt enable                                           */
      __IOM uint32_t TCIE       : 1;            /*!< Transfer complete interrupt enable                                        */
      __IOM uint32_t FTIE       : 1;            /*!< FIFO threshold interrupt enable                                           */
      __IOM uint32_t SMIE       : 1;            /*!< Status match interrupt enable                                             */
      __IOM uint32_t TOIE       : 1;            /*!< TimeOut interrupt enable                                                  */
            uint32_t            : 1;
      __IOM uint32_t APMS       : 1;            /*!< Automatic poll mode stop                                                  */
      __IOM uint32_t PMM        : 1;            /*!< Polling match mode                                                        */
      __IOM uint32_t PRESCALER  : 8;            /*!< Clock prescaler                                                           */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t DCR;                         /*!< device configuration register                                             */
    
    struct {
      __IOM uint32_t CKMODE     : 1;            /*!< Mode 0 / mode 3                                                           */
            uint32_t            : 7;
      __IOM uint32_t CSHT       : 3;            /*!< Chip select high time                                                     */
            uint32_t            : 5;
      __IOM uint32_t FSIZE      : 5;            /*!< FLASH memory size                                                         */
            uint32_t            : 11;
    } DCR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IM  uint32_t TEF        : 1;            /*!< Transfer error flag                                                       */
      __IM  uint32_t TCF        : 1;            /*!< Transfer complete flag                                                    */
      __IM  uint32_t FTF        : 1;            /*!< FIFO threshold flag                                                       */
      __IM  uint32_t SMF        : 1;            /*!< Status match flag                                                         */
      __IM  uint32_t TOF        : 1;            /*!< Timeout flag                                                              */
      __IM  uint32_t BUSY       : 1;            /*!< Busy                                                                      */
            uint32_t            : 2;
      __IM  uint32_t FLEVEL     : 5;            /*!< FIFO level                                                                */
            uint32_t            : 19;
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t FCR;                         /*!< flag clear register                                                       */
    
