unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CTEF       : 1;            /*!< Clear transfer error flag                                                 */
      __IOM uint32_t CTCF       : 1;            /*!< Clear transfer complete flag                                              */
            uint32_t            : 1;
      __IOM uint32_t CSMF       : 1;            /*!< Clear status match flag                                                   */
      __IOM uint32_t CTOF       : 1;            /*!< Clear timeout flag                                                        */
            uint32_t            : 27;
    } FCR_b;
  } ;
  
  union {
    __IOM uint32_t DLR;                         /*!< data length register                                                      */
    
    struct {
      __IOM uint32_t DL         : 32;           /*!< Data length                                                               */
    } DLR_b;
  } ;
  
  union {
    __IOM uint32_t CCR;                         /*!< communication configuration register                                      */
    
    struct {
      __IOM uint32_t INSTRUCTION : 8;           /*!< Instruction                                                               */
      __IOM uint32_t IMODE      : 2;            /*!< Instruction mode                                                          */
      __IOM uint32_t ADMODE     : 2;            /*!< Address mode                                                              */
      __IOM uint32_t ADSIZE     : 2;            /*!< Address size                                                              */
      __IOM uint32_t ABMODE     : 2;            /*!< Alternate bytes mode                                                      */
      __IOM uint32_t ABSIZE     : 2;            /*!< Alternate bytes size                                                      */
      __IOM uint32_t DCYC       : 5;            /*!< Number of dummy cycles                                                    */
            uint32_t            : 1;
      __IOM uint32_t DMODE      : 2;            /*!< Data mode                                                                 */
      __IOM uint32_t FMODE      : 2;            /*!< Functional mode                                                           */
      __IOM uint32_t SIOO       : 1;            /*!< Send instruction only once mode                                           */
            uint32_t            : 2;
      __IOM uint32_t DDRM       : 1;            /*!< Double data rate mode                                                     */
    } CCR_b;
  } ;
  
  union {
    __IOM uint32_t AR;                          /*!< address register                                                          */
    
    struct {
      __IOM uint32_t ADDRESS    : 32;           /*!< Address                                                                   */
    } AR_b;
  } ;
  
  union {
    __IOM uint32_t ABR;                         /*!< ABR                                                                       */
    
    struct {
      __IOM uint32_t ALTERNATE  : 32;           /*!< ALTERNATE                                                                 */
    } ABR_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< data register                                                             */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< Data                                                                      */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t PSMKR;                       /*!< polling status mask register                                              */
    
    struct {
      __IOM uint32_t MASK       : 32;           /*!< Status mask                                                               */
    } PSMKR_b;
  } ;
  
  union {
    __IOM uint32_t PSMAR;                       /*!< polling status match register                                             */
    
    struct {
      __IOM uint32_t MATCH      : 32;           /*!< Status match                                                              */
    } PSMAR_b;
  } ;
  
  union {
    __IOM uint32_t PIR;                         /*!< polling interval register                                                 */
    
    struct {
      __IOM uint32_t INTERVAL   : 16;           /*!< Polling interval                                                          */
            uint32_t            : 16;
    } PIR_b;
  } ;
  
  union {
    __IOM uint32_t LPTR;                        /*!< low-power timeout register                                                */
    
    struct {
      __IOM uint32_t TIMEOUT    : 16;           /*!< Timeout period                                                            */
            uint32_t            : 16;
    } LPTR_b;
  } ;
} QUADSPI_Type;                                 /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                           DAC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-analog converter (DAC1)
  */

typedef struct {                                /*!< DAC1 Structure                                                            */
  
  union {
    __IOM uint32_t DAC_CR;                      /*!< DAC control register                                                      */
    
    struct {
      __IOM uint32_t EN1        : 1;            /*!< DAC channel1 enable This bit is set and cleared by software
                                                     to enable/disable DAC channel1.                                           */
      __IOM uint32_t TEN1       : 1;            /*!< DAC channel1 trigger enable                                               */
      __IOM uint32_t TSEL1      : 4;            /*!< DAC channel1 trigger selection These bits select the external
                                                     event used to trigger DAC channel1. Note: Only used if
                                                     bit TEN1 = 1 (DAC channel1 trigger enabled).                              */
      __IOM uint32_t WAVE1      : 2;            /*!< DAC channel1 noise/triangle wave generation enable These bits
                                                     are set and cleared by software. Note: Only used if bit
                                                     TEN1 = 1 (DAC channel1 trigger enabled).                                  */
      __IOM uint32_t MAMP1      : 4;            /*!< DAC channel1 mask/amplitude selector These bits are written
                                                     by software to select mask in wave generation mode or amplitude
                                                     in triangle generation mode. = 1011: Unmask bits[11:0]
                                                     of LFSR/ triangle amplitude equal to 4095                                 */
      __IOM uint32_t DMAEN1     : 1;            /*!< DAC channel1 DMA enable This bit is set and cleared by software.          */
      __IOM uint32_t DMAUDRIE1  : 1;            /*!< DAC channel1 DMA Underrun Interrupt enable This bit is set and
                                                     cleared by software.                                                      */
      __IOM uint32_t CEN1       : 1;            /*!< DAC Channel 1 calibration enable This bit is set and cleared
                                                     by software to enable/disable DAC channel 1 calibration,
                                                     it can be written only if bit EN1=0 into DAC_CR (the calibration
                                                     mode can be entered/exit only when the DAC channel is disabled)
                                                     Otherwise, the write operation is ignored.                                */
            uint32_t            : 1;
      __IOM uint32_t EN2        : 1;            /*!< DAC channel2 enable This bit is set and cleared by software
                                                     to enable/disable DAC channel2.                                           */
      __IOM uint32_t TEN2       : 1;            /*!< DAC channel2 trigger enable                                               */
      __IOM uint32_t TSEL2      : 4;            /*!< DAC channel2 trigger selection These bits select the external
                                                     event used to trigger DAC channel2 Note: Only used if bit
                                                     TEN2 = 1 (DAC channel2 trigger enabled).                                  */
      __IOM uint32_t WAVE2      : 2;            /*!< DAC channel2 noise/triangle wave generation enable These bits
                                                     are set/reset by software. 1x: Triangle wave generation
                                                     enabled Note: Only used if bit TEN2 = 1 (DAC channel2 trigger
                                                     enabled)                                                                  */
      __IOM uint32_t MAMP2      : 4;            /*!< DAC channel2 mask/amplitude selector These bits are written
                                                     by software to select mask in wave generation mode or amplitude
                                                     in triangle generation mode. = 1011: Unmask bits[11:0]
                                                     of LFSR/ triangle amplitude equal to 4095                                 */
      __IOM uint32_t DMAEN2     : 1;            /*!< DAC channel2 DMA enable This bit is set and cleared by software.          */
      __IOM uint32_t DMAUDRIE2  : 1;            /*!< DAC channel2 DMA underrun interrupt enable This bit is set and
                                                     cleared by software.                                                      */
      __IOM uint32_t CEN2       : 1;            /*!< DAC Channel 2 calibration enable This bit is set and cleared
                                                     by software to enable/disable DAC channel 2 calibration,
                                                     it can be written only if bit EN2=0 into DAC_CR (the calibration
                                                     mode can be entered/exit only when the DAC channel is disabled)
                                                     Otherwise, the write operation is ignored.                                */
            uint32_t            : 1;
    } DAC_CR_b;
  } ;
  
  union {
    __OM  uint32_t DAC_SWTRGR;                  /*!< DAC software trigger register                                             */
    
