unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t SWTRIG1    : 1;            /*!< DAC channel1 software trigger This bit is set by software to
                                                     trigger the DAC in software trigger mode. Note: This bit
                                                     is cleared by hardware (one APB1 clock cycle later) once
                                                     the DAC_DHR1 register value has been loaded into the DAC_DOR1
                                                     register.                                                                 */
      __OM  uint32_t SWTRIG2    : 1;            /*!< DAC channel2 software trigger This bit is set by software to
                                                     trigger the DAC in software trigger mode. Note: This bit
                                                     is cleared by hardware (one APB1 clock cycle later) once
                                                     the DAC_DHR2 register value has been loaded into the DAC_DOR2
                                                     register.                                                                 */
            uint32_t            : 14;
      __OM  uint32_t SWTRIGB1   : 1;            /*!< DAC channel1 software trigger B                                           */
      __OM  uint32_t SWTRIGB2   : 1;            /*!< DAC channel2 software trigger B                                           */
            uint32_t            : 14;
    } DAC_SWTRGR_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12R1;                 /*!< DAC channel1 12-bit right-aligned data holding register                   */
    
    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< DAC channel1 12-bit right-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel1.                 */
            uint32_t            : 4;
      __IOM uint32_t DACC1DHRB  : 12;           /*!< DAC channel1 12-bit right-aligned data B                                  */
            uint32_t            : 4;
    } DAC_DHR12R1_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12L1;                 /*!< DAC channel1 12-bit left aligned data holding register                    */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< DAC channel1 12-bit left-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel1.                 */
            uint32_t            : 4;
      __IOM uint32_t DACC1DHRB  : 12;           /*!< DAC channel1 12-bit left-aligned data B                                   */
    } DAC_DHR12L1_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR8R1;                  /*!< DAC channel1 8-bit right aligned data holding register                    */
    
    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< DAC channel1 8-bit right-aligned data These bits are written
                                                     by software which specifies 8-bit data for DAC channel1.                  */
      __IOM uint32_t DACC1DHRB  : 8;            /*!< DAC channel1 8-bit right-aligned data                                     */
            uint32_t            : 16;
    } DAC_DHR8R1_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12R2;                 /*!< DAC channel2 12-bit right aligned data holding register                   */
    
    struct {
      __IOM uint32_t DACC2DHR   : 12;           /*!< DAC channel2 12-bit right-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel2.                 */
            uint32_t            : 4;
      __IOM uint32_t DACC2DHRB  : 12;           /*!< DAC channel2 12-bit right-aligned data                                    */
            uint32_t            : 4;
    } DAC_DHR12R2_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12L2;                 /*!< DAC channel2 12-bit left aligned data holding register                    */
    
    struct {
            uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< DAC channel2 12-bit left-aligned data These bits are written
                                                     by software which specify 12-bit data for DAC channel2.                   */
            uint32_t            : 4;
      __IOM uint32_t DACC2DHRB  : 12;           /*!< DAC channel2 12-bit left-aligned data B                                   */
    } DAC_DHR12L2_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR8R2;                  /*!< DAC channel2 8-bit right-aligned data holding register                    */
    
    struct {
      __IOM uint32_t DACC2DHR   : 8;            /*!< DAC channel2 8-bit right-aligned data These bits are written
                                                     by software which specifies 8-bit data for DAC channel2.                  */
      __IOM uint32_t DACC2DHRB  : 8;            /*!< DAC channel2 8-bit right-aligned data                                     */
            uint32_t            : 16;
    } DAC_DHR8R2_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12RD;                 /*!< Dual DAC 12-bit right-aligned data holding register                       */
    
    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< DAC channel1 12-bit right-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel1.                 */
            uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< DAC channel2 12-bit right-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel2.                 */
            uint32_t            : 4;
    } DAC_DHR12RD_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR12LD;                 /*!< DUAL DAC 12-bit left aligned data holding register                        */
    
