unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< DAC channel1 12-bit left-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel1.                 */
            uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< DAC channel2 12-bit left-aligned data These bits are written
                                                     by software which specifies 12-bit data for DAC channel2.                 */
    } DAC_DHR12LD_b;
  } ;
  
  union {
    __IOM uint32_t DAC_DHR8RD;                  /*!< DUAL DAC 8-bit right aligned data holding register                        */
    
    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< DAC channel1 8-bit right-aligned data These bits are written
                                                     by software which specifies 8-bit data for DAC channel1.                  */
      __IOM uint32_t DACC2DHR   : 8;            /*!< DAC channel2 8-bit right-aligned data These bits are written
                                                     by software which specifies 8-bit data for DAC channel2.                  */
            uint32_t            : 16;
    } DAC_DHR8RD_b;
  } ;
  
  union {
    __IM  uint32_t DAC_DOR1;                    /*!< DAC channel1 data output register                                         */
    
    struct {
      __IM  uint32_t DACC1DOR   : 12;           /*!< DAC channel1 data output These bits are read-only, they contain
                                                     data output for DAC channel1.                                             */
            uint32_t            : 4;
      __IM  uint32_t DACC1DORB  : 12;           /*!< DAC channel1 data output                                                  */
            uint32_t            : 4;
    } DAC_DOR1_b;
  } ;
  
  union {
    __IM  uint32_t DAC_DOR2;                    /*!< DAC channel2 data output register                                         */
    
    struct {
      __IM  uint32_t DACC2DOR   : 12;           /*!< DAC channel2 data output These bits are read-only, they contain
                                                     data output for DAC channel2.                                             */
            uint32_t            : 4;
      __IM  uint32_t DACC2DORB  : 12;           /*!< DAC channel2 data output                                                  */
            uint32_t            : 4;
    } DAC_DOR2_b;
  } ;
  
  union {
    __IOM uint32_t DAC_SR;                      /*!< DAC status register                                                       */
    
    struct {
            uint32_t            : 11;
      __IOM uint32_t DAC1RDY    : 1;            /*!< DAC channel1 ready status bit                                             */
      __IOM uint32_t DORSTAT1   : 1;            /*!< DAC channel1 output register status bit                                   */
      __IOM uint32_t DMAUDR1    : 1;            /*!< DAC channel1 DMA underrun flag This bit is set by hardware and
                                                     cleared by software (by writing it to 1).                                 */
      __IM  uint32_t CAL_FLAG1  : 1;            /*!< DAC Channel 1 calibration offset status This bit is set and
                                                     cleared by hardware                                                       */
      __IM  uint32_t BWST1      : 1;            /*!< DAC Channel 1 busy writing sample time flag This bit is systematically
                                                     set just after Sample & Hold mode enable and is set each
                                                     time the software writes the register DAC_SHSR1, It is
                                                     cleared by hardware when the write operation of DAC_SHSR1
                                                     is complete. (It takes about 3LSI periods of synchronization).            */
            uint32_t            : 11;
      __IOM uint32_t DAC2RDY    : 1;            /*!< DAC channel 2 ready status bit                                            */
      __IOM uint32_t DORSTAT2   : 1;            /*!< DAC channel 2 output register status bit                                  */
      __IOM uint32_t DMAUDR2    : 1;            /*!< DAC channel2 DMA underrun flag This bit is set by hardware and
                                                     cleared by software (by writing it to 1).                                 */
      __IM  uint32_t CAL_FLAG2  : 1;            /*!< DAC Channel 2 calibration offset status This bit is set and
                                                     cleared by hardware                                                       */
      __IM  uint32_t BWST2      : 1;            /*!< DAC Channel 2 busy writing sample time flag This bit is systematically
                                                     set just after Sample & Hold mode enable and is set each
                                                     time the software writes the register DAC_SHSR2, It is
                                                     cleared by hardware when the write operation of DAC_SHSR2
                                                     is complete. (It takes about 3 LSI periods of synchronization).           */
    } DAC_SR_b;
  } ;
  
  union {
    __IOM uint32_t DAC_CCR;                     /*!< DAC calibration control register                                          */
    
    struct {
      __IOM uint32_t OTRIM1     : 5;            /*!< DAC Channel 1 offset trimming value                                       */
            uint32_t            : 11;
      __IOM uint32_t OTRIM2     : 5;            /*!< DAC Channel 2 offset trimming value                                       */
            uint32_t            : 11;
    } DAC_CCR_b;
  } ;
  
  union {
    __IOM uint32_t DAC_MCR;                     /*!< DAC mode control register                                                 */
    
