unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t MODE1      : 3;            /*!< DAC Channel 1 mode These bits can be written only when the DAC
                                                     is disabled and not in the calibration mode (when bit EN1=0
                                                     and bit CEN1 =0 in the DAC_CR register). If EN1=1 or CEN1
                                                     =1 the write operation is ignored. They can be set and
                                                     cleared by software to select the DAC Channel 1 mode: DAC
                                                     Channel 1 in normal Mode DAC Channel 1 in sample &amp;
                                                     hold mode                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMADOUBLE1 : 1;            /*!< DAC Channel1 DMA double data mode                                         */
      __IOM uint32_t SINFORMAT1 : 1;            /*!< Enable signed format for DAC channel1                                     */
            uint32_t            : 4;
      __IOM uint32_t HFSEL      : 2;            /*!< High frequency interface mode selection                                   */
      __IOM uint32_t MODE2      : 3;            /*!< DAC Channel 2 mode These bits can be written only when the DAC
                                                     is disabled and not in the calibration mode (when bit EN2=0
                                                     and bit CEN2 =0 in the DAC_CR register). If EN2=1 or CEN2
                                                     =1 the write operation is ignored. They can be set and
                                                     cleared by software to select the DAC Channel 2 mode: DAC
                                                     Channel 2 in normal Mode DAC Channel 2 in sample &amp;
                                                     hold mode                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMADOUBLE2 : 1;            /*!< DAC Channel2 DMA double data mode                                         */
      __IOM uint32_t SINFORMAT2 : 1;            /*!< Enable signed format for DAC channel2                                     */
            uint32_t            : 6;
    } DAC_MCR_b;
  } ;
  
  union {
    __IOM uint32_t DAC_SHSR1;                   /*!< DAC Sample and Hold sample time register 1                                */
    
    struct {
      __IOM uint32_t TSAMPLE1   : 10;           /*!< DAC Channel 1 sample Time (only valid in sample &amp; hold mode)
                                                     These bits can be written when the DAC channel1 is disabled
                                                     or also during normal operation. in the latter case, the
                                                     write can be done only when BWSTx of DAC_SR register is
                                                     low, If BWSTx=1, the write operation is ignored.                          */
            uint32_t            : 22;
    } DAC_SHSR1_b;
  } ;
  
  union {
    __IOM uint32_t DAC_SHSR2;                   /*!< DAC Sample and Hold sample time register 2                                */
    
    struct {
      __IOM uint32_t TSAMPLE2   : 10;           /*!< DAC Channel 2 sample Time (only valid in sample &amp; hold mode)
                                                     These bits can be written when the DAC channel2 is disabled
                                                     or also during normal operation. in the latter case, the
                                                     write can be done only when BWSTx of DAC_SR register is
                                                     low, if BWSTx=1, the write operation is ignored.                          */
            uint32_t            : 22;
    } DAC_SHSR2_b;
  } ;
  
  union {
    __IOM uint32_t DAC_SHHR;                    /*!< DAC Sample and Hold hold time register                                    */
    
    struct {
      __IOM uint32_t THOLD1     : 10;           /*!< DAC Channel 1 hold Time (only valid in sample &amp; hold mode)
                                                     Hold time= (THOLD[9:0]) x T LSI                                           */
            uint32_t            : 6;
      __IOM uint32_t THOLD2     : 10;           /*!< DAC Channel 2 hold time (only valid in sample &amp; hold mode).
                                                     Hold time= (THOLD[9:0]) x T LSI                                           */
            uint32_t            : 6;
    } DAC_SHHR_b;
  } ;
  
  union {
    __IOM uint32_t DAC_SHRR;                    /*!< DAC Sample and Hold refresh time register                                 */
    
    struct {
      __IOM uint32_t TREFRESH1  : 8;            /*!< DAC Channel 1 refresh Time (only valid in sample &amp; hold
                                                     mode) Refresh time= (TREFRESH[7:0]) x T LSI                               */
            uint32_t            : 8;
      __IOM uint32_t TREFRESH2  : 8;            /*!< DAC Channel 2 refresh Time (only valid in sample &amp; hold
                                                     mode) Refresh time= (TREFRESH[7:0]) x T LSI                               */
            uint32_t            : 8;
    } DAC_SHRR_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t DAC_STR1;                    /*!< Sawtooth register                                                         */
    
    struct {
      __IOM uint32_t STRSTDATA1 : 12;           /*!< DAC Channel 1 Sawtooth reset value                                        */
      __IOM uint32_t STDIR1     : 1;            /*!< DAC Channel1 Sawtooth direction setting                                   */
            uint32_t            : 3;
      __IOM uint32_t STINCDATA1 : 16;           /*!< DAC CH1 Sawtooth increment value (12.4 bit format)                        */
    } DAC_STR1_b;
  } ;
  
  union {
    __IOM uint32_t DAC_STR2;                    /*!< Sawtooth register                                                         */
    
