unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t LT1        : 12;           /*!< LT1                                                                       */
      __IOM uint32_t AWDFILT    : 3;            /*!< AWDFILT                                                                   */
            uint32_t            : 1;
      __IOM uint32_t HT1        : 12;           /*!< HT1                                                                       */
            uint32_t            : 4;
    } TR1_b;
  } ;
  
  union {
    __IOM uint32_t TR2;                         /*!< watchdog threshold register                                               */
    
    struct {
      __IOM uint32_t LT2        : 8;            /*!< LT2                                                                       */
            uint32_t            : 8;
      __IOM uint32_t HT2        : 8;            /*!< HT2                                                                       */
            uint32_t            : 8;
    } TR2_b;
  } ;
  
  union {
    __IOM uint32_t TR3;                         /*!< watchdog threshold register 3                                             */
    
    struct {
      __IOM uint32_t LT3        : 8;            /*!< LT3                                                                       */
            uint32_t            : 8;
      __IOM uint32_t HT3        : 8;            /*!< HT3                                                                       */
            uint32_t            : 8;
    } TR3_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t SQR1;                        /*!< regular sequence register 1                                               */
    
    struct {
      __IOM uint32_t L          : 4;            /*!< Regular channel sequence length                                           */
            uint32_t            : 2;
      __IOM uint32_t SQ1        : 5;            /*!< SQ1                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ2        : 5;            /*!< SQ2                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ3        : 5;            /*!< SQ3                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ4        : 5;            /*!< SQ4                                                                       */
            uint32_t            : 3;
    } SQR1_b;
  } ;
  
  union {
    __IOM uint32_t SQR2;                        /*!< regular sequence register 2                                               */
    
    struct {
      __IOM uint32_t SQ5        : 5;            /*!< SQ5                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ6        : 5;            /*!< SQ6                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ7        : 5;            /*!< SQ7                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ8        : 5;            /*!< SQ8                                                                       */
            uint32_t            : 1;
      __IOM uint32_t SQ9        : 5;            /*!< SQ9                                                                       */
            uint32_t            : 3;
    } SQR2_b;
  } ;
  
  union {
    __IOM uint32_t SQR3;                        /*!< regular sequence register 3                                               */
    
    struct {
      __IOM uint32_t SQ10       : 5;            /*!< SQ10                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SQ11       : 5;            /*!< SQ11                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SQ12       : 5;            /*!< SQ12                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SQ13       : 5;            /*!< SQ13                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SQ14       : 5;            /*!< SQ14                                                                      */
            uint32_t            : 3;
    } SQR3_b;
  } ;
  
  union {
    __IOM uint32_t SQR4;                        /*!< regular sequence register 4                                               */
    
    struct {
      __IOM uint32_t SQ15       : 5;            /*!< SQ15                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SQ16       : 5;            /*!< SQ16                                                                      */
            uint32_t            : 21;
    } SQR4_b;
  } ;
  
  union {
    __IM  uint32_t DR;                          /*!< regular Data Register                                                     */
    
    struct {
      __IM  uint32_t RDATA      : 16;           /*!< Regular Data converted                                                    */
            uint32_t            : 16;
    } DR_b;
  } ;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IOM uint32_t JSQR;                        /*!< injected sequence register                                                */
    
    struct {
      __IOM uint32_t JL         : 2;            /*!< JL                                                                        */
      __IOM uint32_t JEXTSEL    : 5;            /*!< JEXTSEL                                                                   */
      __IOM uint32_t JEXTEN     : 2;            /*!< JEXTEN                                                                    */
      __IOM uint32_t JSQ1       : 5;            /*!< JSQ1                                                                      */
            uint32_t            : 1;
      __IOM uint32_t JSQ2       : 5;            /*!< JSQ2                                                                      */
            uint32_t            : 1;
      __IOM uint32_t JSQ3       : 5;            /*!< JSQ3                                                                      */
            uint32_t            : 1;
      __IOM uint32_t JSQ4       : 5;            /*!< JSQ4                                                                      */
    } JSQR_b;
  } ;
  __IM  uint32_t  RESERVED3[4];
  
  union {
    __IOM uint32_t OFR1;                        /*!< offset register 1                                                         */
    
