unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CALFACT_S  : 7;            /*!< CALFACT_S                                                                 */
            uint32_t            : 9;
      __IOM uint32_t CALFACT_D  : 7;            /*!< CALFACT_D                                                                 */
            uint32_t            : 9;
    } CALFACT_b;
  } ;
  __IM  uint32_t  RESERVED7[2];
  
  union {
    __IOM uint32_t GCOMP;                       /*!< Gain compensation Register                                                */
    
    struct {
      __IOM uint32_t GCOMPCOEFF : 14;           /*!< GCOMPCOEFF                                                                */
            uint32_t            : 18;
    } GCOMP_b;
  } ;
} ADC1_Type;                                    /*!< Size = 196 (0xc4)                                                         */



/* =========================================================================================================================== */
/* ================                                           ADC3                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-Digital Converter (ADC3)
  */

typedef struct {                                /*!< ADC3 Structure                                                            */
  
  union {
    __IOM uint32_t ISR;                         /*!< interrupt and status register                                             */
    
    struct {
      __IOM uint32_t ADRDY      : 1;            /*!< ADRDY                                                                     */
      __IOM uint32_t EOSMP      : 1;            /*!< EOSMP                                                                     */
      __IOM uint32_t EOC        : 1;            /*!< EOC                                                                       */
      __IOM uint32_t EOS        : 1;            /*!< EOS                                                                       */
      __IOM uint32_t OVR        : 1;            /*!< OVR                                                                       */
      __IOM uint32_t JEOC       : 1;            /*!< JEOC                                                                      */
      __IOM uint32_t JEOS       : 1;            /*!< JEOS                                                                      */
      __IOM uint32_t AWD1       : 1;            /*!< AWD1                                                                      */
      __IOM uint32_t AWD2       : 1;            /*!< AWD2                                                                      */
      __IOM uint32_t AWD3       : 1;            /*!< AWD3                                                                      */
      __IOM uint32_t JQOVF      : 1;            /*!< JQOVF                                                                     */
            uint32_t            : 21;
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< interrupt enable register                                                 */
    
    struct {
      __IOM uint32_t ADRDYIE    : 1;            /*!< ADRDYIE                                                                   */
      __IOM uint32_t EOSMPIE    : 1;            /*!< EOSMPIE                                                                   */
      __IOM uint32_t EOCIE      : 1;            /*!< EOCIE                                                                     */
      __IOM uint32_t EOSIE      : 1;            /*!< EOSIE                                                                     */
      __IOM uint32_t OVRIE      : 1;            /*!< OVRIE                                                                     */
      __IOM uint32_t JEOCIE     : 1;            /*!< JEOCIE                                                                    */
      __IOM uint32_t JEOSIE     : 1;            /*!< JEOSIE                                                                    */
      __IOM uint32_t AWD1IE     : 1;            /*!< AWD1IE                                                                    */
      __IOM uint32_t AWD2IE     : 1;            /*!< AWD2IE                                                                    */
      __IOM uint32_t AWD3IE     : 1;            /*!< AWD3IE                                                                    */
      __IOM uint32_t JQOVFIE    : 1;            /*!< JQOVFIE                                                                   */
            uint32_t            : 21;
    } IER_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< control register                                                          */
    
    struct {
      __IOM uint32_t ADEN       : 1;            /*!< ADEN                                                                      */
      __IOM uint32_t ADDIS      : 1;            /*!< ADDIS                                                                     */
      __IOM uint32_t ADSTART    : 1;            /*!< ADSTART                                                                   */
      __IOM uint32_t JADSTART   : 1;            /*!< JADSTART                                                                  */
      __IOM uint32_t ADSTP      : 1;            /*!< ADSTP                                                                     */
      __IOM uint32_t JADSTP     : 1;            /*!< JADSTP                                                                    */
            uint32_t            : 22;
      __IOM uint32_t ADVREGEN   : 1;            /*!< ADVREGEN                                                                  */
      __IOM uint32_t DEEPPWD    : 1;            /*!< DEEPPWD                                                                   */
      __IOM uint32_t ADCALDIF   : 1;            /*!< ADCALDIF                                                                  */
      __IOM uint32_t ADCAL      : 1;            /*!< ADCAL                                                                     */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< configuration register                                                    */
    
