unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMAEN                                                                     */
      __IOM uint32_t DMACFG     : 1;            /*!< DMACFG                                                                    */
            uint32_t            : 1;
      __IOM uint32_t RES        : 2;            /*!< RES                                                                       */
      __IOM uint32_t EXTSEL     : 5;            /*!< EXTSEL                                                                    */
      __IOM uint32_t EXTEN      : 2;            /*!< EXTEN                                                                     */
      __IOM uint32_t OVRMOD     : 1;            /*!< OVRMOD                                                                    */
      __IOM uint32_t CONT       : 1;            /*!< CONT                                                                      */
      __IOM uint32_t AUTDLY     : 1;            /*!< AUTDLY                                                                    */
      __IOM uint32_t ALIGN      : 1;            /*!< ALIGN                                                                     */
      __IOM uint32_t DISCEN     : 1;            /*!< DISCEN                                                                    */
      __IOM uint32_t DISCNUM    : 3;            /*!< DISCNUM                                                                   */
      __IOM uint32_t JDISCEN    : 1;            /*!< JDISCEN                                                                   */
      __IOM uint32_t JQM        : 1;            /*!< JQM                                                                       */
      __IOM uint32_t AWD1SGL    : 1;            /*!< AWD1SGL                                                                   */
      __IOM uint32_t AWD1EN     : 1;            /*!< AWD1EN                                                                    */
      __IOM uint32_t JAWD1EN    : 1;            /*!< JAWD1EN                                                                   */
      __IOM uint32_t JAUTO      : 1;            /*!< JAUTO                                                                     */
      __IOM uint32_t AWDCH1CH   : 5;            /*!< AWDCH1CH                                                                  */
      __IOM uint32_t JQDIS      : 1;            /*!< Injected Queue disable                                                    */
    } CFGR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR2;                       /*!< configuration register                                                    */
    
    struct {
      __IOM uint32_t ROVSE      : 1;            /*!< DMAEN                                                                     */
      __IOM uint32_t JOVSE      : 1;            /*!< DMACFG                                                                    */
      __IOM uint32_t OVSR       : 3;            /*!< RES                                                                       */
      __IOM uint32_t OVSS       : 4;            /*!< ALIGN                                                                     */
      __IOM uint32_t TROVS      : 1;            /*!< Triggered Regular Oversampling                                            */
      __IOM uint32_t ROVSM      : 1;            /*!< EXTEN                                                                     */
            uint32_t            : 5;
      __IOM uint32_t GCOMP      : 1;            /*!< GCOMP                                                                     */
            uint32_t            : 8;
      __IOM uint32_t SWTRIG     : 1;            /*!< SWTRIG                                                                    */
      __IOM uint32_t BULB       : 1;            /*!< BULB                                                                      */
      __IOM uint32_t SMPTRIG    : 1;            /*!< SMPTRIG                                                                   */
            uint32_t            : 4;
    } CFGR2_b;
  } ;
  
  union {
    __IOM uint32_t SMPR1;                       /*!< sample time register 1                                                    */
    
    struct {
      __IOM uint32_t SMP0       : 3;            /*!< SMP0                                                                      */
      __IOM uint32_t SMP1       : 3;            /*!< SMP1                                                                      */
      __IOM uint32_t SMP2       : 3;            /*!< SMP2                                                                      */
      __IOM uint32_t SMP3       : 3;            /*!< SMP3                                                                      */
      __IOM uint32_t SMP4       : 3;            /*!< SMP4                                                                      */
      __IOM uint32_t SMP5       : 3;            /*!< SMP5                                                                      */
      __IOM uint32_t SMP6       : 3;            /*!< SMP6                                                                      */
      __IOM uint32_t SMP7       : 3;            /*!< SMP7                                                                      */
      __IOM uint32_t SMP8       : 3;            /*!< SMP8                                                                      */
      __IOM uint32_t SMP9       : 3;            /*!< SMP9                                                                      */
            uint32_t            : 1;
      __IOM uint32_t SMPPLUS    : 1;            /*!< Addition of one clock cycle to the sampling time                          */
    } SMPR1_b;
  } ;
  
  union {
    __IOM uint32_t SMPR2;                       /*!< sample time register 2                                                    */
    
    struct {
      __IOM uint32_t SMP10      : 3;            /*!< SMP10                                                                     */
      __IOM uint32_t SMP11      : 3;            /*!< SMP11                                                                     */
      __IOM uint32_t SMP12      : 3;            /*!< SMP12                                                                     */
      __IOM uint32_t SMP13      : 3;            /*!< SMP13                                                                     */
      __IOM uint32_t SMP14      : 3;            /*!< SMP14                                                                     */
      __IOM uint32_t SMP15      : 3;            /*!< SMP15                                                                     */
      __IOM uint32_t SMP16      : 3;            /*!< SMP16                                                                     */
      __IOM uint32_t SMP17      : 3;            /*!< SMP17                                                                     */
      __IOM uint32_t SMP18      : 3;            /*!< SMP18                                                                     */
            uint32_t            : 5;
    } SMPR2_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t TR1;                         /*!< watchdog threshold register 1                                             */
    
