unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t OFFSET1    : 12;           /*!< OFFSET1                                                                   */
            uint32_t            : 12;
      __IOM uint32_t OFFSETPOS  : 1;            /*!< OFFSETPOS                                                                 */
      __IOM uint32_t SATEN      : 1;            /*!< SATEN                                                                     */
      __IOM uint32_t OFFSET1_CH : 5;            /*!< OFFSET1_CH                                                                */
      __IOM uint32_t OFFSET1_EN : 1;            /*!< OFFSET1_EN                                                                */
    } OFR1_b;
  } ;
  
  union {
    __IOM uint32_t OFR2;                        /*!< offset register 2                                                         */
    
    struct {
      __IOM uint32_t OFFSET1    : 12;           /*!< OFFSET1                                                                   */
            uint32_t            : 12;
      __IOM uint32_t OFFSETPOS  : 1;            /*!< OFFSETPOS                                                                 */
      __IOM uint32_t SATEN      : 1;            /*!< SATEN                                                                     */
      __IOM uint32_t OFFSET1_CH : 5;            /*!< OFFSET1_CH                                                                */
      __IOM uint32_t OFFSET1_EN : 1;            /*!< OFFSET1_EN                                                                */
    } OFR2_b;
  } ;
  
  union {
    __IOM uint32_t OFR3;                        /*!< offset register 3                                                         */
    
    struct {
      __IOM uint32_t OFFSET1    : 12;           /*!< OFFSET1                                                                   */
            uint32_t            : 12;
      __IOM uint32_t OFFSETPOS  : 1;            /*!< OFFSETPOS                                                                 */
      __IOM uint32_t SATEN      : 1;            /*!< SATEN                                                                     */
      __IOM uint32_t OFFSET1_CH : 5;            /*!< OFFSET1_CH                                                                */
      __IOM uint32_t OFFSET1_EN : 1;            /*!< OFFSET1_EN                                                                */
    } OFR3_b;
  } ;
  
  union {
    __IOM uint32_t OFR4;                        /*!< offset register 4                                                         */
    
    struct {
      __IOM uint32_t OFFSET1    : 12;           /*!< OFFSET1                                                                   */
            uint32_t            : 12;
      __IOM uint32_t OFFSETPOS  : 1;            /*!< OFFSETPOS                                                                 */
      __IOM uint32_t SATEN      : 1;            /*!< SATEN                                                                     */
      __IOM uint32_t OFFSET1_CH : 5;            /*!< OFFSET1_CH                                                                */
      __IOM uint32_t OFFSET1_EN : 1;            /*!< OFFSET1_EN                                                                */
    } OFR4_b;
  } ;
  __IM  uint32_t  RESERVED4[4];
  
  union {
    __IM  uint32_t JDR1;                        /*!< injected data register 1                                                  */
    
    struct {
      __IM  uint32_t JDATA1     : 16;           /*!< JDATA1                                                                    */
            uint32_t            : 16;
    } JDR1_b;
  } ;
  
  union {
    __IM  uint32_t JDR2;                        /*!< injected data register 2                                                  */
    
    struct {
      __IM  uint32_t JDATA2     : 16;           /*!< JDATA2                                                                    */
            uint32_t            : 16;
    } JDR2_b;
  } ;
  
  union {
    __IM  uint32_t JDR3;                        /*!< injected data register 3                                                  */
    
    struct {
      __IM  uint32_t JDATA3     : 16;           /*!< JDATA3                                                                    */
            uint32_t            : 16;
    } JDR3_b;
  } ;
  
  union {
    __IM  uint32_t JDR4;                        /*!< injected data register 4                                                  */
    
    struct {
      __IM  uint32_t JDATA4     : 16;           /*!< JDATA4                                                                    */
            uint32_t            : 16;
    } JDR4_b;
  } ;
  __IM  uint32_t  RESERVED5[4];
  
  union {
    __IOM uint32_t AWD2CR;                      /*!< Analog Watchdog 2 Configuration Register                                  */
    
    struct {
      __IOM uint32_t AWD2CH     : 19;           /*!< AWD2CH                                                                    */
            uint32_t            : 13;
    } AWD2CR_b;
  } ;
  
  union {
    __IOM uint32_t AWD3CR;                      /*!< Analog Watchdog 3 Configuration Register                                  */
    
    struct {
      __IOM uint32_t AWD3CH     : 19;           /*!< AWD3CH                                                                    */
            uint32_t            : 13;
    } AWD3CR_b;
  } ;
  __IM  uint32_t  RESERVED6[2];
  
  union {
    __IOM uint32_t DIFSEL;                      /*!< Differential Mode Selection Register 2                                    */
    
    struct {
      __IM  uint32_t DIFSEL_0   : 1;            /*!< Differential mode for channels 0                                          */
      __IOM uint32_t DIFSEL_1_18 : 18;          /*!< Differential mode for channels 15 to 1                                    */
            uint32_t            : 13;
    } DIFSEL_b;
  } ;
  
  union {
    __IOM uint32_t CALFACT;                     /*!< Calibration Factors                                                       */
    
