unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t CALFACT_S  : 7;            /*!< CALFACT_S                                                                 */
            uint32_t            : 9;
      __IOM uint32_t CALFACT_D  : 7;            /*!< CALFACT_D                                                                 */
            uint32_t            : 9;
    } CALFACT_b;
  } ;
  __IM  uint32_t  RESERVED7[2];
  
  union {
    __IOM uint32_t GCOMP;                       /*!< Gain compensation Register                                                */
    
    struct {
      __IOM uint32_t GCOMPCOEFF : 14;           /*!< GCOMPCOEFF                                                                */
            uint32_t            : 18;
    } GCOMP_b;
  } ;
} ADC3_Type;                                    /*!< Size = 196 (0xc4)                                                         */



/* =========================================================================================================================== */
/* ================                                       ADC12_Common                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-Digital Converter (ADC12_Common)
  */

typedef struct {                                /*!< ADC12_Common Structure                                                    */
  
  union {
    __IM  uint32_t CSR;                         /*!< ADC Common status register                                                */
    
    struct {
      __IM  uint32_t ADDRDY_MST : 1;            /*!< ADDRDY_MST                                                                */
      __IM  uint32_t EOSMP_MST  : 1;            /*!< EOSMP_MST                                                                 */
      __IM  uint32_t EOC_MST    : 1;            /*!< EOC_MST                                                                   */
      __IM  uint32_t EOS_MST    : 1;            /*!< EOS_MST                                                                   */
      __IM  uint32_t OVR_MST    : 1;            /*!< OVR_MST                                                                   */
      __IM  uint32_t JEOC_MST   : 1;            /*!< JEOC_MST                                                                  */
      __IM  uint32_t JEOS_MST   : 1;            /*!< JEOS_MST                                                                  */
      __IM  uint32_t AWD1_MST   : 1;            /*!< AWD1_MST                                                                  */
      __IM  uint32_t AWD2_MST   : 1;            /*!< AWD2_MST                                                                  */
      __IM  uint32_t AWD3_MST   : 1;            /*!< AWD3_MST                                                                  */
      __IM  uint32_t JQOVF_MST  : 1;            /*!< JQOVF_MST                                                                 */
            uint32_t            : 5;
      __IM  uint32_t ADRDY_SLV  : 1;            /*!< ADRDY_SLV                                                                 */
      __IM  uint32_t EOSMP_SLV  : 1;            /*!< EOSMP_SLV                                                                 */
      __IM  uint32_t EOC_SLV    : 1;            /*!< End of regular conversion of the slave ADC                                */
      __IM  uint32_t EOS_SLV    : 1;            /*!< End of regular sequence flag of the slave ADC                             */
      __IM  uint32_t OVR_SLV    : 1;            /*!< Overrun flag of the slave ADC                                             */
      __IM  uint32_t JEOC_SLV   : 1;            /*!< End of injected conversion flag of the slave ADC                          */
      __IM  uint32_t JEOS_SLV   : 1;            /*!< End of injected sequence flag of the slave ADC                            */
      __IM  uint32_t AWD1_SLV   : 1;            /*!< Analog watchdog 1 flag of the slave ADC                                   */
      __IM  uint32_t AWD2_SLV   : 1;            /*!< Analog watchdog 2 flag of the slave ADC                                   */
      __IM  uint32_t AWD3_SLV   : 1;            /*!< Analog watchdog 3 flag of the slave ADC                                   */
      __IM  uint32_t JQOVF_SLV  : 1;            /*!< Injected Context Queue Overflow flag of the slave ADC                     */
            uint32_t            : 5;
    } CSR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CCR;                         /*!< ADC common control register                                               */
    
    struct {
      __IOM uint32_t DUAL       : 5;            /*!< Dual ADC mode selection                                                   */
            uint32_t            : 3;
      __IOM uint32_t DELAY      : 4;            /*!< Delay between 2 sampling phases                                           */
            uint32_t            : 1;
      __IOM uint32_t DMACFG     : 1;            /*!< DMA configuration (for multi-ADC mode)                                    */
      __IOM uint32_t MDMA       : 2;            /*!< Direct memory access mode for multi ADC mode                              */
      __IOM uint32_t CKMODE     : 2;            /*!< ADC clock mode                                                            */
      __IOM uint32_t PRESC      : 4;            /*!< ADC prescaler                                                             */
      __IOM uint32_t VREFEN     : 1;            /*!< VREFINT enable                                                            */
      __IOM uint32_t VSENSESEL  : 1;            /*!< VTS selection                                                             */
      __IOM uint32_t VBATSEL    : 1;            /*!< VBAT selection                                                            */
            uint32_t            : 7;
    } CCR_b;
  } ;
  
  union {
    __IM  uint32_t CDR;                         /*!< ADC common regular data register for dual and triple modes                */
    
