unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t RDATA_MST  : 16;           /*!< Regular data of the master ADC                                            */
      __IM  uint32_t RDATA_SLV  : 16;           /*!< Regular data of the slave ADC                                             */
    } CDR_b;
  } ;
} ADC12_Common_Type;                            /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           FMAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Filter Math Accelerator (FMAC)
  */

typedef struct {                                /*!< FMAC Structure                                                            */
  
  union {
    __IOM uint32_t X1BUFCFG;                    /*!< FMAC X1 Buffer Configuration register                                     */
    
    struct {
      __IOM uint32_t X1_BASE    : 8;            /*!< X1_BASE                                                                   */
      __IOM uint32_t X1_BUF_SIZE : 8;           /*!< X1_BUF_SIZE                                                               */
            uint32_t            : 8;
      __IOM uint32_t FULL_WM    : 2;            /*!< FULL_WM                                                                   */
            uint32_t            : 6;
    } X1BUFCFG_b;
  } ;
  
  union {
    __IOM uint32_t X2BUFCFG;                    /*!< FMAC X2 Buffer Configuration register                                     */
    
    struct {
      __IOM uint32_t X2_BASE    : 8;            /*!< X1_BASE                                                                   */
      __IOM uint32_t X2_BUF_SIZE : 8;           /*!< X1_BUF_SIZE                                                               */
            uint32_t            : 16;
    } X2BUFCFG_b;
  } ;
  
  union {
    __IOM uint32_t YBUFCFG;                     /*!< FMAC Y Buffer Configuration register                                      */
    
    struct {
      __IOM uint32_t Y_BASE     : 8;            /*!< X1_BASE                                                                   */
      __IOM uint32_t Y_BUF_SIZE : 8;            /*!< X1_BUF_SIZE                                                               */
            uint32_t            : 8;
      __IOM uint32_t EMPTY_WM   : 2;            /*!< EMPTY_WM                                                                  */
            uint32_t            : 6;
    } YBUFCFG_b;
  } ;
  
  union {
    __IOM uint32_t PARAM;                       /*!< FMAC Parameter register                                                   */
    
    struct {
      __IOM uint32_t P          : 8;            /*!< P                                                                         */
      __IOM uint32_t Q          : 8;            /*!< Q                                                                         */
      __IOM uint32_t R          : 8;            /*!< R                                                                         */
      __IOM uint32_t FUNC       : 7;            /*!< FUNC                                                                      */
      __IOM uint32_t START      : 1;            /*!< START                                                                     */
    } PARAM_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< FMAC Control register                                                     */
    
    struct {
      __IOM uint32_t RIEN       : 1;            /*!< RIEN                                                                      */
      __IOM uint32_t WIEN       : 1;            /*!< WIEN                                                                      */
      __IOM uint32_t OVFLIEN    : 1;            /*!< OVFLIEN                                                                   */
      __IOM uint32_t UNFLIEN    : 1;            /*!< UNFLIEN                                                                   */
      __IOM uint32_t SATIEN     : 1;            /*!< SATIEN                                                                    */
            uint32_t            : 3;
      __IOM uint32_t DMAREN     : 1;            /*!< DMAREN                                                                    */
      __IOM uint32_t DMAWEN     : 1;            /*!< DMAWEN                                                                    */
            uint32_t            : 5;
      __IOM uint32_t CLIPEN     : 1;            /*!< CLIPEN                                                                    */
      __IOM uint32_t RESET      : 1;            /*!< RESET                                                                     */
            uint32_t            : 15;
    } CR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< FMAC Status register                                                      */
    
    struct {
      __IM  uint32_t YEMPTY     : 1;            /*!< YEMPTY                                                                    */
      __IM  uint32_t X1FULL     : 1;            /*!< X1FULL                                                                    */
            uint32_t            : 6;
      __IM  uint32_t OVFL       : 1;            /*!< OVFL                                                                      */
      __IM  uint32_t UNFL       : 1;            /*!< UNFL                                                                      */
      __IM  uint32_t SAT        : 1;            /*!< SAT                                                                       */
            uint32_t            : 21;
    } SR_b;
  } ;
  
  union {
    __OM  uint32_t WDATA;                       /*!< FMAC Write Data register                                                  */
    
