unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __OM  uint32_t WDATA      : 16;           /*!< WDATA                                                                     */
            uint32_t            : 16;
    } WDATA_b;
  } ;
  
  union {
    __IM  uint32_t RDATA;                       /*!< FMAC Read Data register                                                   */
    
    struct {
      __IM  uint32_t RDATA      : 16;           /*!< RDATA                                                                     */
            uint32_t            : 16;
    } RDATA_b;
  } ;
} FMAC_Type;                                    /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                          CORDIC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CORDIC Co-processor (CORDIC)
  */

typedef struct {                                /*!< CORDIC Structure                                                          */
  
  union {
    __IOM uint32_t CSR;                         /*!< CORDIC Control Status register                                            */
    
    struct {
      __IOM uint32_t FUNC       : 4;            /*!< FUNC                                                                      */
      __IOM uint32_t PRECISION  : 4;            /*!< PRECISION                                                                 */
      __IOM uint32_t SCALE      : 3;            /*!< SCALE                                                                     */
            uint32_t            : 5;
      __IOM uint32_t IEN        : 1;            /*!< IEN                                                                       */
      __IOM uint32_t DMAREN     : 1;            /*!< DMAREN                                                                    */
      __IOM uint32_t DMAWEN     : 1;            /*!< DMAWEN                                                                    */
      __IOM uint32_t NRES       : 1;            /*!< NRES                                                                      */
      __IOM uint32_t NARGS      : 1;            /*!< NARGS                                                                     */
      __IOM uint32_t RESSIZE    : 1;            /*!< RESSIZE                                                                   */
      __IOM uint32_t ARGSIZE    : 1;            /*!< ARGSIZE                                                                   */
            uint32_t            : 8;
      __IOM uint32_t RRDY       : 1;            /*!< RRDY                                                                      */
    } CSR_b;
  } ;
  
  union {
    __IOM uint32_t WDATA;                       /*!< FMAC Write Data register                                                  */
    
    struct {
      __IOM uint32_t ARG        : 32;           /*!< ARG                                                                       */
    } WDATA_b;
  } ;
  
  union {
    __IM  uint32_t RDATA;                       /*!< FMAC Read Data register                                                   */
    
    struct {
      __IM  uint32_t RES        : 32;           /*!< RES                                                                       */
    } RDATA_b;
  } ;
} CORDIC_Type;                                  /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            SAI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial audio interface (SAI)
  */

typedef struct {                                /*!< SAI Structure                                                             */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ACR1;                        /*!< AConfiguration register 1                                                 */
    
    struct {
      __IOM uint32_t MODE       : 2;            /*!< Audio block mode                                                          */
      __IOM uint32_t PRTCFG     : 2;            /*!< Protocol configuration                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS         : 3;            /*!< Data size                                                                 */
      __IOM uint32_t LSBFIRST   : 1;            /*!< Least significant bit first                                               */
      __IOM uint32_t CKSTR      : 1;            /*!< Clock strobing edge                                                       */
      __IOM uint32_t SYNCEN     : 2;            /*!< Synchronization enable                                                    */
      __IOM uint32_t MONO       : 1;            /*!< Mono mode                                                                 */
      __IOM uint32_t OutDri     : 1;            /*!< Output drive                                                              */
            uint32_t            : 2;
      __IOM uint32_t SAIAEN     : 1;            /*!< Audio block A enable                                                      */
      __IOM uint32_t DMAEN      : 1;            /*!< DMA enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t NODIV      : 1;            /*!< No divider                                                                */
      __IOM uint32_t MCJDIV     : 6;            /*!< Master clock divider                                                      */
      __IOM uint32_t OSR        : 1;            /*!< OSR                                                                       */
      __IOM uint32_t MCKEN      : 1;            /*!< MCKEN                                                                     */
            uint32_t            : 4;
    } ACR1_b;
  } ;
  
  union {
    __IOM uint32_t ACR2;                        /*!< AConfiguration register 2                                                 */
    
