unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t FTH        : 3;            /*!< FIFO threshold                                                            */
      __IOM uint32_t FFLUS      : 1;            /*!< FIFO flush                                                                */
      __IOM uint32_t TRIS       : 1;            /*!< Tristate management on data line                                          */
      __IOM uint32_t MUTE       : 1;            /*!< Mute                                                                      */
      __IOM uint32_t MUTEVAL    : 1;            /*!< Mute value                                                                */
      __IOM uint32_t MUTECN     : 6;            /*!< Mute counter                                                              */
      __IOM uint32_t CPL        : 1;            /*!< Complement bit                                                            */
      __IOM uint32_t COMP       : 2;            /*!< Companding mode                                                           */
            uint32_t            : 16;
    } ACR2_b;
  } ;
  
  union {
    __IOM uint32_t AFRCR;                       /*!< AFRCR                                                                     */
    
    struct {
      __IOM uint32_t FRL        : 8;            /*!< Frame length                                                              */
      __IOM uint32_t FSALL      : 7;            /*!< Frame synchronization active level length                                 */
            uint32_t            : 1;
      __IOM uint32_t FSDEF      : 1;            /*!< Frame synchronization definition                                          */
      __IOM uint32_t FSPOL      : 1;            /*!< Frame synchronization polarity                                            */
      __IOM uint32_t FSOFF      : 1;            /*!< Frame synchronization offset                                              */
            uint32_t            : 13;
    } AFRCR_b;
  } ;
  
  union {
    __IOM uint32_t ASLOTR;                      /*!< ASlot register                                                            */
    
    struct {
      __IOM uint32_t FBOFF      : 5;            /*!< First bit offset                                                          */
            uint32_t            : 1;
      __IOM uint32_t SLOTSZ     : 2;            /*!< Slot size                                                                 */
      __IOM uint32_t NBSLOT     : 4;            /*!< Number of slots in an audio frame                                         */
            uint32_t            : 4;
      __IOM uint32_t SLOTEN     : 16;           /*!< Slot enable                                                               */
    } ASLOTR_b;
  } ;
  
  union {
    __IOM uint32_t AIM;                         /*!< AInterrupt mask register2                                                 */
    
    struct {
      __IOM uint32_t OVRUDRIE   : 1;            /*!< Overrun/underrun interrupt enable                                         */
      __IOM uint32_t MUTEDET    : 1;            /*!< Mute detection interrupt enable                                           */
      __IOM uint32_t WCKCFG     : 1;            /*!< Wrong clock configuration interrupt enable                                */
      __IOM uint32_t FREQIE     : 1;            /*!< FIFO request interrupt enable                                             */
      __IOM uint32_t CNRDYIE    : 1;            /*!< Codec not ready interrupt enable                                          */
      __IOM uint32_t AFSDETIE   : 1;            /*!< Anticipated frame synchronization detection interrupt enable              */
      __IOM uint32_t LFSDET     : 1;            /*!< Late frame synchronization detection interrupt enable                     */
            uint32_t            : 25;
    } AIM_b;
  } ;
  
  union {
    __IOM uint32_t ASR;                         /*!< AStatus register                                                          */
    
    struct {
      __IOM uint32_t OVRUDR     : 1;            /*!< Overrun / underrun                                                        */
      __IOM uint32_t MUTEDET    : 1;            /*!< Mute detection                                                            */
      __IOM uint32_t WCKCFG     : 1;            /*!< Wrong clock configuration flag. This bit is read only                     */
      __IOM uint32_t FREQ       : 1;            /*!< FIFO request                                                              */
      __IOM uint32_t CNRDY      : 1;            /*!< Codec not ready                                                           */
      __IOM uint32_t AFSDET     : 1;            /*!< Anticipated frame synchronization detection                               */
      __IOM uint32_t LFSDET     : 1;            /*!< Late frame synchronization detection                                      */
            uint32_t            : 9;
      __IOM uint32_t FLVL       : 3;            /*!< FIFO level threshold                                                      */
            uint32_t            : 13;
    } ASR_b;
  } ;
  
  union {
    __IOM uint32_t ACLRFR;                      /*!< AClear flag register                                                      */
    
    struct {
      __IOM uint32_t OVRUDR     : 1;            /*!< Clear overrun / underrun                                                  */
      __IOM uint32_t MUTEDET    : 1;            /*!< Mute detection flag                                                       */
      __IOM uint32_t WCKCFG     : 1;            /*!< Clear wrong clock configuration flag                                      */
            uint32_t            : 1;
      __IOM uint32_t CNRDY      : 1;            /*!< Clear codec not ready flag                                                */
      __IOM uint32_t CAFSDET    : 1;            /*!< Clear anticipated frame synchronization detection flag                    */
      __IOM uint32_t LFSDET     : 1;            /*!< Clear late frame synchronization detection flag                           */
            uint32_t            : 25;
    } ACLRFR_b;
  } ;
  
  union {
    __IOM uint32_t ADR;                         /*!< AData register                                                            */
    
