unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t DATA       : 32;           /*!< Data                                                                      */
    } ADR_b;
  } ;
  
  union {
    __IOM uint32_t BCR1;                        /*!< BConfiguration register 1                                                 */
    
    struct {
      __IOM uint32_t MODE       : 2;            /*!< Audio block mode                                                          */
      __IOM uint32_t PRTCFG     : 2;            /*!< Protocol configuration                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS         : 3;            /*!< Data size                                                                 */
      __IOM uint32_t LSBFIRST   : 1;            /*!< Least significant bit first                                               */
      __IOM uint32_t CKSTR      : 1;            /*!< Clock strobing edge                                                       */
      __IOM uint32_t SYNCEN     : 2;            /*!< Synchronization enable                                                    */
      __IOM uint32_t MONO       : 1;            /*!< Mono mode                                                                 */
      __IOM uint32_t OutDri     : 1;            /*!< Output drive                                                              */
            uint32_t            : 2;
      __IOM uint32_t SAIBEN     : 1;            /*!< Audio block B enable                                                      */
      __IOM uint32_t DMAEN      : 1;            /*!< DMA enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t NODIV      : 1;            /*!< No divider                                                                */
      __IOM uint32_t MCJDIV     : 6;            /*!< Master clock divider                                                      */
      __IOM uint32_t OSR        : 1;            /*!< OSR                                                                       */
      __IOM uint32_t MCKEN      : 1;            /*!< MCKEN                                                                     */
            uint32_t            : 4;
    } BCR1_b;
  } ;
  
  union {
    __IOM uint32_t BCR2;                        /*!< BConfiguration register 2                                                 */
    
    struct {
      __IOM uint32_t FTH        : 3;            /*!< FIFO threshold                                                            */
      __IOM uint32_t FFLUS      : 1;            /*!< FIFO flush                                                                */
      __IOM uint32_t TRIS       : 1;            /*!< Tristate management on data line                                          */
      __IOM uint32_t MUTE       : 1;            /*!< Mute                                                                      */
      __IOM uint32_t MUTEVAL    : 1;            /*!< Mute value                                                                */
      __IOM uint32_t MUTECN     : 6;            /*!< Mute counter                                                              */
      __IOM uint32_t CPL        : 1;            /*!< Complement bit                                                            */
      __IOM uint32_t COMP       : 2;            /*!< Companding mode                                                           */
            uint32_t            : 16;
    } BCR2_b;
  } ;
  
  union {
    __IOM uint32_t BFRCR;                       /*!< BFRCR                                                                     */
    
    struct {
      __IOM uint32_t FRL        : 8;            /*!< Frame length                                                              */
      __IOM uint32_t FSALL      : 7;            /*!< Frame synchronization active level length                                 */
            uint32_t            : 1;
      __IOM uint32_t FSDEF      : 1;            /*!< Frame synchronization definition                                          */
      __IOM uint32_t FSPOL      : 1;            /*!< Frame synchronization polarity                                            */
      __IOM uint32_t FSOFF      : 1;            /*!< Frame synchronization offset                                              */
            uint32_t            : 13;
    } BFRCR_b;
  } ;
  
  union {
    __IOM uint32_t BSLOTR;                      /*!< BSlot register                                                            */
    
    struct {
      __IOM uint32_t FBOFF      : 5;            /*!< First bit offset                                                          */
            uint32_t            : 1;
      __IOM uint32_t SLOTSZ     : 2;            /*!< Slot size                                                                 */
      __IOM uint32_t NBSLOT     : 4;            /*!< Number of slots in an audio frame                                         */
            uint32_t            : 4;
      __IOM uint32_t SLOTEN     : 16;           /*!< Slot enable                                                               */
    } BSLOTR_b;
  } ;
  
  union {
    __IOM uint32_t BIM;                         /*!< BInterrupt mask register2                                                 */
    
    struct {
      __IOM uint32_t OVRUDRIE   : 1;            /*!< Overrun/underrun interrupt enable                                         */
      __IOM uint32_t MUTEDET    : 1;            /*!< Mute detection interrupt enable                                           */
      __IOM uint32_t WCKCFG     : 1;            /*!< Wrong clock configuration interrupt enable                                */
      __IOM uint32_t FREQIE     : 1;            /*!< FIFO request interrupt enable                                             */
      __IOM uint32_t CNRDYIE    : 1;            /*!< Codec not ready interrupt enable                                          */
      __IOM uint32_t AFSDETIE   : 1;            /*!< Anticipated frame synchronization detection interrupt enable              */
      __IOM uint32_t LFSDETIE   : 1;            /*!< Late frame synchronization detection interrupt enable                     */
            uint32_t            : 25;
    } BIM_b;
  } ;
  
  union {
    __IM  uint32_t BSR;                         /*!< BStatus register                                                          */
    
