unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t OVRUDR     : 1;            /*!< Overrun / underrun                                                        */
      __IM  uint32_t MUTEDET    : 1;            /*!< Mute detection                                                            */
      __IM  uint32_t WCKCFG     : 1;            /*!< Wrong clock configuration flag                                            */
      __IM  uint32_t FREQ       : 1;            /*!< FIFO request                                                              */
      __IM  uint32_t CNRDY      : 1;            /*!< Codec not ready                                                           */
      __IM  uint32_t AFSDET     : 1;            /*!< Anticipated frame synchronization detection                               */
      __IM  uint32_t LFSDET     : 1;            /*!< Late frame synchronization detection                                      */
            uint32_t            : 9;
      __IM  uint32_t FLVL       : 3;            /*!< FIFO level threshold                                                      */
            uint32_t            : 13;
    } BSR_b;
  } ;
  
  union {
    __OM  uint32_t BCLRFR;                      /*!< BClear flag register                                                      */
    
    struct {
      __OM  uint32_t OVRUDR     : 1;            /*!< Clear overrun / underrun                                                  */
      __OM  uint32_t MUTEDET    : 1;            /*!< Mute detection flag                                                       */
      __OM  uint32_t WCKCFG     : 1;            /*!< Clear wrong clock configuration flag                                      */
            uint32_t            : 1;
      __OM  uint32_t CNRDY      : 1;            /*!< Clear codec not ready flag                                                */
      __OM  uint32_t CAFSDET    : 1;            /*!< Clear anticipated frame synchronization detection flag                    */
      __OM  uint32_t LFSDET     : 1;            /*!< Clear late frame synchronization detection flag                           */
            uint32_t            : 25;
    } BCLRFR_b;
  } ;
  
  union {
    __IOM uint32_t BDR;                         /*!< BData register                                                            */
    
    struct {
      __IOM uint32_t DATA       : 32;           /*!< Data                                                                      */
    } BDR_b;
  } ;
  
  union {
    __IOM uint32_t PDMCR;                       /*!< PDM control register                                                      */
    
    struct {
      __IOM uint32_t PDMEN      : 1;            /*!< PDMEN                                                                     */
            uint32_t            : 3;
      __IOM uint32_t MICNBR     : 2;            /*!< MICNBR                                                                    */
            uint32_t            : 2;
      __IOM uint32_t CKEN1      : 1;            /*!< CKEN1                                                                     */
      __IOM uint32_t CKEN2      : 1;            /*!< CKEN2                                                                     */
      __IOM uint32_t CKEN3      : 1;            /*!< CKEN3                                                                     */
      __IOM uint32_t CKEN4      : 1;            /*!< CKEN4                                                                     */
            uint32_t            : 20;
    } PDMCR_b;
  } ;
  
  union {
    __IOM uint32_t PDMDLY;                      /*!< PDM delay register                                                        */
    
    struct {
      __IOM uint32_t DLYM1L     : 3;            /*!< DLYM1L                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM1R     : 3;            /*!< DLYM1R                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM2L     : 3;            /*!< DLYM2L                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM2R     : 3;            /*!< DLYM2R                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM3L     : 3;            /*!< DLYM3L                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM3R     : 3;            /*!< DLYM3R                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM4L     : 3;            /*!< DLYM4L                                                                    */
            uint32_t            : 1;
      __IOM uint32_t DLYM4R     : 3;            /*!< DLYM4R                                                                    */
            uint32_t            : 1;
    } PDMDLY_b;
  } ;
} SAI_Type;                                     /*!< Size = 76 (0x4c)                                                          */



/* =========================================================================================================================== */
/* ================                                           TAMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Tamper and backup registers (TAMP)
  */

typedef struct {                                /*!< TAMP Structure                                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< control register 1                                                        */
    
    struct {
      __IOM uint32_t TAMP1E     : 1;            /*!< TAMP1E                                                                    */
      __IOM uint32_t TAMP2E     : 1;            /*!< TAMP2E                                                                    */
      __IOM uint32_t TAMP3E     : 1;            /*!< TAMP2E                                                                    */
            uint32_t            : 15;
      __IOM uint32_t ITAMP3E    : 1;            /*!< ITAMP3E                                                                   */
      __IOM uint32_t ITAMP4E    : 1;            /*!< ITAMP4E                                                                   */
      __IOM uint32_t ITAMP5E    : 1;            /*!< ITAMP5E                                                                   */
      __IOM uint32_t ITAMP6E    : 1;            /*!< ITAMP6E                                                                   */
            uint32_t            : 10;
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< control register 2                                                        */
    
