unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TAMP1NOER  : 1;            /*!< TAMP1NOER                                                                 */
      __IOM uint32_t TAMP2NOER  : 1;            /*!< TAMP2NOER                                                                 */
      __IOM uint32_t TAMP3NOER  : 1;            /*!< TAMP3NOER                                                                 */
            uint32_t            : 13;
      __IOM uint32_t TAMP1MSK   : 1;            /*!< TAMP1MSK                                                                  */
      __IOM uint32_t TAMP2MSK   : 1;            /*!< TAMP2MSK                                                                  */
      __IOM uint32_t TAMP3MSK   : 1;            /*!< TAMP3MSK                                                                  */
            uint32_t            : 5;
      __IOM uint32_t TAMP1TRG   : 1;            /*!< TAMP1TRG                                                                  */
      __IOM uint32_t TAMP2TRG   : 1;            /*!< TAMP2TRG                                                                  */
      __IOM uint32_t TAMP3TRG   : 1;            /*!< TAMP3TRG                                                                  */
            uint32_t            : 5;
    } CR2_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t FLTCR;                       /*!< TAMP filter control register                                              */
    
    struct {
      __IOM uint32_t TAMPFREQ   : 3;            /*!< TAMPFREQ                                                                  */
      __IOM uint32_t TAMPFLT    : 2;            /*!< TAMPFLT                                                                   */
      __IOM uint32_t TAMPPRCH   : 2;            /*!< TAMPPRCH                                                                  */
      __IOM uint32_t TAMPPUDIS  : 1;            /*!< TAMPPUDIS                                                                 */
            uint32_t            : 24;
    } FLTCR_b;
  } ;
  __IM  uint32_t  RESERVED1[7];
  
  union {
    __IOM uint32_t IER;                         /*!< TAMP interrupt enable register                                            */
    
    struct {
      __IOM uint32_t TAMP1IE    : 1;            /*!< TAMP1IE                                                                   */
      __IOM uint32_t TAMP2IE    : 1;            /*!< TAMP2IE                                                                   */
      __IOM uint32_t TAMP3IE    : 1;            /*!< TAMP3IE                                                                   */
            uint32_t            : 15;
      __IOM uint32_t ITAMP3IE   : 1;            /*!< ITAMP3IE                                                                  */
      __IOM uint32_t ITAMP4IE   : 1;            /*!< ITAMP4IE                                                                  */
      __IOM uint32_t ITAMP5IE   : 1;            /*!< ITAMP5IE                                                                  */
      __IOM uint32_t ITAMP6IE   : 1;            /*!< ITAMP6IE                                                                  */
            uint32_t            : 10;
    } IER_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< TAMP status register                                                      */
    
    struct {
      __IM  uint32_t TAMP1F     : 1;            /*!< TAMP1F                                                                    */
      __IM  uint32_t TAMP2F     : 1;            /*!< TAMP2F                                                                    */
      __IM  uint32_t TAMP3F     : 1;            /*!< TAMP3F                                                                    */
            uint32_t            : 15;
      __IM  uint32_t ITAMP3F    : 1;            /*!< ITAMP3F                                                                   */
      __IM  uint32_t ITAMP4F    : 1;            /*!< ITAMP4F                                                                   */
      __IM  uint32_t ITAMP5F    : 1;            /*!< ITAMP5F                                                                   */
      __IM  uint32_t ITAMP6F    : 1;            /*!< ITAMP6F                                                                   */
            uint32_t            : 10;
    } SR_b;
  } ;
  
  union {
    __IM  uint32_t MISR;                        /*!< TAMP masked interrupt status register                                     */
    
    struct {
      __IM  uint32_t TAMP1MF    : 1;            /*!< TAMP1MF:                                                                  */
      __IM  uint32_t TAMP2MF    : 1;            /*!< TAMP2MF                                                                   */
      __IM  uint32_t TAMP3MF    : 1;            /*!< TAMP3MF                                                                   */
            uint32_t            : 15;
      __IM  uint32_t ITAMP3MF   : 1;            /*!< ITAMP3MF                                                                  */
      __IM  uint32_t ITAMP4MF   : 1;            /*!< ITAMP4MF                                                                  */
      __IM  uint32_t ITAMP5MF   : 1;            /*!< ITAMP5MF                                                                  */
      __IM  uint32_t ITAMP6MF   : 1;            /*!< ITAMP6MF                                                                  */
            uint32_t            : 10;
    } MISR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t SCR;                         /*!< TAMP status clear register                                                */
    
    struct {
      __IOM uint32_t CTAMP1F    : 1;            /*!< CTAMP1F                                                                   */
      __IOM uint32_t CTAMP2F    : 1;            /*!< CTAMP2F                                                                   */
      __IOM uint32_t CTAMP3F    : 1;            /*!< CTAMP3F                                                                   */
            uint32_t            : 15;
      __IOM uint32_t CITAMP3F   : 1;            /*!< CITAMP3F                                                                  */
      __IOM uint32_t CITAMP4F   : 1;            /*!< CITAMP4F                                                                  */
      __IOM uint32_t CITAMP5F   : 1;            /*!< CITAMP5F                                                                  */
      __IOM uint32_t CITAMP6F   : 1;            /*!< CITAMP6F                                                                  */
            uint32_t            : 10;
    } SCR_b;
  } ;
  __IM  uint32_t  RESERVED3[48];
  
  union {
    __IOM uint32_t BKP0R;                       /*!< TAMP backup register                                                      */
    
