unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP0R_b;
  } ;
  
  union {
    __IOM uint32_t BKP1R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP1R_b;
  } ;
  
  union {
    __IOM uint32_t BKP2R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP2R_b;
  } ;
  
  union {
    __IOM uint32_t BKP3R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP3R_b;
  } ;
  
  union {
    __IOM uint32_t BKP4R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP4R_b;
  } ;
  
  union {
    __IOM uint32_t BKP5R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP5R_b;
  } ;
  
  union {
    __IOM uint32_t BKP6R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP6R_b;
  } ;
  
  union {
    __IOM uint32_t BKP7R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP7R_b;
  } ;
  
  union {
    __IOM uint32_t BKP8R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP8R_b;
  } ;
  
  union {
    __IOM uint32_t BKP9R;                       /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP9R_b;
  } ;
  
  union {
    __IOM uint32_t BKP10R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP10R_b;
  } ;
  
  union {
    __IOM uint32_t BKP11R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP11R_b;
  } ;
  
  union {
    __IOM uint32_t BKP12R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP12R_b;
  } ;
  
  union {
    __IOM uint32_t BKP13R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP13R_b;
  } ;
  
  union {
    __IOM uint32_t BKP14R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP14R_b;
  } ;
  
  union {
    __IOM uint32_t BKP15R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP15R_b;
  } ;
  
  union {
    __IOM uint32_t BKP16R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP16R_b;
  } ;
  
  union {
    __IOM uint32_t BKP17R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP17R_b;
  } ;
  
  union {
    __IOM uint32_t BKP18R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP18R_b;
  } ;
  
  union {
    __IOM uint32_t BKP19R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP19R_b;
  } ;
  
  union {
    __IOM uint32_t BKP20R;                      /*!< TAMP backup register                                                      */
    
