unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP20R_b;
  } ;
  
  union {
    __IOM uint32_t BKP21R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP21R_b;
  } ;
  
  union {
    __IOM uint32_t BKP22R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP22R_b;
  } ;
  
  union {
    __IOM uint32_t BKP23R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP23R_b;
  } ;
  
  union {
    __IOM uint32_t BKP24R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP24R_b;
  } ;
  
  union {
    __IOM uint32_t BKP25R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP25R_b;
  } ;
  
  union {
    __IOM uint32_t BKP26R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP26R_b;
  } ;
  
  union {
    __IOM uint32_t BKP27R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP27R_b;
  } ;
  
  union {
    __IOM uint32_t BKP28R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP28R_b;
  } ;
  
  union {
    __IOM uint32_t BKP29R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP29R_b;
  } ;
  
  union {
    __IOM uint32_t BKP30R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP30R_b;
  } ;
  
  union {
    __IOM uint32_t BKP31R;                      /*!< TAMP backup register                                                      */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< BKP                                                                       */
    } BKP31R_b;
  } ;
} TAMP_Type;                                    /*!< Size = 384 (0x180)                                                        */



/* =========================================================================================================================== */
/* ================                                           FDCAN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FDCAN (FDCAN)
  */

typedef struct {                                /*!< FDCAN Structure                                                           */
  
  union {
    __IOM uint32_t FDCAN_CREL;                  /*!< FDCAN core release register                                               */
    
    struct {
      __IM  uint32_t DAY        : 8;            /*!< 18                                                                        */
      __IM  uint32_t MON        : 8;            /*!< 12                                                                        */
      __IM  uint32_t YEAR       : 4;            /*!< 4                                                                         */
      __IM  uint32_t SUBSTEP    : 4;            /*!< 1                                                                         */
      __IM  uint32_t STEP       : 4;            /*!< 2                                                                         */
      __IM  uint32_t REL        : 4;            /*!< 3                                                                         */
    } FDCAN_CREL_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_ENDN;                  /*!< FDCAN endian register                                                     */
    
    struct {
      __IM  uint32_t ETV        : 32;           /*!< Endianness test valueThe endianness test value is 0x8765 4321.            */
    } FDCAN_ENDN_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t FDCAN_DBTP;                  /*!< FDCAN data bit timing and prescaler register                              */
    
    struct {
      __IOM uint32_t DSJW       : 4;            /*!< Synchronization jump widthMust always be smaller than DTSEG2,
                                                     valid values are 0 to 15. The value used by the hardware
                                                     is the one programmed, incremented by 1: t<sub>SJW</sub>
                                                     = (DSJW + 1) x tq.                                                        */
      __IOM uint32_t DTSEG2     : 4;            /*!< Data time segment after sample pointValid values are 0 to 15.
                                                     The value used by the hardware is the one programmed, incremented
                                                     by 1, i.e. t<sub>BS2</sub> = (DTSEG2 + 1) x tq.                           */
      __IOM uint32_t DTSEG1     : 5;            /*!< Data time segment before sample pointValid values are 0 to 31.
                                                     The value used by the hardware is the one programmed, incremented
                                                     by 1, i.e. t<sub>BS1</sub> = (DTSEG1 + 1) x tq.                           */
            uint32_t            : 3;
      __IOM uint32_t DBRP       : 5;            /*!< Data bit rate prescalerThe value by which the oscillator frequency
                                                     is divided to generate the bit time quanta. The bit time
                                                     is built up from a multiple of this quanta. Valid values
                                                     for the Baud Rate Prescaler are 0 to 31. The hardware interpreters
                                                     this value as the value programmed plus 1.                                */
            uint32_t            : 2;
      __IOM uint32_t TDC        : 1;            /*!< Transceiver delay compensation                                            */
            uint32_t            : 8;
    } FDCAN_DBTP_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TEST;                  /*!< FDCAN test register                                                       */
    
