unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t LBCK       : 1;            /*!< Loop back mode                                                            */
      __IOM uint32_t TX         : 2;            /*!< Control of transmit pin                                                   */
      __IM  uint32_t RX         : 1;            /*!< Receive pinMonitors the actual value of pin FDCANx_RX                     */
            uint32_t            : 24;
    } FDCAN_TEST_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_RWD;                   /*!< FDCAN RAM watchdog register                                               */
    
    struct {
      __IOM uint32_t WDC        : 8;            /*!< Watchdog configurationStart value of the message RAM watchdog
                                                     counter. With the reset value of 00, the counter is disabled.These
                                                     are protected write (P) bits, write access is possible
                                                     only when the bit 1 [CCE] and bit 0 [INIT] of FDCAN_CCCR
                                                     register are set to 1.                                                    */
      __IM  uint32_t WDV        : 8;            /*!< Watchdog valueActual message RAM watchdog counter value.                  */
            uint32_t            : 16;
    } FDCAN_RWD_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_CCCR;                  /*!< FDCAN CC control register                                                 */
    
    struct {
      __IOM uint32_t INIT       : 1;            /*!< Initialization                                                            */
      __IOM uint32_t CCE        : 1;            /*!< Configuration change enable                                               */
      __IOM uint32_t ASM        : 1;            /*!< ASM restricted operation modeThe restricted operation mode is
                                                     intended for applications that adapt themselves to different
                                                     CAN bit rates. The application tests different bit rates
                                                     and leaves the Restricted operation Mode after it has received
                                                     a valid frame. In the optional Restricted operation Mode
                                                     the node is able to transmit and receive data and remote
                                                     frames and it gives acknowledge to valid frames, but it
                                                     does not send active error frames or overload frames. In
                                                     case of an error condition or overload condition, it does
                                                     not send dominant bits, instead it waits for the occurrence
                                                     of bus idle condition to resynchronize itself to the CAN
                                                     communication. The error counters are not incremented.
                                                     Bit ASM can only be set by software when both CCE and INIT
                                                     are set to 1. The bit can be reset by the software at any
                                                     time.                                                                     */
      __IM  uint32_t CSA        : 1;            /*!< Clock stop acknowledge                                                    */
      __IOM uint32_t CSR        : 1;            /*!< Clock stop request                                                        */
      __IOM uint32_t MON        : 1;            /*!< Bus monitoring modeBit MON can only be set by software when
                                                     both CCE and INIT are set to 1. The bit can be reset by
                                                     the Host at any time.                                                     */
      __IOM uint32_t DAR        : 1;            /*!< Disable automatic retransmission                                          */
      __IOM uint32_t TEST       : 1;            /*!< Test mode enable                                                          */
      __IOM uint32_t FDOE       : 1;            /*!< FD operation enable                                                       */
      __IOM uint32_t BRSE       : 1;            /*!< FDCAN bit rate switching                                                  */
            uint32_t            : 2;
      __IOM uint32_t PXHD       : 1;            /*!< Protocol exception handling disable                                       */
      __IOM uint32_t EFBI       : 1;            /*!< Edge filtering during bus integration                                     */
      __IOM uint32_t TXP        : 1;            /*!< If this bit is set, the FDCAN pauses for two CAN bit times before
                                                     starting the next transmission after successfully transmitting
                                                     a frame.                                                                  */
      __IOM uint32_t NISO       : 1;            /*!< Non ISO operationIf this bit is set, the FDCAN uses the CAN
                                                     FD frame format as specified by the Bosch CAN FD Specification
                                                     V1.0.                                                                     */
            uint32_t            : 16;
    } FDCAN_CCCR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_NBTP;                  /*!< FDCAN nominal bit timing and prescaler register                           */
    
    struct {
      __IOM uint32_t NTSEG2     : 7;            /*!< Nominal time segment after sample pointValid values are 0 to
                                                     127. The actual interpretation by the hardware of this
                                                     value is such that one more than the programmed value is
                                                     used.                                                                     */
            uint32_t            : 1;
      __IOM uint32_t NTSEG1     : 8;            /*!< Nominal time segment before sample pointValid values are 0 to
                                                     255. The actual interpretation by the hardware of this
                                                     value is such that one more than the programmed value is
                                                     used.These are protected write (P) bits, write access is
                                                     possible only when the bit 1 [CCE] and bit 0 [INIT] of
                                                     CCCR register are set to 1.                                               */
      __IOM uint32_t NBRP       : 9;            /*!< Bit rate prescalerValue by which the oscillator frequency is
                                                     divided for generating the bit time quanta. The bit time
                                                     is built up from a multiple of this quanta. Valid values
                                                     are 0 to 511. The actual interpretation by the hardware
                                                     of this value is such that one more than the value programmed
                                                     here is used.These are protected write (P) bits, write
                                                     access is possible only when the bit 1 [CCE] and bit 0
                                                     [INIT] of CCCR register are set to 1.                                     */
      __IOM uint32_t NSJW       : 7;            /*!< Nominal (re)synchronization jump widthValid values are 0 to
                                                     127. The actual interpretation by the hardware of this
                                                     value is such that the used value is the one programmed
                                                     incremented by one.These are protected write (P) bits,
                                                     write access is possible only when the bit 1 [CCE] and
                                                     bit 0 [INIT] of CCCR register are set to 1.                               */
    } FDCAN_NBTP_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TSCC;                  /*!< FDCAN timestamp counter configuration register                            */
    
