unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TSS        : 2;            /*!< Timestamp selectThese are protected write (P) bits, write access
                                                     is possible only when the bit 1 [CCE] and bit 0 [INIT]
                                                     of CCCR register are set to 1.                                            */
            uint32_t            : 14;
      __IOM uint32_t TCP        : 4;            /*!< Timestamp counter prescaler                                               */
            uint32_t            : 12;
    } FDCAN_TSCC_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TSCV;                  /*!< FDCAN timestamp counter value register                                    */
    
    struct {
      __IOM uint32_t TSC        : 16;           /*!< Timestamp counter                                                         */
            uint32_t            : 16;
    } FDCAN_TSCV_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TOCC;                  /*!< FDCAN timeout counter configuration register                              */
    
    struct {
      __IOM uint32_t ETOC       : 1;            /*!< Timeout counter enableThis is a protected write (P) bit, write
                                                     access is possible only when the bit 1 [CCE] and bit 0
                                                     [INIT] of CCCR register are set to 1.                                     */
      __IOM uint32_t TOS        : 2;            /*!< Timeout selectWhen operating in Continuous mode, a write to
                                                     TOCV presets the counter to the value configured by TOCC[TOP]
                                                     and continues down-counting. When the timeout counter is
                                                     controlled by one of the FIFOs, an empty FIFO presets the
                                                     counter to the value configured by TOCC[TOP]. Down-counting
                                                     is started when the first FIFO element is stored.These
                                                     are protected write (P) bits, write access is possible
                                                     only when the bit 1 [CCE] and bit 0 [INIT] of CCCR register
                                                     are set to 1.                                                             */
            uint32_t            : 13;
      __IOM uint32_t TOP        : 16;           /*!< Timeout periodStart value of the timeout counter (down-counter).
                                                     Configures the timeout period.                                            */
    } FDCAN_TOCC_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TOCV;                  /*!< FDCAN timeout counter value register                                      */
    
    struct {
      __IOM uint32_t TOC        : 16;           /*!< Timeout counter                                                           */
            uint32_t            : 16;
    } FDCAN_TOCV_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t FDCAN_ECR;                   /*!< FDCAN error counter register                                              */
    
    struct {
      __IM  uint32_t TEC        : 8;            /*!< Transmit error counterActual state of the transmit error counter,
                                                     values between 0 and 255.When CCCR.ASM is set, the CAN
                                                     protocol controller does not increment TEC and REC when
                                                     a CAN protocol error is detected, but CEL is still incremented.           */
      __IM  uint32_t REC        : 7;            /*!< Receive error counterActual state of the receive error counter,
                                                     values between 0 and 127.                                                 */
      __IM  uint32_t RP         : 1;            /*!< Receive error passive                                                     */
      __IOM uint32_t CEL        : 8;            /*!< CAN error loggingThe counter is incremented each time when a
                                                     CAN protocol error causes the transmit error counter or
                                                     the receive error counter to be incremented. It is reset
                                                     by read access to CEL. The counter stops at 0xFF; the next
                                                     increment of TEC or REC sets interrupt flag IR[ELO].Access
                                                     type is RX: reset on read.                                                */
            uint32_t            : 8;
    } FDCAN_ECR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_PSR;                   /*!< FDCAN protocol status register                                            */
    
    struct {
      __IOM uint32_t LEC        : 3;            /*!< Last error codeThe LEC indicates the type of the last error
                                                     to occur on the CAN bus. This field is cleared to 0 when
                                                     a message has been transferred (reception or transmission)
                                                     without error.Access type is RS: set on read.                             */
      __IM  uint32_t ACT        : 2;            /*!< ActivityMonitors the modules CAN communication state.                     */
      __IM  uint32_t EP         : 1;            /*!< Error passive                                                             */
      __IM  uint32_t EW         : 1;            /*!< Warning Sstatus                                                           */
      __IM  uint32_t BO         : 1;            /*!< Bus_Off status                                                            */
      __IOM uint32_t DLEC       : 3;            /*!< Data last error codeType of last error that occurred in the
                                                     data phase of a FDCAN format frame with its BRS flag set.
                                                     Coding is the same as for LEC. This field is cleared to
                                                     0 when a FDCAN format frame with its BRS flag set has been
                                                     transferred (reception or transmission) without error.Access
                                                     type is RS: set on read.                                                  */
      __IOM uint32_t RESI       : 1;            /*!< ESI flag of last received FDCAN messageThis bit is set together
                                                     with REDL, independent of acceptance filtering.Access type
                                                     is RX: reset on read.                                                     */
      __IOM uint32_t RBRS       : 1;            /*!< BRS flag of last received FDCAN messageThis bit is set together
                                                     with REDL, independent of acceptance filtering.Access type
                                                     is RX: reset on read.                                                     */
      __IOM uint32_t REDL       : 1;            /*!< Received FDCAN messageThis bit is set independent of acceptance
                                                     filtering.Access type is RX: reset on read.                               */
      __IOM uint32_t PXE        : 1;            /*!< Protocol exception event                                                  */
            uint32_t            : 1;
      __IM  uint32_t TDCV       : 7;            /*!< Transmitter delay compensation valuePosition of the secondary
                                                     sample point, defined by the sum of the measured delay
                                                     from FDCAN_TX to FDCAN_RX and TDCR.TDCO. The SSP position
                                                     is, in the data phase, the number of minimum time quanta
                                                     (mtq) between the start of the transmitted bit and the
                                                     secondary sample point. Valid values are 0 to 127 mtq.                    */
            uint32_t            : 9;
    } FDCAN_PSR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TDCR;                  /*!< FDCAN transmitter delay compensation register                             */
    
