unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TDCF       : 7;            /*!< Transmitter delay compensation filter window lengthDefines the
                                                     minimum value for the SSP position, dominant edges on FDCAN_RX
                                                     that would result in an earlier SSP position are ignored
                                                     for transmitter delay measurements.These are protected
                                                     write (P) bits, which means that write access by the bits
                                                     is possible only when the bit 1 [CCE] and bit 0 [INIT]
                                                     of CCCR register are set to 1.                                            */
            uint32_t            : 1;
      __IOM uint32_t TDCO       : 7;            /*!< Transmitter delay compensation offsetOffset value defining the
                                                     distance between the measured delay from FDCAN_TX to FDCAN_RX
                                                     and the secondary sample point. Valid values are 0 to 127
                                                     mtq.These are protected write (P) bits, which means that
                                                     write access by the bits is possible only when the bit
                                                     1 [CCE] and bit 0 [INIT] of CCCR register are set to 1.                   */
            uint32_t            : 17;
    } FDCAN_TDCR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t FDCAN_IR;                    /*!< FDCAN interrupt register                                                  */
    
    struct {
      __IOM uint32_t RF0N       : 1;            /*!< Rx FIFO 0 new message                                                     */
      __IOM uint32_t RF0F       : 1;            /*!< Rx FIFO 0 full                                                            */
      __IOM uint32_t RF0L       : 1;            /*!< Rx FIFO 0 message lost                                                    */
      __IOM uint32_t RF1N       : 1;            /*!< Rx FIFO 1 new message                                                     */
      __IOM uint32_t RF1F       : 1;            /*!< Rx FIFO 1 full                                                            */
      __IOM uint32_t RF1L       : 1;            /*!< Rx FIFO 1 message lost                                                    */
      __IOM uint32_t HPM        : 1;            /*!< High-priority message                                                     */
      __IOM uint32_t TC         : 1;            /*!< Transmission completed                                                    */
      __IOM uint32_t TCF        : 1;            /*!< Transmission cancellation finished                                        */
      __IOM uint32_t TFE        : 1;            /*!< Tx FIFO empty                                                             */
      __IOM uint32_t TEFN       : 1;            /*!< Tx event FIFO New Entry                                                   */
      __IOM uint32_t TEFF       : 1;            /*!< Tx event FIFO full                                                        */
      __IOM uint32_t TEFL       : 1;            /*!< Tx event FIFO element lost                                                */
      __IOM uint32_t TSW        : 1;            /*!< Timestamp wraparound                                                      */
      __IOM uint32_t MRAF       : 1;            /*!< Message RAM access failureThe flag is set when the Rx handler:has
                                                     not completed acceptance filtering or storage of an accepted
                                                     message until the arbitration field of the following message
                                                     has been received. In this case acceptance filtering or
                                                     message storage is aborted and the Rx handler starts processing
                                                     of the following message. was unable to write a message
                                                     to the message RAM. In this case message storage is aborted.In
                                                     both cases the FIFO put index is not updated. The partly
                                                     stored message is overwritten when the next message is
                                                     stored to this location.The flag is also set when the Tx
                                                     Handler was not able to read a message from the Message
                                                     RAM in time. In this case message transmission is aborted.
                                                     In case of a Tx Handler access failure the FDCAN is switched
                                                     into Restricted operation Mode (see Restricted operation
                                                     mode). To leave Restricted operation Mode, the Host CPU
                                                     has to reset CCCR.ASM.                                                    */
      __IOM uint32_t TOO        : 1;            /*!< Timeout occurred                                                          */
      __IOM uint32_t ELO        : 1;            /*!< Error logging overflow                                                    */
      __IOM uint32_t EP         : 1;            /*!< Error passive                                                             */
      __IOM uint32_t EW         : 1;            /*!< Warning status                                                            */
      __IOM uint32_t BO         : 1;            /*!< Bus_Off status                                                            */
      __IOM uint32_t WDI        : 1;            /*!< Watchdog interrupt                                                        */
      __IOM uint32_t PEA        : 1;            /*!< Protocol error in arbitration phase (nominal bit time is used)            */
      __IOM uint32_t PED        : 1;            /*!< Protocol error in data phase (data bit time is used)                      */
      __IOM uint32_t ARA        : 1;            /*!< Access to reserved address                                                */
            uint32_t            : 8;
    } FDCAN_IR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_IE;                    /*!< FDCAN interrupt enable register                                           */
    
