unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t RF0NE      : 1;            /*!< Rx FIFO 0 new message interrupt enable                                    */
      __IOM uint32_t RF0FE      : 1;            /*!< Rx FIFO 0 full interrupt enable                                           */
      __IOM uint32_t RF0LE      : 1;            /*!< Rx FIFO 0 message lost interrupt enable                                   */
      __IOM uint32_t RF1NE      : 1;            /*!< Rx FIFO 1 new message interrupt enable                                    */
      __IOM uint32_t RF1FE      : 1;            /*!< Rx FIFO 1 full interrupt enable                                           */
      __IOM uint32_t RF1LE      : 1;            /*!< Rx FIFO 1 message lost interrupt enable                                   */
      __IOM uint32_t HPME       : 1;            /*!< High-priority message interrupt enable                                    */
      __IOM uint32_t TCE        : 1;            /*!< Transmission completed interrupt enable                                   */
      __IOM uint32_t TCFE       : 1;            /*!< Transmission cancellation finished interrupt enable                       */
      __IOM uint32_t TFEE       : 1;            /*!< Tx FIFO empty interrupt enable                                            */
      __IOM uint32_t TEFNE      : 1;            /*!< Tx event FIFO new entry interrupt enable                                  */
      __IOM uint32_t TEFFE      : 1;            /*!< Tx event FIFO full interrupt enable                                       */
      __IOM uint32_t TEFLE      : 1;            /*!< Tx event FIFO element lost interrupt enable                               */
      __IOM uint32_t TSWE       : 1;            /*!< Timestamp wraparound interrupt enable                                     */
      __IOM uint32_t MRAFE      : 1;            /*!< Message RAM access failure interrupt enable                               */
      __IOM uint32_t TOOE       : 1;            /*!< Timeout occurred interrupt enable                                         */
      __IOM uint32_t ELOE       : 1;            /*!< Error logging overflow interrupt enable                                   */
      __IOM uint32_t EPE        : 1;            /*!< Error passive interrupt enable                                            */
      __IOM uint32_t EWE        : 1;            /*!< Warning status interrupt enable                                           */
      __IOM uint32_t BOE        : 1;            /*!< Bus_Off status                                                            */
      __IOM uint32_t WDIE       : 1;            /*!< Watchdog interrupt enable                                                 */
      __IOM uint32_t PEAE       : 1;            /*!< Protocol error in arbitration phase enable                                */
      __IOM uint32_t PEDE       : 1;            /*!< Protocol error in data phase enable                                       */
      __IOM uint32_t ARAE       : 1;            /*!< Access to reserved address enable                                         */
            uint32_t            : 8;
    } FDCAN_IE_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_ILS;                   /*!< FDCAN interrupt line select register                                      */
    
    struct {
      __IOM uint32_t RXFIFO0    : 1;            /*!< RX FIFO bit grouping the following interruptionRF0LL: Rx FIFO
                                                     0 message lost interrupt lineRF0FL: Rx FIFO 0 full interrupt
                                                     lineRF0NL: Rx FIFO 0 new message interrupt line                           */
      __IOM uint32_t RXFIFO1    : 1;            /*!< RX FIFO bit grouping the following interruptionRF1LL: Rx FIFO
                                                     1 message lost interrupt lineRF1FL: Rx FIFO 1 full interrupt
                                                     lineRF1NL: Rx FIFO 1 new message interrupt line                           */
      __IOM uint32_t SMSG       : 1;            /*!< Status message bit grouping the following interruptionTCFL:
                                                     Transmission cancellation finished interrupt lineTCL: Transmission
                                                     completed interrupt lineHPML: High-priority message interrupt
                                                     line                                                                      */
      __IOM uint32_t TFERR      : 1;            /*!< Tx FIFO ERROR grouping the following interruptionTEFLL: Tx event
                                                     FIFO element lost interrupt lineTEFFL: Tx event FIFO full
                                                     interrupt lineTEFNL: Tx event FIFO new entry interrupt
                                                     lineTFEL: Tx FIFO empty interrupt line                                    */
      __IOM uint32_t MISC       : 1;            /*!< Interrupt regrouping the following interruptionTOOL: Timeout
                                                     occurred interrupt lineMRAFL: Message RAM access failure
                                                     interrupt lineTSWL: Timestamp wraparound interrupt line                   */
      __IOM uint32_t BERR       : 1;            /*!< Bit and line error grouping the following interruption EPL Error
                                                     passive interrupt lineELOL: Error logging overflow interrupt
                                                     line                                                                      */
      __IOM uint32_t PERR       : 1;            /*!< Protocol error grouping the following interruption ARAL: Access
                                                     to reserved address linePEDL: Protocol error in data phase
                                                     linePEAL: Protocol error in arbitration phase lineWDIL:
                                                     Watchdog interrupt lineBOL: Bus_Off statusEWL: Warning
                                                     status interrupt line                                                     */
            uint32_t            : 25;
    } FDCAN_ILS_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_ILE;                   /*!< FDCAN interrupt line enable register                                      */
    
