unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EINT0      : 1;            /*!< Enable interrupt line 0                                                   */
      __IOM uint32_t EINT1      : 1;            /*!< Enable interrupt line 1                                                   */
            uint32_t            : 30;
    } FDCAN_ILE_b;
  } ;
  __IM  uint32_t  RESERVED3[8];
  
  union {
    __IOM uint32_t FDCAN_RXGFC;                 /*!< FDCAN global filter configuration register                                */
    
    struct {
      __IOM uint32_t RRFE       : 1;            /*!< Reject remote frames extendedThese are protected write (P) bits,
                                                     which means that write access by the bits is possible only
                                                     when the bit 1 [CCE] and bit 0 [INIT] of CCCR register
                                                     are set to 1.                                                             */
      __IOM uint32_t RRFS       : 1;            /*!< Reject remote frames standardThese are protected write (P) bits,
                                                     which means that write access by the bits is possible only
                                                     when the bit 1 [CCE] and bit 0 [INIT] of CCCR register
                                                     are set to 1.                                                             */
      __IOM uint32_t ANFE       : 2;            /*!< Accept non-matching frames extendedDefines how received messages
                                                     with 29-bit IDs that do not match any element of the filter
                                                     list are treated.These are protected write (P) bits, which
                                                     means that write access by the bits is possible only when
                                                     the bit 1 [CCE] and bit 0 [INIT] of CCCR register are set
                                                     to 1.                                                                     */
      __IOM uint32_t ANFS       : 2;            /*!< Accept Non-matching frames standardDefines how received messages
                                                     with 11-bit IDs that do not match any element of the filter
                                                     list are treated.These are protected write (P) bits, which
                                                     means that write access by the bits is possible only when
                                                     the bit 1 [CCE] and bit 0 [INIT] of CCCR register are set
                                                     to 1.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t F1OM       : 1;            /*!< FIFO 1 operation mode (overwrite or blocking)This is a protected
                                                     write (P) bits, which means that write access by the bits
                                                     is possible only when the bit 1 [CCE] and bit 0 [INIT]
                                                     of CCCR register are set to 1.                                            */
      __IOM uint32_t F0OM       : 1;            /*!< FIFO 0 operation mode (overwrite or blocking)This is protected
                                                     write (P) bits, which means that write access by the bits
                                                     is possible only when the bit 1 [CCE] and bit 0 [INIT]
                                                     of CCCR register are set to 1.                                            */
            uint32_t            : 6;
      __IOM uint32_t LSS        : 5;            /*!< List size standard1 to 28: Number of standard message ID filter
                                                     elements>28: Values greater than 28 are interpreted as
                                                     28.These are protected write (P) bits, which means that
                                                     write access by the bits is possible only when the bit
                                                     1 [CCE] and bit 0 [INIT] of CCCR register are set to 1.                   */
            uint32_t            : 3;
      __IOM uint32_t LSE        : 4;            /*!< List size extended1 to 8: Number of extended message ID filter
                                                     elements>8: Values greater than 8 are interpreted as 8.These
                                                     are protected write (P) bits, which means that write access
                                                     by the bits is possible only when the bit 1 [CCE] and bit
                                                     0 [INIT] of CCCR register are set to 1.                                   */
            uint32_t            : 4;
    } FDCAN_RXGFC_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_XIDAM;                 /*!< FDCAN extended ID and mask register                                       */
    
    struct {
      __IOM uint32_t EIDM       : 29;           /*!< Extended ID maskFor acceptance filtering of extended frames
                                                     the Extended ID AND Mask is AND-ed with the Message ID
                                                     of a received frame. Intended for masking of 29-bit IDs
                                                     in SAE J1939. With the reset value of all bits set to 1
                                                     the mask is not active.These are protected write (P) bits,
                                                     which means that write access by the bits is possible only
                                                     when the bit 1 [CCE] and bit 0 [INIT] of CCCR register
                                                     are set to 1.                                                             */
            uint32_t            : 3;
    } FDCAN_XIDAM_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_HPMS;                  /*!< FDCAN high-priority message status register                               */
    
