unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t BIDX       : 3;            /*!< Buffer indexIndex of Rx FIFO element to which the message was
                                                     stored. Only valid when MSI[1] = 1.                                       */
            uint32_t            : 3;
      __IM  uint32_t MSI        : 2;            /*!< Message storage indicator                                                 */
      __IM  uint32_t FIDX       : 5;            /*!< Filter indexIndex of matching filter element. Range is 0 to
                                                     RXGFC[LSS] - 1 or RXGFC[LSE] - 1.                                         */
            uint32_t            : 2;
      __IM  uint32_t FLST       : 1;            /*!< Filter listIndicates the filter list of the matching filter
                                                     element.                                                                  */
            uint32_t            : 16;
    } FDCAN_HPMS_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t FDCAN_RXF0S;                 /*!< FDCAN Rx FIFO 0 status register                                           */
    
    struct {
      __IM  uint32_t F0FL       : 4;            /*!< Rx FIFO 0 fill levelNumber of elements stored in Rx FIFO 0,
                                                     range 0 to 3.                                                             */
            uint32_t            : 4;
      __IM  uint32_t F0GI       : 2;            /*!< Rx FIFO 0 get indexRx FIFO 0 read index pointer, range 0 to
                                                     2.                                                                        */
            uint32_t            : 6;
      __IM  uint32_t F0PI       : 2;            /*!< Rx FIFO 0 put indexRx FIFO 0 write index pointer, range 0 to
                                                     2.                                                                        */
            uint32_t            : 6;
      __IM  uint32_t F0F        : 1;            /*!< Rx FIFO 0 full                                                            */
      __IM  uint32_t RF0L       : 1;            /*!< Rx FIFO 0 message lostThis bit is a copy of interrupt flag IR[RF0L].
                                                     When IR[RF0L] is reset, this bit is also reset.                           */
            uint32_t            : 6;
    } FDCAN_RXF0S_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_RXF0A;                 /*!< CAN Rx FIFO 0 acknowledge register                                        */
    
    struct {
      __IOM uint32_t F0AI       : 3;            /*!< Rx FIFO 0 acknowledge indexAfter the Host has read a message
                                                     or a sequence of messages from Rx FIFO 0 it has to write
                                                     the buffer index of the last element read from Rx FIFO
                                                     0 to F0AI. This sets the Rx FIFO 0 get index RXF0S[F0GI]
                                                     to F0AI + 1 and update the FIFO 0 fill level RXF0S[F0FL].                 */
            uint32_t            : 29;
    } FDCAN_RXF0A_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_RXF1S;                 /*!< FDCAN Rx FIFO 1 status register                                           */
    
    struct {
      __IM  uint32_t F1FL       : 4;            /*!< Rx FIFO 1 fill levelNumber of elements stored in Rx FIFO 1,
                                                     range 0 to 3.                                                             */
            uint32_t            : 4;
      __IM  uint32_t F1GI       : 2;            /*!< Rx FIFO 1 get indexRx FIFO 1 read index pointer, range 0 to
                                                     2.                                                                        */
            uint32_t            : 6;
      __IM  uint32_t F1PI       : 2;            /*!< Rx FIFO 1 put indexRx FIFO 1 write index pointer, range 0 to
                                                     2.                                                                        */
            uint32_t            : 6;
      __IM  uint32_t F1F        : 1;            /*!< Rx FIFO 1 full                                                            */
      __IM  uint32_t RF1L       : 1;            /*!< Rx FIFO 1 message lostThis bit is a copy of interrupt flag IR[RF1L].
                                                     When IR[RF1L] is reset, this bit is also reset.                           */
            uint32_t            : 6;
    } FDCAN_RXF1S_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_RXF1A;                 /*!< FDCAN Rx FIFO 1 acknowledge register                                      */
    
    struct {
      __IOM uint32_t F1AI       : 3;            /*!< Rx FIFO 1 acknowledge indexAfter the Host has read a message
                                                     or a sequence of messages from Rx FIFO 1 it has to write
                                                     the buffer index of the last element read from Rx FIFO
                                                     1 to F1AI. This sets the Rx FIFO 1 get index RXF1S[F1GI]
                                                     to F1AI + 1 and update the FIFO 1 Fill Level RXF1S[F1FL].                 */
            uint32_t            : 29;
    } FDCAN_RXF1A_b;
  } ;
  __IM  uint32_t  RESERVED5[8];
  
  union {
    __IOM uint32_t FDCAN_TXBC;                  /*!< FDCAN Tx buffer configuration register                                    */
    
    struct {
            uint32_t            : 24;
      __IOM uint32_t TFQM       : 1;            /*!< Tx FIFO/queue modeThis is a protected write (P) bit, which means
                                                     that write access by the bits is possible only when the
                                                     bit 1 [CCE] and bit 0 [INIT] of CCCR register are set to
                                                     1.                                                                        */
            uint32_t            : 7;
    } FDCAN_TXBC_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXFQS;                 /*!< FDCAN Tx FIFO/queue status register                                       */
    
