unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t TFFL       : 3;            /*!< Tx FIFO free levelNumber of consecutive free Tx FIFO elements
                                                     starting from TFGI, range 0 to 3. Read as 0 when Tx queue
                                                     operation is configured (TXBC[TFQM] = 1).                                 */
            uint32_t            : 5;
      __IM  uint32_t TFGI       : 2;            /*!< Tx FIFO get indexTx FIFO read index pointer, range 0 to 3. Read
                                                     as 0 when Tx queue operation is configured (TXBC.TFQM =
                                                     1)                                                                        */
            uint32_t            : 6;
      __IM  uint32_t TFQPI      : 2;            /*!< Tx FIFO/queue put indexTx FIFO/queue write index pointer, range
                                                     0 to 3                                                                    */
            uint32_t            : 3;
      __IM  uint32_t TFQF       : 1;            /*!< Tx FIFO/queue full                                                        */
            uint32_t            : 10;
    } FDCAN_TXFQS_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBRP;                 /*!< FDCAN Tx buffer request pending register                                  */
    
    struct {
      __IM  uint32_t TRP        : 3;            /*!< Transmission request pendingEach Tx buffer has its own transmission
                                                     request pending bit. The bits are set via register TXBAR.
                                                     The bits are reset after a requested transmission has completed
                                                     or has been canceled via register TXBCR.After a TXBRP bit
                                                     has been set, a Tx scan is started to check for the pending
                                                     Tx request with the highest priority (Tx buffer with lowest
                                                     Message ID).A cancellation request resets the corresponding
                                                     transmission request pending bit of register TXBRP. In
                                                     case a transmission has already been started when a cancellation
                                                     is requested, this is done at the end of the transmission,
                                                     regardless whether the transmission was successful or not.
                                                     The cancellation request bits are reset directly after
                                                     the corresponding TXBRP bit has been reset.After a cancellation
                                                     has been requested, a finished cancellation is signaled
                                                     via TXBCFafter successful transmission together with the
                                                     corresponding TXBTO bitwhen the transmission has not yet
                                                     been started at the point of cancellationwhen the transmission
                                                     has been aborted due to lost arbitrationwhen an error occurred
                                                     during frame transmissionIn DAR mode all transmissions
                                                     are automatically canceled if they are not successful.
                                                     The corresponding TXBCF bit is set for all unsuccessful
                                                     transmissions.                                                            */
            uint32_t            : 29;
    } FDCAN_TXBRP_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBAR;                 /*!< FDCAN Tx buffer add request register                                      */
    
    struct {
      __IOM uint32_t AR         : 3;            /*!< Add requestEach Tx buffer has its own add request bit. Writing
                                                     a 1 sets the corresponding add request bit; writing a 0
                                                     has no impact. This enables the Host to set transmission
                                                     requests for multiple Tx buffers with one write to TXBAR.
                                                     When no Tx scan is running, the bits are reset immediately,
                                                     else the bits remain set until the Tx scan process has
                                                     completed.                                                                */
            uint32_t            : 29;
    } FDCAN_TXBAR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBCR;                 /*!< FDCAN Tx buffer cancellation request register                             */
    
    struct {
      __IOM uint32_t CR         : 3;            /*!< Cancellation requestEach Tx buffer has its own cancellation
                                                     request bit. Writing a 1 sets the corresponding CR bit;
                                                     writing a 0 has no impact.This enables the Host to set
                                                     cancellation requests for multiple Tx buffers with one
                                                     write to TXBCR. The bits remain set until the corresponding
                                                     TXBRP bit is reset.                                                       */
            uint32_t            : 29;
    } FDCAN_TXBCR_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBTO;                 /*!< FDCAN Tx buffer transmission occurred register                            */
    
