unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t TO         : 3;            /*!< Transmission occurred.Each Tx buffer has its own TO bit. The
                                                     bits are set when the corresponding TXBRP bit is cleared
                                                     after a successful transmission. The bits are reset when
                                                     a new transmission is requested by writing a 1 to the corresponding
                                                     bit of register TXBAR.                                                    */
            uint32_t            : 29;
    } FDCAN_TXBTO_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBCF;                 /*!< FDCAN Tx buffer cancellation finished register                            */
    
    struct {
      __IM  uint32_t CF         : 3;            /*!< Cancellation finishedEach Tx buffer has its own CF bit. The
                                                     bits are set when the corresponding TXBRP bit is cleared
                                                     after a cancellation was requested via TXBCR. In case the
                                                     corresponding TXBRP bit was not set at the point of cancellation,
                                                     CF is set immediately. The bits are reset when a new transmission
                                                     is requested by writing a 1 to the corresponding bit of
                                                     register TXBAR.                                                           */
            uint32_t            : 29;
    } FDCAN_TXBCF_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBTIE;                /*!< FDCAN Tx buffer transmission interrupt enable register                    */
    
    struct {
      __IOM uint32_t TIE        : 3;            /*!< Transmission interrupt enableEach Tx buffer has its own TIE
                                                     bit.                                                                      */
            uint32_t            : 29;
    } FDCAN_TXBTIE_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXBCIE;                /*!< FDCAN Tx buffer cancellation finished interrupt enable register           */
    
    struct {
      __IOM uint32_t CFIE       : 3;            /*!< Cancellation finished interrupt enable.Each Tx buffer has its
                                                     own CFIE bit.                                                             */
            uint32_t            : 29;
    } FDCAN_TXBCIE_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXEFS;                 /*!< FDCAN Tx event FIFO status register                                       */
    
    struct {
      __IM  uint32_t EFFL       : 3;            /*!< Event FIFO fill levelNumber of elements stored in Tx event FIFO,
                                                     range 0 to 3.                                                             */
            uint32_t            : 5;
      __IM  uint32_t EFGI       : 2;            /*!< Event FIFO get indexTx event FIFO read index pointer, range
                                                     0 to 3.                                                                   */
            uint32_t            : 6;
      __IM  uint32_t EFPI       : 2;            /*!< Event FIFO put indexTx event FIFO write index pointer, range
                                                     0 to 3.                                                                   */
            uint32_t            : 6;
      __IM  uint32_t EFF        : 1;            /*!< Event FIFO full                                                           */
      __IM  uint32_t TEFL       : 1;            /*!< Tx event FIFO element lostThis bit is a copy of interrupt flag
                                                     IR[TEFL]. When IR[TEFL] is reset, this bit is also reset.0
                                                     No Tx event FIFO element lost1 Tx event FIFO element lost,
                                                     also set after write attempt to Tx event FIFO of size 0.                  */
            uint32_t            : 6;
    } FDCAN_TXEFS_b;
  } ;
  
  union {
    __IOM uint32_t FDCAN_TXEFA;                 /*!< FDCAN Tx event FIFO acknowledge register                                  */
    
    struct {
      __IOM uint32_t EFAI       : 2;            /*!< Event FIFO acknowledge indexAfter the Host has read an element
                                                     or a sequence of elements from the Tx event FIFO, it has
                                                     to write the index of the last element read from Tx event
                                                     FIFO to EFAI. This sets the Tx event FIFO get index TXEFS[EFGI]
                                                     to EFAI + 1 and updates the FIFO 0 fill level TXEFS[EFFL].                */
            uint32_t            : 30;
    } FDCAN_TXEFA_b;
  } ;
  __IM  uint32_t  RESERVED6[5];
  
  union {
    __IOM uint32_t FDCAN_CKDIV;                 /*!< FDCAN CFG clock divider register                                          */
    
    struct {
      __IOM uint32_t PDIV       : 4;            /*!< input clock dividerThe APB clock could be divided prior to be
                                                     used by the CAN sub system. The rate must be computed using
                                                     the divider output clock.These are protected write (P)
                                                     bits, which means that write access by the bits is possible
                                                     only when the bit 1 [CCE] and bit 0 [INIT] of CCCR register
                                                     are set to 1.                                                             */
            uint32_t            : 28;
    } FDCAN_CKDIV_b;
  } ;
} FDCAN_Type;                                   /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                           UCPD1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UCPD1 (UCPD1)
  */

