unhuman-io/obot-controller/obot2/src/STM32G474.h
typedef struct {                                /*!< UCPD1 Structure                                                           */
  
  union {
    __IOM uint32_t CFG1;                        /*!< UCPD configuration register 1                                             */
    
    struct {
      __IOM uint32_t HBITCLKDIV : 6;            /*!< HBITCLKDIV                                                                */
      __IOM uint32_t IFRGAP     : 5;            /*!< IFRGAP                                                                    */
      __IOM uint32_t TRANSWIN   : 5;            /*!< TRANSWIN                                                                  */
            uint32_t            : 1;
      __IOM uint32_t PSC_USBPDCLK : 3;          /*!< PSC_USBPDCLK                                                              */
      __IOM uint32_t RXORDSETEN : 9;            /*!< RXORDSETEN                                                                */
      __IOM uint32_t TXDMAEN    : 1;            /*!< TXDMAEN                                                                   */
      __IOM uint32_t RXDMAEN    : 1;            /*!< RXDMAEN                                                                   */
      __IOM uint32_t UCPDEN     : 1;            /*!< UCPDEN                                                                    */
    } CFG1_b;
  } ;
  
  union {
    __IOM uint32_t CFG2;                        /*!< UCPD configuration register 2                                             */
    
    struct {
      __IOM uint32_t RXFILTDIS  : 1;            /*!< RXFILTDIS                                                                 */
      __IOM uint32_t RXFILT2N3  : 1;            /*!< RXFILT2N3                                                                 */
      __IOM uint32_t FORCECLK   : 1;            /*!< FORCECLK                                                                  */
      __IOM uint32_t WUPEN      : 1;            /*!< WUPEN                                                                     */
            uint32_t            : 28;
    } CFG2_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CR;                          /*!< UCPD configuration register 2                                             */
    
    struct {
      __IOM uint32_t TXMODE     : 2;            /*!< TXMODE                                                                    */
      __IOM uint32_t TXSEND     : 1;            /*!< TXSEND                                                                    */
      __IOM uint32_t TXHRST     : 1;            /*!< TXHRST                                                                    */
      __IOM uint32_t RXMODE     : 1;            /*!< RXMODE                                                                    */
      __IOM uint32_t PHYRXEN    : 1;            /*!< PHYRXEN                                                                   */
      __IOM uint32_t PHYCCSEL   : 1;            /*!< PHYCCSEL                                                                  */
      __IOM uint32_t ANASUBMODE : 2;            /*!< ANASUBMODE                                                                */
      __IOM uint32_t ANAMODE    : 1;            /*!< ANAMODE                                                                   */
      __IOM uint32_t CCENABLE   : 2;            /*!< CCENABLE                                                                  */
            uint32_t            : 4;
      __IOM uint32_t FRSRXEN    : 1;            /*!< FRSRXEN                                                                   */
      __IOM uint32_t FRSTX      : 1;            /*!< FRSTX                                                                     */
      __IOM uint32_t RDCH       : 1;            /*!< RDCH                                                                      */
            uint32_t            : 1;
      __IOM uint32_t CC1TCDIS   : 1;            /*!< CC1TCDIS                                                                  */
      __IOM uint32_t CC2TCDIS   : 1;            /*!< CC2TCDIS                                                                  */
            uint32_t            : 10;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t IMR;                         /*!< UCPD Interrupt Mask Register                                              */
    
    struct {
      __IOM uint32_t TXISIE     : 1;            /*!< TXISIE                                                                    */
      __IOM uint32_t TXMSGDISCIE : 1;           /*!< TXMSGDISCIE                                                               */
      __IOM uint32_t TXMSGSENTIE : 1;           /*!< TXMSGSENTIE                                                               */
      __IOM uint32_t TXMSGABTIE : 1;            /*!< TXMSGABTIE                                                                */
      __IOM uint32_t HRSTDISCIE : 1;            /*!< HRSTDISCIE                                                                */
      __IOM uint32_t HRSTSENTIE : 1;            /*!< HRSTSENTIE                                                                */
      __IOM uint32_t TXUNDIE    : 1;            /*!< TXUNDIE                                                                   */
            uint32_t            : 1;
      __IOM uint32_t RXNEIE     : 1;            /*!< RXNEIE                                                                    */
      __IOM uint32_t RXORDDETIE : 1;            /*!< RXORDDETIE                                                                */
      __IOM uint32_t RXHRSTDETIE : 1;           /*!< RXHRSTDETIE                                                               */
      __IOM uint32_t RXOVRIE    : 1;            /*!< RXOVRIE                                                                   */
      __IOM uint32_t RXMSGENDIE : 1;            /*!< RXMSGENDIE                                                                */
            uint32_t            : 1;
      __IOM uint32_t TYPECEVT1IE : 1;           /*!< TYPECEVT1IE                                                               */
      __IOM uint32_t TYPECEVT2IE : 1;           /*!< TYPECEVT2IE                                                               */
            uint32_t            : 4;
      __IOM uint32_t FRSEVTIE   : 1;            /*!< FRSEVTIE                                                                  */
            uint32_t            : 11;
    } IMR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< UCPD Status Register                                                      */
    
