unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t TXIS       : 1;            /*!< TXIS                                                                      */
      __IOM uint32_t TXMSGDISC  : 1;            /*!< TXMSGDISC                                                                 */
      __IOM uint32_t TXMSGSENT  : 1;            /*!< TXMSGSENT                                                                 */
      __IOM uint32_t TXMSGABT   : 1;            /*!< TXMSGABT                                                                  */
      __IOM uint32_t HRSTDISC   : 1;            /*!< HRSTDISC                                                                  */
      __IOM uint32_t HRSTSENT   : 1;            /*!< HRSTSENT                                                                  */
      __IOM uint32_t TXUND      : 1;            /*!< TXUND                                                                     */
            uint32_t            : 1;
      __IOM uint32_t RXNE       : 1;            /*!< RXNE                                                                      */
      __IOM uint32_t RXORDDET   : 1;            /*!< RXORDDET                                                                  */
      __IOM uint32_t RXHRSTDET  : 1;            /*!< RXHRSTDET                                                                 */
      __IOM uint32_t RXOVR      : 1;            /*!< RXOVR                                                                     */
      __IOM uint32_t RXMSGEND   : 1;            /*!< RXMSGEND                                                                  */
      __IOM uint32_t RXERR      : 1;            /*!< RXERR                                                                     */
      __IOM uint32_t TYPECEVT1  : 1;            /*!< TYPECEVT1                                                                 */
      __IOM uint32_t TYPECEVT2  : 1;            /*!< TYPECEVT2                                                                 */
      __IOM uint32_t TYPEC_VSTATE_CC1 : 2;      /*!< TYPEC_VSTATE_CC1                                                          */
      __IOM uint32_t TYPEC_VSTATE_CC2 : 2;      /*!< TYPEC_VSTATE_CC2                                                          */
      __IOM uint32_t FRSEVT     : 1;            /*!< FRSEVT                                                                    */
            uint32_t            : 11;
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< UCPD Interrupt Clear Register                                             */
    
    struct {
            uint32_t            : 1;
      __IOM uint32_t TXMSGDISCCF : 1;           /*!< TXMSGDISCCF                                                               */
      __IOM uint32_t TXMSGSENTCF : 1;           /*!< TXMSGSENTCF                                                               */
      __IOM uint32_t TXMSGABTCF : 1;            /*!< TXMSGABTCF                                                                */
      __IOM uint32_t HRSTDISCCF : 1;            /*!< HRSTDISCCF                                                                */
      __IOM uint32_t HRSTSENTCF : 1;            /*!< HRSTSENTCF                                                                */
      __IOM uint32_t TXUNDCF    : 1;            /*!< TXUNDCF                                                                   */
            uint32_t            : 2;
      __IOM uint32_t RXORDDETCF : 1;            /*!< RXORDDETCF                                                                */
      __IOM uint32_t RXHRSTDETCF : 1;           /*!< RXHRSTDETCF                                                               */
      __IOM uint32_t RXOVRCF    : 1;            /*!< RXOVRCF                                                                   */
      __IOM uint32_t RXMSGENDCF : 1;            /*!< RXMSGENDCF                                                                */
            uint32_t            : 1;
      __IOM uint32_t TYPECEVT1CF : 1;           /*!< TYPECEVT1CF                                                               */
      __IOM uint32_t TYPECEVT2CF : 1;           /*!< TYPECEVT2CF                                                               */
            uint32_t            : 4;
      __IOM uint32_t FRSEVTCF   : 1;            /*!< FRSEVTCF                                                                  */
            uint32_t            : 11;
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t TX_ORDSET;                   /*!< UCPD Tx Ordered Set Type Register                                         */
    
    struct {
      __IOM uint32_t TXORDSET   : 20;           /*!< TXORDSET                                                                  */
            uint32_t            : 12;
    } TX_ORDSET_b;
  } ;
  
  union {
    __IOM uint32_t TX_PAYSZ;                    /*!< UCPD Tx Paysize Register                                                  */
    
    struct {
      __IOM uint32_t TXPAYSZ    : 10;           /*!< TXPAYSZ                                                                   */
            uint32_t            : 22;
    } TX_PAYSZ_b;
  } ;
  
  union {
    __IOM uint32_t TXDR;                        /*!< UCPD Tx Data Register                                                     */
    
    struct {
      __IOM uint32_t TXDATA     : 8;            /*!< TXDATA                                                                    */
            uint32_t            : 24;
    } TXDR_b;
  } ;
  
  union {
    __IM  uint32_t RX_ORDSET;                   /*!< UCPD Rx Ordered Set Register                                              */
    
    struct {
      __IM  uint32_t RXORDSET   : 3;            /*!< RXORDSET                                                                  */
      __IM  uint32_t RXSOP3OF4  : 1;            /*!< RXSOP3OF4                                                                 */
      __IM  uint32_t RXSOPKINVALID : 3;         /*!< RXSOPKINVALID                                                             */
            uint32_t            : 25;
    } RX_ORDSET_b;
  } ;
  
  union {
    __IM  uint32_t RX_PAYSZ;                    /*!< UCPD Rx Paysize Register                                                  */
    
