unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t RXPAYSZ    : 10;           /*!< RXPAYSZ                                                                   */
            uint32_t            : 22;
    } RX_PAYSZ_b;
  } ;
  
  union {
    __IM  uint32_t RXDR;                        /*!< UCPD Rx Data Register                                                     */
    
    struct {
      __IM  uint32_t RXDATA     : 8;            /*!< RXDATA                                                                    */
            uint32_t            : 24;
    } RXDR_b;
  } ;
  
  union {
    __IOM uint32_t RX_ORDEXT1;                  /*!< UCPD Rx Ordered Set Extension Register 1                                  */
    
    struct {
      __IOM uint32_t RXSOPX1    : 20;           /*!< RXSOPX1                                                                   */
            uint32_t            : 12;
    } RX_ORDEXT1_b;
  } ;
  
  union {
    __IOM uint32_t RX_ORDEXT2;                  /*!< UCPD Rx Ordered Set Extension Register 2                                  */
    
    struct {
      __IOM uint32_t RXSOPX2    : 20;           /*!< RXSOPX2                                                                   */
            uint32_t            : 12;
    } RX_ORDEXT2_b;
  } ;
} UCPD1_Type;                                   /*!< Size = 60 (0x3c)                                                          */



/* =========================================================================================================================== */
/* ================                                       USB_FS_device                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief USB_FS_device (USB_FS_device)
  */

typedef struct {                                /*!< USB_FS_device Structure                                                   */
  
  union {
    __IOM uint32_t EP0R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP0R_b;
  } ;
  
  union {
    __IOM uint32_t EP1R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP1R_b;
  } ;
  
  union {
    __IOM uint32_t EP2R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP2R_b;
  } ;
  
  union {
    __IOM uint32_t EP3R;                        /*!< USB endpoint n register                                                   */
    
