unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP3R_b;
  } ;
  
  union {
    __IOM uint32_t EP4R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP4R_b;
  } ;
  
  union {
    __IOM uint32_t EP5R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP5R_b;
  } ;
  
  union {
    __IOM uint32_t EP6R;                        /*!< USB endpoint n register                                                   */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP6R_b;
  } ;
  
  union {
    __IOM uint32_t EP7R;                        /*!< USB endpoint n register                                                   */
    
