unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< EA                                                                        */
      __IOM uint32_t STAT_TX    : 2;            /*!< STAT_TX                                                                   */
      __IOM uint32_t DTOG_TX    : 1;            /*!< DTOG_TX                                                                   */
      __IOM uint32_t CTR_TX     : 1;            /*!< CTR_TX                                                                    */
      __IOM uint32_t EP_KIND    : 1;            /*!< EP_KIND                                                                   */
      __IOM uint32_t EP_TYPE    : 2;            /*!< EP_TYPE                                                                   */
      __IOM uint32_t SETUP      : 1;            /*!< SETUP                                                                     */
      __IOM uint32_t STAT_RX    : 2;            /*!< STAT_RX                                                                   */
      __IOM uint32_t DTOG_RX    : 1;            /*!< DTOG_RX                                                                   */
      __IOM uint32_t CTR_RX     : 1;            /*!< CTR_RX                                                                    */
            uint32_t            : 16;
    } EP7R_b;
  } ;
  __IM  uint32_t  RESERVED[8];
  
  union {
    __IOM uint32_t CNTR;                        /*!< USB control register                                                      */
    
    struct {
      __IOM uint32_t FRES       : 1;            /*!< FRES                                                                      */
      __IOM uint32_t PDWN       : 1;            /*!< PDWN                                                                      */
      __IOM uint32_t LP_MODE    : 1;            /*!< LP_MODE                                                                   */
      __IOM uint32_t FSUSP      : 1;            /*!< FSUSP                                                                     */
      __IOM uint32_t RESUME     : 1;            /*!< RESUME                                                                    */
      __IOM uint32_t L1RESUME   : 1;            /*!< L1RESUME                                                                  */
            uint32_t            : 1;
      __IOM uint32_t L1REQM     : 1;            /*!< L1REQM                                                                    */
      __IOM uint32_t ESOFM      : 1;            /*!< ESOFM                                                                     */
      __IOM uint32_t SOFM       : 1;            /*!< SOFM                                                                      */
      __IOM uint32_t RESETM     : 1;            /*!< RESETM                                                                    */
      __IOM uint32_t SUSPM      : 1;            /*!< SUSPM                                                                     */
      __IOM uint32_t WKUPM      : 1;            /*!< WKUPM                                                                     */
      __IOM uint32_t ERRM       : 1;            /*!< ERRM                                                                      */
      __IOM uint32_t PMAOVRM    : 1;            /*!< PMAOVRM                                                                   */
      __IOM uint32_t CTRM       : 1;            /*!< CTRM                                                                      */
            uint32_t            : 16;
    } CNTR_b;
  } ;
  
  union {
    __IOM uint32_t ISTR;                        /*!< USB interrupt status register                                             */
    
    struct {
      __IOM uint32_t EP_ID      : 4;            /*!< EP_ID                                                                     */
      __IOM uint32_t DIR        : 1;            /*!< DIR                                                                       */
            uint32_t            : 2;
      __IOM uint32_t L1REQ      : 1;            /*!< L1REQ                                                                     */
      __IOM uint32_t ESOF       : 1;            /*!< ESOF                                                                      */
      __IOM uint32_t SOF        : 1;            /*!< SOF                                                                       */
      __IOM uint32_t RESET      : 1;            /*!< RESET                                                                     */
      __IOM uint32_t SUSP       : 1;            /*!< SUSP                                                                      */
      __IOM uint32_t WKUP       : 1;            /*!< WKUP                                                                      */
      __IOM uint32_t ERR        : 1;            /*!< ERR                                                                       */
      __IOM uint32_t PMAOVR     : 1;            /*!< PMAOVR                                                                    */
      __IOM uint32_t CTR        : 1;            /*!< CTR                                                                       */
            uint32_t            : 16;
    } ISTR_b;
  } ;
  
  union {
    __IM  uint32_t FNR;                         /*!< USB frame number register                                                 */
    
    struct {
      __IM  uint32_t FN         : 11;           /*!< FN                                                                        */
      __IM  uint32_t LSOF       : 2;            /*!< LSOF                                                                      */
      __IM  uint32_t LCK        : 1;            /*!< LCK                                                                       */
      __IM  uint32_t RXDM       : 1;            /*!< RXDM                                                                      */
      __IM  uint32_t RXDP       : 1;            /*!< RXDP                                                                      */
            uint32_t            : 16;
    } FNR_b;
  } ;
  
  union {
    __IOM uint32_t DADDR;                       /*!< USB device address                                                        */
    
