unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t ADD        : 7;            /*!< ADD                                                                       */
      __IOM uint32_t EF         : 1;            /*!< EF                                                                        */
            uint32_t            : 24;
    } DADDR_b;
  } ;
  
  union {
    __IOM uint32_t BTABLE;                      /*!< Buffer table address                                                      */
    
    struct {
            uint32_t            : 3;
      __IOM uint32_t BTABLE     : 13;           /*!< BTABLE                                                                    */
            uint32_t            : 16;
    } BTABLE_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t BCDR;                        /*!< Battery Charging detector register                                        */
    
    struct {
            uint32_t            : 15;
      __IOM uint32_t DPPU       : 1;            /*!< DPPU                                                                      */
            uint32_t            : 16;
    } BCDR_b;
  } ;
} USB_FS_device_Type;                           /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRS                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CRS (CRS)
  */

typedef struct {                                /*!< CRS Structure                                                             */
  
  union {
    __IOM uint32_t CR;                          /*!< CRS control register                                                      */
    
    struct {
      __IOM uint32_t SYNCOKIE   : 1;            /*!< SYNC event OK interrupt enable                                            */
      __IOM uint32_t SYNCWARNIE : 1;            /*!< SYNC warning interrupt enable                                             */
      __IOM uint32_t ERRIE      : 1;            /*!< Synchronization or trimming error interrupt enable                        */
      __IOM uint32_t ESYNCIE    : 1;            /*!< Expected SYNC interrupt enable                                            */
            uint32_t            : 1;
      __IOM uint32_t CEN        : 1;            /*!< Frequency error counter enable This bit enables the oscillator
                                                     clock for the frequency error counter. When this bit is
                                                     set, the CRS_CFGR register is write-protected and cannot
                                                     be modified.                                                              */
      __IOM uint32_t AUTOTRIMEN : 1;            /*!< Automatic trimming enable This bit enables the automatic hardware
                                                     adjustment of TRIM bits according to the measured frequency
                                                     error between two SYNC events. If this bit is set, the
                                                     TRIM bits are read-only. The TRIM value can be adjusted
                                                     by hardware by one or two steps at a time, depending on
                                                     the measured frequency error value. Refer to Section7.3.4:
                                                     Frequency error evaluation and automatic trimming for more
                                                     details.                                                                  */
      __IOM uint32_t SWSYNC     : 1;            /*!< Generate software SYNC event This bit is set by software in
                                                     order to generate a software SYNC event. It is automatically
                                                     cleared by hardware.                                                      */
      __IOM uint32_t TRIM       : 7;            /*!< HSI48 oscillator smooth trimming These bits provide a user-programmable
                                                     trimming value to the HSI48 oscillator. They can be programmed
                                                     to adjust to variations in voltage and temperature that
                                                     influence the frequency of the HSI48. The default value
                                                     is 32, which corresponds to the middle of the trimming
                                                     interval. The trimming step is around 67 kHz between two
                                                     consecutive TRIM steps. A higher TRIM value corresponds
                                                     to a higher output frequency. When the AUTOTRIMEN bit is
                                                     set, this field is controlled by hardware and is read-only.               */
            uint32_t            : 17;
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< This register can be written only when the frequency error counter
                                                     is disabled (CEN bit is cleared in CRS_CR). When the counter
                                                     is enabled, this register is write-protected.                             */
    
    struct {
      __IOM uint32_t RELOAD     : 16;           /*!< Counter reload value RELOAD is the value to be loaded in the
                                                     frequency error counter with each SYNC event. Refer to
                                                     Section7.3.3: Frequency error measurement for more details
                                                     about counter behavior.                                                   */
      __IOM uint32_t FELIM      : 8;            /*!< Frequency error limit FELIM contains the value to be used to
                                                     evaluate the captured frequency error value latched in
                                                     the FECAP[15:0] bits of the CRS_ISR register. Refer to
                                                     Section7.3.4: Frequency error evaluation and automatic
                                                     trimming for more details about FECAP evaluation.                         */
      __IOM uint32_t SYNCDIV    : 3;            /*!< SYNC divider These bits are set and cleared by software to control
                                                     the division factor of the SYNC signal.                                   */
            uint32_t            : 1;
      __IOM uint32_t SYNCSRC    : 2;            /*!< SYNC signal source selection These bits are set and cleared
                                                     by software to select the SYNC signal source. Note: When
                                                     using USB LPM (Link Power Management) and the device is
                                                     in Sleep mode, the periodic USB SOF will not be generated
                                                     by the host. No SYNC signal will therefore be provided
                                                     to the CRS to calibrate the HSI48 on the run. To guarantee
                                                     the required clock precision after waking up from Sleep
                                                     mode, the LSE or reference clock on the GPIOs should be
                                                     used as SYNC signal.                                                      */
            uint32_t            : 1;
      __IOM uint32_t SYNCPOL    : 1;            /*!< SYNC polarity selection This bit is set and cleared by software
                                                     to select the input polarity for the SYNC signal source.                  */
    } CFGR_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< CRS interrupt and status register                                         */
    
