unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IM  uint32_t SYNCOKF    : 1;            /*!< SYNC event OK flag This flag is set by hardware when the measured
                                                     frequency error is smaller than FELIM * 3. This means that
                                                     either no adjustment of the TRIM value is needed or that
                                                     an adjustment by one trimming step is enough to compensate
                                                     the frequency error. An interrupt is generated if the SYNCOKIE
                                                     bit is set in the CRS_CR register. It is cleared by software
                                                     by setting the SYNCOKC bit in the CRS_ICR register.                       */
      __IM  uint32_t SYNCWARNF  : 1;            /*!< SYNC warning flag This flag is set by hardware when the measured
                                                     frequency error is greater than or equal to FELIM * 3,
                                                     but smaller than FELIM * 128. This means that to compensate
                                                     the frequency error, the TRIM value must be adjusted by
                                                     two steps or more. An interrupt is generated if the SYNCWARNIE
                                                     bit is set in the CRS_CR register. It is cleared by software
                                                     by setting the SYNCWARNC bit in the CRS_ICR register.                     */
      __IM  uint32_t ERRF       : 1;            /*!< Error flag This flag is set by hardware in case of any synchronization
                                                     or trimming error. It is the logical OR of the TRIMOVF,
                                                     SYNCMISS and SYNCERR bits. An interrupt is generated if
                                                     the ERRIE bit is set in the CRS_CR register. It is cleared
                                                     by software in reaction to setting the ERRC bit in the
                                                     CRS_ICR register, which clears the TRIMOVF, SYNCMISS and
                                                     SYNCERR bits.                                                             */
      __IM  uint32_t ESYNCF     : 1;            /*!< Expected SYNC flag This flag is set by hardware when the frequency
                                                     error counter reached a zero value. An interrupt is generated
                                                     if the ESYNCIE bit is set in the CRS_CR register. It is
                                                     cleared by software by setting the ESYNCC bit in the CRS_ICR
                                                     register.                                                                 */
            uint32_t            : 4;
      __IM  uint32_t SYNCERR    : 1;            /*!< SYNC error This flag is set by hardware when the SYNC pulse
                                                     arrives before the ESYNC event and the measured frequency
                                                     error is greater than or equal to FELIM * 128. This means
                                                     that the frequency error is too big (internal frequency
                                                     too low) to be compensated by adjusting the TRIM value,
                                                     and that some other action should be taken. An interrupt
                                                     is generated if the ERRIE bit is set in the CRS_CR register.
                                                     It is cleared by software by setting the ERRC bit in the
                                                     CRS_ICR register.                                                         */
      __IM  uint32_t SYNCMISS   : 1;            /*!< SYNC missed This flag is set by hardware when the frequency
                                                     error counter reached value FELIM * 128 and no SYNC was
                                                     detected, meaning either that a SYNC pulse was missed or
                                                     that the frequency error is too big (internal frequency
                                                     too high) to be compensated by adjusting the TRIM value,
                                                     and that some other action should be taken. At this point,
                                                     the frequency error counter is stopped (waiting for a next
                                                     SYNC) and an interrupt is generated if the ERRIE bit is
                                                     set in the CRS_CR register. It is cleared by software by
                                                     setting the ERRC bit in the CRS_ICR register.                             */
      __IM  uint32_t TRIMOVF    : 1;            /*!< Trimming overflow or underflow This flag is set by hardware
                                                     when the automatic trimming tries to over- or under-flow
                                                     the TRIM value. An interrupt is generated if the ERRIE
                                                     bit is set in the CRS_CR register. It is cleared by software
                                                     by setting the ERRC bit in the CRS_ICR register.                          */
            uint32_t            : 4;
      __IM  uint32_t FEDIR      : 1;            /*!< Frequency error direction FEDIR is the counting direction of
                                                     the frequency error counter latched in the time of the
                                                     last SYNC event. It shows whether the actual frequency
                                                     is below or above the target.                                             */
      __IM  uint32_t FECAP      : 16;           /*!< Frequency error capture FECAP is the frequency error counter
                                                     value latched in the time ofthe last SYNC event. Refer
                                                     to Section7.3.4: Frequency error evaluation and automatic
                                                     trimming for more details about FECAP usage.                              */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< CRS interrupt flag clear register                                         */
    
