unhuman-io/obot-controller/obot2/src/STM32G474.h
    struct {
      __IOM uint32_t SYNCOKC    : 1;            /*!< SYNC event OK clear flag Writing 1 to this bit clears the SYNCOKF
                                                     flag in the CRS_ISR register.                                             */
      __IOM uint32_t SYNCWARNC  : 1;            /*!< SYNC warning clear flag Writing 1 to this bit clears the SYNCWARNF
                                                     flag in the CRS_ISR register.                                             */
      __IOM uint32_t ERRC       : 1;            /*!< Error clear flag Writing 1 to this bit clears TRIMOVF, SYNCMISS
                                                     and SYNCERR bits and consequently also the ERRF flag in
                                                     the CRS_ISR register.                                                     */
      __IOM uint32_t ESYNCC     : 1;            /*!< Expected SYNC clear flag Writing 1 to this bit clears the ESYNCF
                                                     flag in the CRS_ISR register.                                             */
            uint32_t            : 28;
    } ICR_b;
  } ;
} CRS_Type;                                     /*!< Size = 16 (0x10)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CRC_BASE                    0x40023000UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define I2C3_BASE                   0x40007800UL
#define I2C4_BASE                   0x40008400UL
#define FLASH_BASE                  0x40022000UL
#define DBGMCU_BASE                 0xE0042000UL
#define RCC_BASE                    0x40021000UL
#define PWR_BASE                    0x40007000UL
#define RNG_BASE                    0x50060800UL
#define GPIOA_BASE                  0x48000000UL
#define GPIOB_BASE                  0x48000400UL
#define GPIOC_BASE                  0x48000800UL
#define GPIOD_BASE                  0x48000C00UL
#define GPIOE_BASE                  0x48001000UL
#define GPIOF_BASE                  0x48001400UL
#define GPIOG_BASE                  0x48001800UL
#define TIM15_BASE                  0x40014000UL
#define TIM16_BASE                  0x40014400UL
#define TIM17_BASE                  0x40014800UL
#define TIM1_BASE                   0x40012C00UL
#define TIM20_BASE                  0x40015000UL
#define TIM8_BASE                   0x40013400UL
#define TIM2_BASE                   0x40000000UL
#define TIM5_BASE                   0x40000C00UL
#define TIM3_BASE                   0x40000400UL
#define TIM4_BASE                   0x40000800UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define LPTIM1_BASE                 0x40007C00UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define USART3_BASE                 0x40004800UL
#define UART4_BASE                  0x40004C00UL
#define UART5_BASE                  0x40005000UL
#define LPUART1_BASE                0x40008000UL
#define SPI1_BASE                   0x40013000UL
#define SPI4_BASE                   0x40013C00UL
#define SPI3_BASE                   0x40003C00UL
#define SPI2_BASE                   0x40003800UL
#define EXTI_BASE                   0x40010400UL
#define RTC_BASE                    0x40002800UL
#define FMC_BASE                    0xA0000000UL
#define DMA1_BASE                   0x40020000UL
#define DMA2_BASE                   0x40020400UL
#define DMAMUX_BASE                 0x40020800UL
#define SYSCFG_BASE                 0x40010000UL
#define VREFBUF_BASE                0x40010030UL
#define COMP_BASE                   0x40010200UL
#define OPAMP_BASE                  0x40010300UL
#define HRTIM_Master_BASE           0x40016800UL
#define HRTIM_TIMA_BASE             0x40016880UL
#define HRTIM_TIMB_BASE             0x40016900UL
#define HRTIM_TIMC_BASE             0x40016980UL
#define HRTIM_TIMD_BASE             0x40016A00UL
#define HRTIM_TIME_BASE             0x40016A80UL
#define HRTIM_TIMF_BASE             0x40016B00UL
#define HRTIM_Common_BASE           0x40016B80UL
#define QUADSPI_BASE                0xA0001000UL
#define DAC1_BASE                   0x50000800UL
#define DAC2_BASE                   0x50000C00UL
#define DAC3_BASE                   0x50001000UL
#define DAC4_BASE                   0x50001400UL
#define ADC1_BASE                   0x50000000UL
#define ADC2_BASE                   0x50000100UL
#define ADC3_BASE                   0x50000400UL
#define ADC4_BASE                   0x50000500UL
#define ADC5_BASE                   0x50000600UL
#define ADC12_Common_BASE           0x50000300UL
#define ADC345_Common_BASE          0x50000700UL
#define FMAC_BASE                   0x40021400UL
#define CORDIC_BASE                 0x40020C00UL
#define SAI_BASE                    0x40015400UL
#define TAMP_BASE                   0x40002400UL
#define FDCAN_BASE                  0x4000A400UL
#define FDCAN1_BASE                 0x40006400UL
#define FDCAN2_BASE                 0x40006800UL
#define FDCAN3_BASE                 0x40006C00UL
#define UCPD1_BASE                  0x4000A000UL
#define USB_FS_device_BASE          0x40005C00UL
#define CRS_BASE                    0x40002000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

