unhuman-io/obot-controller/obot2/src/STM32G474.h
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define I2C3                        ((I2C1_Type*)              I2C3_BASE)
#define I2C4                        ((I2C1_Type*)              I2C4_BASE)
#define FLASH                       ((FLASH_Type*)             FLASH_BASE)
#define DBGMCU                      ((DBGMCU_Type*)            DBGMCU_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define RNG                         ((RNG_Type*)               RNG_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define GPIOB                       ((GPIOB_Type*)             GPIOB_BASE)
#define GPIOC                       ((GPIOC_Type*)             GPIOC_BASE)
#define GPIOD                       ((GPIOC_Type*)             GPIOD_BASE)
#define GPIOE                       ((GPIOC_Type*)             GPIOE_BASE)
#define GPIOF                       ((GPIOC_Type*)             GPIOF_BASE)
#define GPIOG                       ((GPIOC_Type*)             GPIOG_BASE)
#define TIM15                       ((TIM15_Type*)             TIM15_BASE)
#define TIM16                       ((TIM16_Type*)             TIM16_BASE)
#define TIM17                       ((TIM16_Type*)             TIM17_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define TIM20                       ((TIM1_Type*)              TIM20_BASE)
#define TIM8                        ((TIM1_Type*)              TIM8_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM5                        ((TIM2_Type*)              TIM5_BASE)
#define TIM3                        ((TIM3_Type*)              TIM3_BASE)
#define TIM4                        ((TIM3_Type*)              TIM4_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define LPTIM1                      ((LPTIM1_Type*)            LPTIM1_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define USART3                      ((USART1_Type*)            USART3_BASE)
#define UART4                       ((UART4_Type*)             UART4_BASE)
#define UART5                       ((UART4_Type*)             UART5_BASE)
#define LPUART1                     ((LPUART1_Type*)           LPUART1_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI4                        ((SPI4_Type*)              SPI4_BASE)
#define SPI3                        ((SPI4_Type*)              SPI3_BASE)
#define SPI2                        ((SPI4_Type*)              SPI2_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define FMC                         ((FMC_Type*)               FMC_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define DMA2                        ((DMA1_Type*)              DMA2_BASE)
#define DMAMUX                      ((DMAMUX_Type*)            DMAMUX_BASE)
#define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
#define VREFBUF                     ((VREFBUF_Type*)           VREFBUF_BASE)
#define COMP                        ((COMP_Type*)              COMP_BASE)
#define OPAMP                       ((OPAMP_Type*)             OPAMP_BASE)
#define HRTIM_Master                ((HRTIM_Master_Type*)      HRTIM_Master_BASE)
#define HRTIM_TIMA                  ((HRTIM_TIMA_Type*)        HRTIM_TIMA_BASE)
#define HRTIM_TIMB                  ((HRTIM_TIMB_Type*)        HRTIM_TIMB_BASE)
#define HRTIM_TIMC                  ((HRTIM_TIMC_Type*)        HRTIM_TIMC_BASE)
#define HRTIM_TIMD                  ((HRTIM_TIMD_Type*)        HRTIM_TIMD_BASE)
#define HRTIM_TIME                  ((HRTIM_TIME_Type*)        HRTIM_TIME_BASE)
#define HRTIM_TIMF                  ((HRTIM_TIMF_Type*)        HRTIM_TIMF_BASE)
#define HRTIM_Common                ((HRTIM_Common_Type*)      HRTIM_Common_BASE)
#define QUADSPI                     ((QUADSPI_Type*)           QUADSPI_BASE)
#define DAC1                        ((DAC1_Type*)              DAC1_BASE)
#define DAC2                        ((DAC1_Type*)              DAC2_BASE)
#define DAC3                        ((DAC1_Type*)              DAC3_BASE)
#define DAC4                        ((DAC1_Type*)              DAC4_BASE)
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define ADC2                        ((ADC1_Type*)              ADC2_BASE)
#define ADC3                        ((ADC3_Type*)              ADC3_BASE)
#define ADC4                        ((ADC1_Type*)              ADC4_BASE)
#define ADC5                        ((ADC3_Type*)              ADC5_BASE)
#define ADC12_Common                ((ADC12_Common_Type*)      ADC12_Common_BASE)
#define ADC345_Common               ((ADC12_Common_Type*)      ADC345_Common_BASE)
#define FMAC                        ((FMAC_Type*)              FMAC_BASE)
#define CORDIC                      ((CORDIC_Type*)            CORDIC_BASE)
#define SAI                         ((SAI_Type*)               SAI_BASE)
#define TAMP                        ((TAMP_Type*)              TAMP_BASE)
#define FDCAN                       ((FDCAN_Type*)             FDCAN_BASE)
#define FDCAN1                      ((FDCAN_Type*)             FDCAN1_BASE)
#define FDCAN2                      ((FDCAN_Type*)             FDCAN2_BASE)
#define FDCAN3                      ((FDCAN_Type*)             FDCAN3_BASE)
#define UCPD1                       ((UCPD1_Type*)             UCPD1_BASE)
#define USB_FS_device               ((USB_FS_device_Type*)     USB_FS_device_BASE)
#define CRS                         ((CRS_Type*)               CRS_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* STM32G474_H */


/** @} */ /* End of group STM32G474 */

/** @} */ /* End of group  */
